[{"description": "MUST PURCHASE PASSES AND PARKING IN ADVANCE!\nBring the entire family and come enjoy Austin's ONLY and the Hill Country's BEST Hot Air Balloon Festival!\nAddress and Details: https://victorycup.org/derbyday/\nWatch the Official Kentucky Derby in style! The Victory Cup Polo Match, which has been called “The Best Kentucky Derby Party in Texas” returns to Austin, TX on Saturday, May 4th. Dust off the lucky hats, pastel dresses and seersucker suits, and bring the kids and dogs for a day of fun at the Victory Cup Polo Match and Kentucky Derby Party in Austin, Texas!\n\n\n\n\n\nGet ready to cheer on several live polo matches leading up to a live broadcast of the “the most exciting 2 minutes in sports” -- The Kentucky Derby on a huge LED jumbotron screen on the polo field. Hot Air Balloons are a fun and important part of this festival but extremely weather contingent. Balloons. Polo. Live Music. Fashion. Food. Drinks. Vendors. In its fifteenth year, this event isn’t just a polo match or balloon festival, it’s a networking and social destination drawing thousands for each event. For those who are primarily attending to see balloons only please come prepared to enjoy the full festival schedule and understand that weather may ground balloons. The best way to experience the Kentucky Derby, without being at the Derby! You will be on the field, with the horses and players and have an amazing excuse to get dressed up and enjoy some awesome spring weather. Not just about the Derby, get ready to enjoy a wide range of phenomenal food from dozens of Austin Chefs in the Victory Cup Vending area and sip delicious Derby cocktails from dozens of local and national brands. The day starts at day break with a scheduled Hot Air Balloon launch, on the polo field around 7AM! After the Hot Air Balloon launch (weather permitting), the food, wine and polo portion of the schedule kicks off for all passholders including Golden Mallet VIP’s and Founder’s Lounge Passholders. The VIP portion of the event will include live music, a Hospitality Alcohol Tasting Tent opening at 11AM, casual Fieldside Dining, rivalry Polo Matches, and a kids play area for all passholders! The Polo Matches will go from approximately 11AM until 4PM. Balloon Pilots will return to the property in later afternoon and will be setting up at 4PM on Saturday, on the sides of the polo field, for a night time burn, glow and tethered rides. Everyone should join us for an evening Hot Air Balloon Glow and Tethered Rides, if the weather cooperates, from 4PM until approximately 9PM. Founder’s Lounge and Field Side Dinner Guest Passholders will also be able to enjoy a casual Field Side Dinner on the Polo Field around 4:30PM. Hot Air Balloon Passholders, VIP Guests and General Admission Passes include the Hot Air Balloon portion of the event schedule starting at sunrise (7AM) and then again in the afternoon (4PM) lasting until sunset (weather permitting). Balloons activations are morning and night ONLY and are NOT on site between 10AM and 4PM. Watch social media for updates. Come relaxed or dressed to the nines, this is a kid friendly and pet friendly event. There will be a friendly Best Dressed Man and Woman Competition and Victory Cup attendees are encouraged to get dressed up to enjoy a gorgeous spring afternoon. Guests will enjoy taking in the majesty of the horses, the sights of beautiful people and the thrill of heart pounding polo! Additionally, there will be a Golden Mallet Tent and an exclusive Founder’s Lounge VIP Area for guests who want to enjoy a more refined experience while they mix and mingle with premier event sponsors and partners and even the polo players themselves. The Victory Cup will be hosted on Saturday, May 4, 2018 at: Victory Cheval Polo Club located at: 13628 Gregg Manor Rd, Manor, TX 78653. Tickets and sponsorships now on available and can be purchased at: victorycup.org/derbyday.\n\n\n\n\n\n", "title": "Austin's Hot Air Balloon Festival", "selectedPreferences": ["Active", "Cultural"], "selectedCategories": ["Sports", "Family", "Food&Drink"], "primaryPreference": "Cultural", "primaryCategory": "Food&Drink"}, {"description": "Our desire is for you is to come into the fullness of who you are created to be. We pray that you will flourish in all things. We also pray that your “roots grow down into Him, and that your lives would be built on Him, that your faith would grow strong in the truth you were taught, and you will overflow with thankfulness.” It is our hope that as you come “in” to our women’s conference, that you will walk “out” in bloom.\nMore info about BLOOM, visit: BLOOMCONFERENCE.CO\n\nApril 25\n4pm Check-in + Registration\n7pm Opening & Worship \n8pm - Session 1: Lorisa Miller\n\nApril 26\n9:30am Check-in + Doors Open\n10am – Worship \n11am - Session 2: Autumn Williams\n12pm - 2pm Lunch Break\n2pm - 3pm Breakout Session 1\n3pm - 4pm Breakout Session 2\n4pm - 6:30pm Dinner Break\n6pm Doors Open\n7pm Worship \n8pm - Session 3: Jevanna Cherrington\n\nApril 27\n10am - Prayer Room\n10am - 2pm H2 Rooms & Encounter Stations \n", "title": "BLOOM Women's Conference", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "Huddle Up with TEACH to celebrate our educators and learn more about TEACH, while sampling Saint Arnold's brews and munching on TacoDeli.", "title": "Huddle Up for TEACH", "selectedPreferences": ["Cultural", "Relaxing"], "selectedCategories": ["Professional", "Family", "Food&Drink"], "primaryPreference": "Relaxing", "primaryCategory": "Food&Drink"}, {"description": "YOUTH FOOTBALL CLINIC\nNorthwestern Football invites youth in grades 8th and under to participate in a football skills clinic.  Participants will have the opportunity to participate in basic drills and learn the fundamentals all while interacting with members of the Northwestern football program.\nSaturday, April 6, 2019\nRyan Fieldhouse - Evanston, Illinois\n*Please note, this event is indoors. Capacity is limited. You must register for the clinic participant as well as for any spectators. Tickets are required for everyone who enters the building. No walk-up registration will be availalbe.\n- FREE PARKING (NORTH CAMPUS GARAGE) AND ADMISSION -\nEVENT TIMELINE\n11:30 a.m. - Clinic Check-in Starts\n11:55 a.m. - Youth Clinic Begins* - Northwestern Football Guest Speaker\n1 p.m. (approx.) - Youth Clinic Concludes\n\n*Participants do not need to wear pads or helmets, but athletic attire is suggested.  Registration is required and space is limited.  The clinic will last about one hour.  All participants must have a completed waiver (to be sent at a later date) on file in order to participate in the clinic. \n REGISTRATION DEADLINE: APRIL 5\n*Please note, registration is first-come, first-serve, and spots are limited. You must register for the clinic participant as well as for any spectators. Tickets are required for everyone who enters the building. No walk-up registration will be available.\n“All Northwestern Clinics are open to any/all registrants and are only limited by number, age, grade lever, and/or gender.”\n", "title": "2019 Northwestern Football Youth Clinic", "selectedPreferences": ["Relaxing", "Active"], "selectedCategories": ["Free", "Family", "Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "Vanguard 9:05 AM\n***New time: Parade 9:30 AM\nThe Battle of Flowers Parade is the oldest event and largest parade of Fiesta® San Antonio attracting crowds of more than 350,000. It is the only parade in the United States produced entirely by women, all of whom are volunteers. These ladies, dressed on Parade day in yellow and wearing yellow hats, direct operations with the valued assistance of the Texas Army National Guard. In keeping with the original purpose of the Parade, honoring the heroes of the Alamo, participants place a floral tribute on the lawn as they pass in front of the Alamo.\nThe 2019 Battle of Flowers Parade will travel through Texas to discover what liest at the core of the State boasting the biggest heart with the theme, “For the Love of Texas!”\nFAQs\n\nWhere can I contact the organizer with any questions?\n\nUMAST Fiesta Parade Chair:\nCarisa Gamez\n(210) 207-5737\ncarisa.gamez@sanantonio.gov\nOR\nUMAST Secretary:\nPedro Reyes\n(210) 233-2355\npedro.reyes@saws.org\n\nDo I have to bring my printed ticket voucher to the event?\n\nYes. You will need to bring your printed ticket voucher to the parade to validate your seat(s).\n\nIs there a ticket limit?\n\n\nTicket sales are limited: 1st row (We encourage the maximum of six tickets per customer for the 1st row), 2nd row (20 tickets), 3rd row (20 tickets)\n\nWhat is the refund policy?\n\nThere are no refunds or exchanges allowed.", "title": "2019 Battle of Flowers Parade Reserved Street Chair Seating License #092", "selectedPreferences": ["Cultural"], "selectedCategories": ["Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "Margarita Madness 5k™ is a unique night 5K fun run focused less on speed and more on Margarita fun with friends and family.Margarita participants come from all different ages, shapes, sizes, and speeds; every participant will get Mad Margaritas™ and have the time of their life. ", "title": "Grand Rapids Margarita Madness 5k Run", "selectedPreferences": ["Active"], "selectedCategories": ["Food&Drink", "Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "WE’RE BRINGING CRAFT BEER TO WELLINGTON...AGAIN!\nYour ticket includes a commemorative sample cup and an afternoon of unlimited craft beer samples from many northern Colorado breweries.\nAll proceeds from this event will benefit the Wellington Colorado Main Streets Program.\nLearn more at: https://wellingtonbrewfest.com/.", "title": "Wellington Brewfest 2019", "selectedPreferences": ["Relaxing", "Lit"], "selectedCategories": ["Food&Drink"], "primaryPreference": "Lit", "primaryCategory": "Food&Drink"}, {"description": "From the organizers of Ponyville Ciderfest and MLP-MSP F, Whinny City Pony Con is back for our fourth year! Chicagoland’s biggest My Little Pony: Friendship is Magic fan convention returns to the wonderful Hyatt Regency in Schaumburg, IL on April 5th – 7th, 2019!\r\nOur theme for 2019 is “Midwest Adventure”, where we will aim to capture the excitement of all kinds of experiences! Perhaps you’re travelling from far away places? Or maybe you’re discovering new people and making new friendships? Possibly even competing in exciting new challenges? You don’t need to visit ancient ruins for these things, because adventures can be found anywhere!\r\nWe look forward to once again bringing the excitement of MLP:FiM and its fandom to Chicagoland for a fun filled weekend of ponies, friends, fun and entertainment!", "title": "Whinny City Pony Con 2019", "selectedPreferences": ["Relaxing", "Active", "Active"], "selectedCategories": ["Food&Drink"], "primaryPreference": "Active", "primaryCategory": "Food&Drink"}, {"description": "\r\n\r\nTICKETS GO ON SALE FRIDAY DECEMBER 21st!\r\nALL TICKETS PURCHASES MUST BE ONLINE (NO TICKETS SOLD AT THE EVENT)\r\nPresented in part by:  Gordon Foodservice and The Ridge Hotel\r\nCome and enjoy burger samples from over a dozen of the areas best restaurants and chefs!  Ticket includes unlimited burger samples while they last.  Soft drinks, and other food items,  and live entertainment!", "title": "Geneva Lakes Burger Throwdown 8th Annual", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family", "Food&Drink"], "primaryPreference": "Relaxing", "primaryCategory": "Food&Drink"}, {"description": "The HJSA Conference features wonderful, eclectic, and inspiring national and regional speakers.  The full conference schedule can be found at www.HJSAonline.com.  Please join us for this amazing juvenile justice conference!!! ", "title": "2019 HJSA Conference Registration", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "\nJoin bestselling authors of contemporary and paranormal YA fiction and more at the Holiday Inn Tanglewood in Roanoke, Virginia on April 6, 2019 from 10am-4pm. This is a FREE family-friendly event for readers!\n\n\nEnjoy an afternoon of books, giveaways, and more as you get the latest releases from your favorite authors and discover new voices! PLUS, don't miss the fun after party from 7-10pm at the same location to get even more quality time with your favorite writers! Learn more and see our full list of authors at roanokeauthorinvasion.com.\n", "title": "Roanoke Author Invasion 2019", "selectedPreferences": ["Relaxing", "Cultural"], "selectedCategories": ["Family", "Free", "Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "Sing! ― A conference for pastors, musicians, and leaders to reform and encourage congregational singing August 19-21, Nashville TN.\r\nOur theme for Sing! 2019 is The Life of Christ - building on the foundation of the Gospel story in all we sing and seeing how it shapes the church’s year.\r\nThis conference exists to help pastors, musicians, and leaders build a Biblical understanding and creative vision for the congregational singing in their churches. Bringing together speakers and artists from many traditions and walks of life, our desire is to encourage churches towards a deeper, more dynamic view of theology, artistry and mission in congregational singing. \r\nSpeakers Include – Keith Getty, Kristyn Getty, John Piper, Joni Eareckson Tada, John MacArthur, Anne Graham, Lotz, D.A. Carson, Jackie Hill Perry, Fernando Ortega, Conrad Mbewe, Mark Dever, Os Guinness, Trip Lee, and many, many more!\r\nOnce you've completed your registration, consider expanding your conference experience by joining the 2019 Sing! Choir.  Click here for more info.  \r\nHotel information is available.  Click here to book now.", "title": "2019 Sing! Getty Music Worship Conference", "selectedPreferences": ["Relaxing", "Lit", "Active"], "selectedCategories": ["Shows", "Art"], "primaryPreference": "Active", "primaryCategory": "Art"}, {"description": "\nWE HAVE A NEW EVENT DATE:  Thursday, April 18, 2019 at 6pm\n-----------------------------------------------------------------------------------\nKira Cheree’ and EBB (Entrepreneur Business Basics) will host Conscious Conversations: Minority Entrepreneurship, Education and Economics in Wyandotte County.\nThe event will be held at the Kansas City Kansas Community College – Performing Arts Auditorium on Thursday, April 18th, 2019. The doors will open at 6:00pm.\n The discussion will feature a panel of notable guests: \n\n\nDell Gines, Sr. Community Development for Federal Reserve Bank of Kansas City\n\n\nDr. Charles Foust, Superintendent, USD 500\n\n\nMark Dupree, Sr., District Attorney for Wyandotte County\n\n\nAdditionally, we will be honoring Wyandotte County native, Dr. Latoria Chinn of International Speedway Corporation with the Legacy of Excellence Award for her many contributions and advocacy in Wyandotte County. \n\n", "title": "Conscious Conversation: Entrepreneurship | Economics | Education  ", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "Chi Omega 50 Years of Zeta ThetaEmbassy Suites Nashville SE – MurfreesboroApril 6, 2019~~ Two Events, a Brunch, and a Formal\nPlease buy tickets early. Tickets are limited due to space.Deadline to purchase tickets- March 15, 2019\nYou may buy tickets/tshirts through Eventbrite or download and print the Mail-In Order sheet which is located below.  \nEleusinian Brunch for all Zeta Theta Sisters - $4010:00-11:00 Registration for AlumnaeCoffee Bar and Mimosa Cash Bar for Alumnae11:00 MTSU Active Chi Omega Members Arrive11:00-2:00 BrunchKeynote Speaker-Emily Pentecost Ellis ('69)Group Pictures TakenTours of Chi Omega House2:30-4:30 Tours of Chi Omega HouseSign up at EventFormal for Alumnae Sisters (solo or with a date) - $75 per person6:30 pm - 12:00 amCocktail attireHeavy appetizers, dessert, and Cash barDJ and DancingVideo Presentation\n********************************************************************************\nMail In Order Sheet Option-Print order form and send payment to:Kalyn Catlett  2025 Mosaic Trail   Murfreesboro, TN 37130\nYou will receive an order confirmation via email.\nPrint Order Form: https://drive.google.com/file/d/1j6_D4oTbl0rVlizPU1aHL4q7wRm9PLlm/view?usp=sharin\n********************************************************************************\nClick here to see the  TSHIRT design.\nhttps://drive.google.com/file/d/12fvnWLZJx9aGpThL5MRrVbv-vubukBnE/view?usp=sharing\n********************************************************************************\nAccommodationsEmbassy Suites Nashville SE – Murfreesboro - April 5-7, 2019Rooms $159 a nightDeadline to receive Group Rate – March 4, 2019Group Name- Chi Omega Alumnae Chapter of MurfreesboroCode- COSPhone for Reservations- (615) 890-4464 or (800) 362-2779 orOnline Reservationshttps://embassysuites.hilton.com/en/es/groups/personalized/M/MBTESES-COS-20190405/index.jhtml?WT.mc_id=POG\n********************************************************************\nSponsors: Are you looking to promote your business or would just like to help out?\nDue to the expense of the venue, we are looking for monetary sponsors for the following items:Photo booth (evening) 1-3 sponsorsLiability Insurance- 1 sponsor- possibly an insurance brokerDecorations – 1-2 sponsorsFor more information: Please callMargaret Dill Andrea ('84) – 615-927-0002 Chairman of 50 Years of Zeta ThetaKalyn Catlett ('82) – (615) 308-5731 Chi Omega Murfreesboro- Alumnae Chapter President\n********************************************************************************\nUPLOAD YOUR Chi-O PHOTOS and VIDEOS for the video presentation presented at the formal.  We are looking for group photos/videos showing activities demonstrating sisterhood and MTSU involvement.  \nPlease scan and upload your photos with high resolution. Deadline to upload photos- March 15th.  Double click on link for Google Photos. \n1969-1979 https://photos.app.goo.gl/zhET7mKrjpaoXvYZ8\n1980-1989 https://photos.app.goo.gl/hXyqB6KmhKPdrojw8\n1990-1999 https://photos.app.goo.gl/FatPNKD3a6nxBeGv5\n2000-2009 https://photos.app.goo.gl/NQf3JxcYeUHCQ54A7\n2010-present https://photos.app.goo.gl/67a2upkgPaV12oQZA\n********************************************************************************\nThe Committee looks forward to celebrating this milestone with you in the Spring!  Hootie Hoo!!!! XOXO\n\n", "title": "Chi Omega - 50 Years of Zeta Theta ~  Two Events ~ A Brunch and A Formal", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Indiana High School Football authority Paul Condry and his team at the Indiana Football Digest as well as Regional Radio Sports Network collaborated with the Colts organization as well High School coaches to create a celebration of Indiana High School Football once per year. This event would become the Oscars® or ESPY’s® of football in Indiana.\nEach year, over 400 attendees to this banquet and award ceremony gather together to recognize the best players, coaches, and media representatives in Indiana High School Football. These award recipients are chosen after a panel of media and coaches review over 18,000 varsity players in Indiana.", "title": "2019 Griddy Awards Banquet", "selectedPreferences": ["Relaxing", "Cultural"], "selectedCategories": ["Family", "Sports"], "primaryPreference": "Cultural", "primaryCategory": "Sports"}, {"description": "TACO TUESDAYS : \nTHE HIVE BUCKHEAD RESTAURANT AND BAR ( 1845 Peachtree rd nw ATL ga 30309 : FORMER BUCKHEAD CAFE INTERMEZZO ) ( $2 TACOS / $7 MARGARITAS/ $5 SANGRIA / $7 MOJITOS / $5 SHOTS / $15 SHISHA /$100 BTLS : SPECIALS ) .  FOOD / MINGLE /  HD TVS / BRUNCH HAPPY HOUR SPECIALS / DINE /PARKING IN THE REAR :", "title": " INTERNATIONAL AFFAIR  ON TUESDAYS  IN ATL  :THE HIVE BUCKHEAD ", "selectedPreferences": ["Cultural", "Relaxing"], "selectedCategories": ["Family", "Food&Drink"], "primaryPreference": "Relaxing", "primaryCategory": "Food&Drink"}, {"description": "The 6th Annual Saint LAAA FaB --- BLACK PRIDE DAY, Celebrating the rich history and culture of people of African descent.The festival is FREE to the Public and will feature artifacts,art, music, dance, food, vendors, children activities, health & wellness, prizes and so much more. \n\nSeeking Sponsorship,Vendors, Entertainment & Volunteers!!!\nVist: www.saintlaaafab.com \n\nDon't forgot to like,follow, & Share!\nFacebook, Instagram, Twitter @saintlaaafab\n", "title": "6th Annual Saint Louis African American Artifacts Festival and Bazaar", "selectedPreferences": ["Active", "Cultural"], "selectedCategories": ["Art", "Free", "Shows", "Food&Drink", "Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "DOORS: 7:00 PM // SHOW: 8:30 PM", "title": "40 OZ To Freedom (Sublime Tribute Band)", "selectedPreferences": ["Lit"], "selectedCategories": ["Shows", "Nightlife", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "Free Show!The premiere Dallas country cover band, Straight Tequila Night, plays all your favorite hits from 90s country radio! Come sing along to the songs of Garth Brooks, George Strait, Alan Jackson, Brooks and Dunn, Tim McGraw, Dwight Yoakam, and more!\nGET VIP SEATING: Enjoy Legacy Hall in style with your very own reserved area. Click this link and fill out the SECOND FLOOR RESERVED AREA section.\nFREE EVENT DETAILS: This is a FREE event, therefore registration does NOT guarantee seating or access to the venue. Seating is first come, first served. Tickets will NOT be collected. PRO TIP #12: Arrive early to popular events as seating may go quickly!\nYOUR VISIT: Is this your first time visiting us? Great! Legacy Hall is an innovative, European-style food hall combining the best elements of a beer garden, craft brewery and live entertainment venue. You’ll love the three-story, 55,000-square-foot space featuring more than 20 curated restaurant stalls offering flavors from around the world. Plus, the Box Garden which is the Hall’s expansive outdoor entertainment venue, where guests sing along to live music, watch movies, cheer on live sports broadcasts and more. To learn more, visit www.legacyfoodhall.com or call (972) 846-4255. Get social with Legacy Hall (@legacyfoodhall) on Facebook, Instagram and Twitter.", "title": "Straight Tequila Night (90s Country Covers)", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Free", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "A moving drama based on the gospel of John and Leonardo da Vinci’s famous painting, “The Last Supper.”\nTICKETS ARE FREE\nSunday Matinée - April 14, 2:00 p.m.Tuesday, April 16, 7:00 p.m.Wednesday, April 17, 7:00 p.m.Thursday, April 18, 7:00 p.m.", "title": "The Living Last Supper", "selectedPreferences": ["Relaxing", "Cultural"], "selectedCategories": ["Art", "Free", "Family", "Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "The 20th Annual Denver Career Fair - Premier Sales & Professional Job Fair\nJune 19, 2019 at the DoubleTree Denver - Denver Tech Center.\n \nMeet, sit down and interview with Nationally Known employers at Denver Career Fair and Job Fair - Premiere Sales & Professional Career Fair.  Professional Dress (suit & tie or business suit) Bring plenty of resumes. \n \nIndustries represented at our Career Fairs:   Sales,  Inside Sales, Outside Sales, Retail Sales, Financial, B2B Sales, Customer Service, Healthcare Sales, Entry Level Management, Consulting, Customer Service, Security Sales, Pharmaceutical Sales, Recruiting, Insurance, Marketing Sales, Sales Management, Medical Device and more... \n__________________________________________________________________________\n20th Annual Denver Career Fair & Job Fair - Sales & Professional Job FairWednesday - June 19, 201911:30 AM to 1:30 PMDoubleTree Denver Tech Center 7801 E Orchard RdGreenwood Village, CO 80111\nNote: Eventbrite Map may not be correct \n\n*Come with your Eventbrite ticket for 1st admission\n\n** EMPLOYERS: Please Contact us for Best Rates / DCG Career Fairs\n \nBenefit packages at The Denver Career Fair & Job Fair vary by company, most include a combination of the following : \n \nCorporate Benefits Packages: Salaried PositionsBase Salary + Positions BonusesCommissionCar or Car AllowanceCell/LaptopFull Medical/Dental/VisionLife InsurancePaid HolidaysExpense AccountComplete Corporate TrainingCollege Tuition ReimbursementManagement TrainingRapid Career Advancement\n \n*Free Attendance and Parking for Candidates at the Denver Career Fair and Job Fair - Open to all candidates! \n \n **Be prepared to interview with hiring managers and recruiters, Professional Dress (suit & tie or business suit) required. Bring plenty of resumes. \n \nEMPLOYERS:\nHundreds of Denver's Best and Most Qualified Candidates Attend The Denver Career Fair Every Year. Please contact us for Special Discount Rates to participate.\nwww.diversitycareergroup.com\nor\nRequest Employer Pricing Information\nINDUSTRIES THAT HIRE AT OUR CAREER FAIRSAccommodations, Accounting, Advertising, Aerospace, Agriculture & Agribusiness, Air Transportation, Apparel & Accessories, Auto, Banking, Beauty & Cosmetics, Biotechnology, Chemical, Communications, Computer, Construction, Consulting, Consumer Products, Education, Electronics, Employment, Energy, Entertainment & Recreation, Fashion, Financial Services, Fine Arts, Food & Beverage, Green Technology, Health, Information, Information Technology, Insurance, Journalism & News, Legal Services, Manufacturing, Media & Broadcasting, Medical Devices & Supplies, Motion Pictures & Video, Music, Pharmaceutical, Public Administration, Public Relations, Publishing, Real Estate, Retail, Service, Sports, Technology, Telecommunications, Tourism, Transportation, Travel, Utilities, Video Game, Web Services\nKey Words: Account Executive, Sales Representative, Account Manager, B2B, retail sales, furniture, sales, financial services, customer service, Business Development Manager, Sales Manager, Financial Services, Insurance, Telecommunications, Pharmaceutical, Hospital Representative, Medical, Marketing, Advertising, Healthcare, office equipment, Telecom, Information Technology, Software, Security Services, Advertising, Payroll, Sales Management, Sales Trainee, Management Trainee, At home sales, cold calling, telemarketer, telemarketing, financial advisor, insurance sales, outside sales, outside sales representative, sales executive, salesman, salesperson, sales women, marketing", "title": "Denver Career Fair & Job Fair June 19, 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "Béla Fleck and the Flecktones feat. Victor Wooten, Roy \"Futureman\" Wooten and Howard Levy at Tower Theatre in Oklahoma City on June 24.", "title": "Béla Fleck and the Flecktones", "selectedPreferences": ["Relaxing", "Lit"], "selectedCategories": ["Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "Visit www.railsconf.com for details!\r\nView our conference terms & conditions regarding privacy and data here.", "title": "RailsConf 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "\n\nJoin us on June 13, 2019 for the Charlotte Career Fair. \nMeet face to face with recruiters and hiring managers to apply for positions in: \n\n\nSales\n\n\nManagement\n\n\nGovernment\n\n\nCustomer Service/Call Center\n\n\nInsurance\n\n\nBanking/Financial Services\n\n\nHealthcare\n\n\nEducation\n\n\nIT/Engineering \n\n\nRetail.....and more\n\n\n\nThe career fair starts at 9:30 AM and professional dress is strongly recommended. This job fair is free to job seekers and allows you to connect face to face with top employers. \n A list of the attending employers and open positions will be sent to all registered candidates the week before the career fair. \nTo apply directly to open positions please register here: http://talentcareerfairs.com/candidates/ \nWe are looking forward to seeing you there!\n\nRecruitment Services\nTalent Career Fairs.\n800-201-3873\n\n\n", "title": "Charlotte 2019 Career Fair. ", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "Six Figure School presented by Founder & CEO Donald Bradley\n10 a.m. Six Figure School\n All Attendees Must Be Registered to Attend\nNo opportunity Meeting Will be Held\nAdvanced Online Ticket Only - No Ticket Sales At Door\nNo Refunds/No Transfers\n", "title": "PlanNet Marketing Six Figure School", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "The Majestic and KULA Gallery's All White Derby Day Party presenting Maestro J!\nCome watch live art painting by Louisville's own ArtbyRice!\nSo be sure to come dressed in you favorite Derby attire!\nCustom Derby drinks created by Sly and Happy Endings Bar Service.\nThis is a 21 and over event.\nCouch Sections available!  Bottle service available!\nMajestic Cafe will be open!", "title": "All White Day Party", "selectedPreferences": ["Relaxing", "Cultural", "Lit"], "selectedCategories": ["Food&Drink", "Art"], "primaryPreference": "Lit", "primaryCategory": "Art"}, {"description": "The Golden Tiger Reunion is an annual event intended to serve as a celebration for the 50th anniversary class as well as the class reunion for all classes who have already been inducted as Golden Tigers in years past.\nGolden Tigers are invited back to campus to reunite with their old classmates and friends to reminisce about their days as students and to learn about what is happening at Clemson today.\nThe 50th class will be honored by being inducted into the Golden Tiger Society which is a formal event similar to graduation. Each Golden Tiger will be presented with a Golden Tiger lapel pin and an official Golden Tiger Society Induction Certificate to commemorate the day. The Golden Tiger class will also present their Class Gift to the university during an additional celebration along with participating in the other reunion activities planned for all to enjoy.\nClasses that have previously been inducted into the Golden Tiger Society during their 50th will enjoy university presentations, campus updates, campus tours and activities.\nSchedule of Events\nWednesday, June 12, 2019Class of 1969 Meet & Greet - FREESole on the Green, Madren Conference Center \nThursday, June 13, 2019\n7:30 – 9:00am - Registration for Class of 1969 at Madren Center\n9:00am – Transportation of 1969 Class to Tillman Hall for Induction Ceremony\n9:30 – 11:15am - Golden Tiger Induction Ceremony for Class of 1969 - FREEClass of 1969 Gift Celebration / Dedication to follow ceremonyClass photo will be taken at this timeAttire: Sunday dress; men please wear blue blazer & tie. \n11:15am – Transportation from Tillman Hall to Allen N. Reeves Football Complex for football operations facility tour. Transportation back to Madren Conference Center following tour. FREE\n12:45am – 2:15pm – Lunch Break “Lunch on your Own” *Price & transportation not included in registration*Time on your own to rest/refresh, enjoy Clemson, downtown and campus.\n2:15pm – Meet at Madren Center for Bus transportation to Strom Thurmond Institute \n2:30 – 4:00pm – Orange Glove Event  – Strom Thurmond Institute - FREETake a walk down memory lane through various Clemson archives and artifacts from the year 1969 \n4:00pm – Bus transportation from Strom Thurmond to Madren Center\n4:00 - 6:00pm – Refresh Break back at the Madren CenterSocial hour with cash bar (beer and wine) in Madren Center's Bellsouth Lobby\n6:00pm – until – Welcome Reception/Dinner – All Reunion Guests - $40 per personAttire: Casual Dress. Madren Center Ball Room\nFriday, June 14, 2018\n9:00 – 11:30am – Tours & Activities for all reunion guests. Tours and activities to be announced closer to the date. Tours and Activities are first come, first served and participants must register for these activities at check-in. \nNoon – Clemson Family Luncheon - $40 per personAll Reunion Attendees – Remarks from faculty & staff. Casual Dress. \n1:00 - 4:00pm - Members of the Class of 1969 are invited to travel via bus to Greenville, SC to CU iCAR for a facility tour. This tour will a paid ticket. Limited to 80 guests. $10 per person \n2:00 – 5:00pm – Tours & Activities for all reunion guests. Tours and activities to be announced closer to the date. Tours and Activities are first come, first served and participants must register for these activities at check-in. \n5:00 – 6:00pm – Social Hour – Cash Bar. Madren Center Lobby (all reunion guests)\n6:00pm – Until – 1969 Class Party $65 per person", "title": "Class of 1969 Golden Tiger Reunion", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "It's about to be that time of year again... Kingz of the South, Mother Chapter Annual ROYAL BASH VI!!\nYou know how we do it:\n\nHospitality at its finest\n1000's of bikes\nVendors selling a wide variety of merchandise\nMouth-watering food\nBest DJ's this side of the Mississippi\n\nWho is going to be there...???  EVERYBODY, you know the KINGZ bring em out!!!!  The Dirty South, East Coast, Mid-West, and especially the West Coast.  This is that ONE event, you dont want to miss... \nOnline tickets are $10 until April 28th... prices go up after that.  Tickets cover admission for all events during the Kingz Week.", "title": "Kingz of the South Mother Chapter Royal Bash VI", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Shows", "Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Join the MN Leadership Council on Aging with Volunteers of America MN/WI, Care Providers of Minnesota, and AARP Minnesota to screen Lives Well Lived, a feature documentary film by Sky Bergman that celebrates the incredible wit and wisdom of adults 75 to 100 years old who are living their lives to the fullest. Encompassing over 3000 years of experience, forty people share their secrets and insights to living a meaningful life. Their intimate memories and inspiring personal histories will make you laugh, perhaps cry, but mostly inspire you. \nThe free event (pre-registration required) includes screening of the film, conversation with Sky Bergman, and a soda and popcorn.", "title": "Lives Well Lived Screening", "selectedPreferences": ["Cultural"], "selectedCategories": ["Free", "Art", "Family", "Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}]
