[{"description": "Join World Changers Church International as we celebrate the gift of Jesus during our Good Friday Service, Friday, April 19th, in the World Dome. The service will feature a performance by Vashawn Mitchell. Doors open at 6:00 p.m., and service begins promptly at 7:00 p.m. We hope to see you there!", "title": "Good Friday Worship Service featuring Vashawn Mitchell", "selectedPreferences": ["Relaxing", "Cultural"], "selectedCategories": ["Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "The 2019 Mid-America Passion Play\n\nJoin us as we celebrate the story of God's redeeming love!\nUnder the direction of Dr. Jim Whitmire, this theatrical presentation includes a cast of over 400 people, including orchestra and choir, proclaiming the Good News of eternal life through Jesus Christ.\n\nMid-America Baptist Theological Seminary | Crossroads Baptist Church\n", "title": "Mid-America Passion Play Saturday, April 13, 2019 | 2PM", "selectedPreferences": ["Cultural"], "selectedCategories": ["Art"], "primaryPreference": "Cultural", "primaryCategory": "Art"}, {"description": "Join us for our 3rd annual Good Friday Brunch party featuring Vince Adams, Maurice \"Ice\" Culpepper from V103 and Dj Tysko from Soul 106.\nVince Adams 3pm\nMaurice Culpepper 6pm\nDj Tysko 10pm\n\nFree brunch with drink purchase\nNo cover all day\n\n\n\n\n\n\n\n", "title": "Good Friday ", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Art"], "primaryPreference": "Relaxing", "primaryCategory": "Art"}, {"description": "MUST PURCHASE PASSES AND PARKING IN ADVANCE!\nBring the entire family and come enjoy Austin's ONLY and the Hill Country's BEST Hot Air Balloon Festival!\nAddress and Details: https://victorycup.org/derbyday/\nWatch the Official Kentucky Derby in style! The Victory Cup Polo Match, which has been called “The Best Kentucky Derby Party in Texas” returns to Austin, TX on Saturday, May 4th. Dust off the lucky hats, pastel dresses and seersucker suits, and bring the kids and dogs for a day of fun at the Victory Cup Polo Match and Kentucky Derby Party in Austin, Texas!\n\n\n\n\n\nGet ready to cheer on several live polo matches leading up to a live broadcast of the “the most exciting 2 minutes in sports” -- The Kentucky Derby on a huge LED jumbotron screen on the polo field. Hot Air Balloons are a fun and important part of this festival but extremely weather contingent. Balloons. Polo. Live Music. Fashion. Food. Drinks. Vendors. In its fifteenth year, this event isn’t just a polo match or balloon festival, it’s a networking and social destination drawing thousands for each event. For those who are primarily attending to see balloons only please come prepared to enjoy the full festival schedule and understand that weather may ground balloons. The best way to experience the Kentucky Derby, without being at the Derby! You will be on the field, with the horses and players and have an amazing excuse to get dressed up and enjoy some awesome spring weather. Not just about the Derby, get ready to enjoy a wide range of phenomenal food from dozens of Austin Chefs in the Victory Cup Vending area and sip delicious Derby cocktails from dozens of local and national brands. The day starts at day break with a scheduled Hot Air Balloon launch, on the polo field around 7AM! After the Hot Air Balloon launch (weather permitting), the food, wine and polo portion of the schedule kicks off for all passholders including Golden Mallet VIP’s and Founder’s Lounge Passholders. The VIP portion of the event will include live music, a Hospitality Alcohol Tasting Tent opening at 11AM, casual Fieldside Dining, rivalry Polo Matches, and a kids play area for all passholders! The Polo Matches will go from approximately 11AM until 4PM. Balloon Pilots will return to the property in later afternoon and will be setting up at 4PM on Saturday, on the sides of the polo field, for a night time burn, glow and tethered rides. Everyone should join us for an evening Hot Air Balloon Glow and Tethered Rides, if the weather cooperates, from 4PM until approximately 9PM. Founder’s Lounge and Field Side Dinner Guest Passholders will also be able to enjoy a casual Field Side Dinner on the Polo Field around 4:30PM. Hot Air Balloon Passholders, VIP Guests and General Admission Passes include the Hot Air Balloon portion of the event schedule starting at sunrise (7AM) and then again in the afternoon (4PM) lasting until sunset (weather permitting). Balloons activations are morning and night ONLY and are NOT on site between 10AM and 4PM. Watch social media for updates. Come relaxed or dressed to the nines, this is a kid friendly and pet friendly event. There will be a friendly Best Dressed Man and Woman Competition and Victory Cup attendees are encouraged to get dressed up to enjoy a gorgeous spring afternoon. Guests will enjoy taking in the majesty of the horses, the sights of beautiful people and the thrill of heart pounding polo! Additionally, there will be a Golden Mallet Tent and an exclusive Founder’s Lounge VIP Area for guests who want to enjoy a more refined experience while they mix and mingle with premier event sponsors and partners and even the polo players themselves. The Victory Cup will be hosted on Saturday, May 4, 2018 at: Victory Cheval Polo Club located at: 13628 Gregg Manor Rd, Manor, TX 78653. Tickets and sponsorships now on available and can be purchased at: victorycup.org/derbyday.\n\n\n\n\n\n", "title": "Austin's Hot Air Balloon Festival", "selectedPreferences": ["Active", "Cultural"], "selectedCategories": ["Sports", "Family", "Food&Drink"], "primaryPreference": "Cultural", "primaryCategory": "Food&Drink"}, {"description": "Our desire is for you is to come into the fullness of who you are created to be. We pray that you will flourish in all things. We also pray that your “roots grow down into Him, and that your lives would be built on Him, that your faith would grow strong in the truth you were taught, and you will overflow with thankfulness.” It is our hope that as you come “in” to our women’s conference, that you will walk “out” in bloom.\nMore info about BLOOM, visit: BLOOMCONFERENCE.CO\n\nApril 25\n4pm Check-in + Registration\n7pm Opening & Worship \n8pm - Session 1: Lorisa Miller\n\nApril 26\n9:30am Check-in + Doors Open\n10am – Worship \n11am - Session 2: Autumn Williams\n12pm - 2pm Lunch Break\n2pm - 3pm Breakout Session 1\n3pm - 4pm Breakout Session 2\n4pm - 6:30pm Dinner Break\n6pm Doors Open\n7pm Worship \n8pm - Session 3: Jevanna Cherrington\n\nApril 27\n10am - Prayer Room\n10am - 2pm H2 Rooms & Encounter Stations \n", "title": "BLOOM Women's Conference", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "Morgan Wallen, HARDY, and Saluda Shoals @ Hanahan Amphitheater May 18th. No refunds", "title": "Morgan Wallen", "selectedPreferences": ["Relaxing", "Lit"], "selectedCategories": ["Art", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "Huddle Up with TEACH to celebrate our educators and learn more about TEACH, while sampling Saint Arnold's brews and munching on TacoDeli.", "title": "Huddle Up for TEACH", "selectedPreferences": ["Cultural", "Relaxing"], "selectedCategories": ["Professional", "Family", "Food&Drink"], "primaryPreference": "Relaxing", "primaryCategory": "Food&Drink"}, {"description": "Hey Guys!\nThe ticket will be sold first come, first sold. We will sell a certain amount at each price. If you select a ticket and it says its sold out, then you will have to go to the next price up. \n2 Ticket Limit-\nEvent:\nAdler Planetarium\nTwo Exhibits will be open for all guests to walk through\nPhotobooth\nProfessional Photographer\nDJ \nDance Floor\nFood and Drinks will be Served for 4 hours ** for specific information regarding this please PM and SBA Eexc Board member**\n\nTICKET EXPLANATION:\nFull Ticket Package:\n\nDJPhotobooth & Professional Photographer Two Exhibits Open for Visitation Food and Refreshment *ask SBA member about the drink and food package* \nDry Ticket Package:\nDJPhotobooth & Professional Photographer Two Exhibits Open for Visitation Food \nVolunteer Dry Packet: \nMust come to the event 30 minutes before the start time. DJPhotobooth & Professional Photographer Two Exhibits Open for Visitation\n\n**We will also need 15 volunteers who already plan to buy dry tickets to come early, you will have no duties or responsibilities other than coming early- If interested you should buy the discounted ticket named: \"Dry Ticket Volunteer\" below ***", "title": "Barrister's Ball: A Formal Affair", "selectedPreferences": ["Relaxing", "Lit"], "selectedCategories": ["Food&Drink", "Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "The Kirwan Institute for the Study of Race and Ethnicity are national leaders in research on how implicit biases can unconsciously shape an individuals' actions and decisions. This training is intended to equip all attendees with a deeper understanding of our unconscious mental processing; the ways in which these implicit associations impact our decision-making despite our good intentions; and, what actions we can take to prevent and respond to the emergence of bias.\nPreshuslee Thompson, facilitation and research specialist with The Ohio State University, Kirwan Institute for the Study of Race and Ethnicity, will be your trainer for the morning. Ms. Thompson is a Columbus native and a graduate of The Ohio State University. Ms. Thompson holds a Bachelor's Degree in Criminology and Criminal Justice and minored in Women's Gender and Sexuality Studies and Sociology. Ms. Thompson is committed to facilitating trainings that leave audience members informed, equipped and committed to creating a more just and equitable society for all people.\n*Summit County Children Services is an Apporved Continuing Eduaction Provider through the State of Ohio Counselor, Social Worker & Marriage and Family Therapist Board. This session is approved for 3.25 hours for Social Workers and Counselors.   \n\nYOU MUST PROVIDE YOUR LICENSE NUMBER THE MORNING OF THE EVENT TO RECEIVE CEU'S.\nRESOURCE FAIR BEGINS AT 7:30 A.M., WHEN DOORS OPEN.", "title": "Close-Up on Implicit Bias   ", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family", "Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "Join us for our annual All-White event. We will board Galveston's largest Private Boat. Men bring ya cigars, ladies show off those cute white dresses! 3 levelsDJLive BandFood VendorsAfter Party$ Cash Bar $This event will sell out! We are taking over the island!Get your tickets ASAPVendor Space Available! \nYou won't want to miss this event!\n\n**No Refund**", "title": "She Is...Havana Nights!", "selectedPreferences": ["Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "MACHINE GUN KELLY'S E.S.T. FEST 6\r\nAugust 2 + 3, 20193495 Tugend Rd, Butler, OH 44822\r\n\r\nAre you ready for the most epic 48 hours of the year?!??!! Meet us for E.S.T. FEST 6 this summer!!!\r\nMore Camping Zones! New Parking Lots! Faster Festival Entry!!!Check out est-fest.com for more information\r\n18+ no exceptions.\r\nFAQ\r\nOfficial schedule will be posted on est-fest.com.\r\nSubscribe to our mailing list and follow us on Instagram for updates!!\r\n \r\n ", "title": "E.S.T. FEST 6", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "YOUTH FOOTBALL CLINIC\nNorthwestern Football invites youth in grades 8th and under to participate in a football skills clinic.  Participants will have the opportunity to participate in basic drills and learn the fundamentals all while interacting with members of the Northwestern football program.\nSaturday, April 6, 2019\nRyan Fieldhouse - Evanston, Illinois\n*Please note, this event is indoors. Capacity is limited. You must register for the clinic participant as well as for any spectators. Tickets are required for everyone who enters the building. No walk-up registration will be availalbe.\n- FREE PARKING (NORTH CAMPUS GARAGE) AND ADMISSION -\nEVENT TIMELINE\n11:30 a.m. - Clinic Check-in Starts\n11:55 a.m. - Youth Clinic Begins* - Northwestern Football Guest Speaker\n1 p.m. (approx.) - Youth Clinic Concludes\n\n*Participants do not need to wear pads or helmets, but athletic attire is suggested.  Registration is required and space is limited.  The clinic will last about one hour.  All participants must have a completed waiver (to be sent at a later date) on file in order to participate in the clinic. \n REGISTRATION DEADLINE: APRIL 5\n*Please note, registration is first-come, first-serve, and spots are limited. You must register for the clinic participant as well as for any spectators. Tickets are required for everyone who enters the building. No walk-up registration will be available.\n“All Northwestern Clinics are open to any/all registrants and are only limited by number, age, grade lever, and/or gender.”\n", "title": "2019 Northwestern Football Youth Clinic", "selectedPreferences": ["Relaxing", "Active"], "selectedCategories": ["Free", "Family", "Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "\n\nWHO:\nTheory Communications, One of Atlanta's leading communications agencies. \n\nWHAT:\nIn celebration of their 5th year anniversary, Theory Communications invites guests to join them and their clients for their anniversary soiree.\n\nWHEN:\nFriday, April 12, 2019\n10:00P - 1:00A\n\nWHERE:The Gathering Spot\n384 Northyards Blvd NW\nAtlanta, GA 30313", "title": "Theory Communications 5 Year Anniversary", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Art", "Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "A music and camping festival held in the Iowa countryside on August 2nd - 4th, 2019.", "title": "Hinterland Music Festival 2019", "selectedPreferences": ["Relaxing", "Lit"], "selectedCategories": ["Art", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "Flourish Women’s One Night Conference is a spectacular gathering of women that is full of worship, teaching, inspiration, fun, and empowerment! Our heart is to create a conference that will encourage you and awaken your God-given purpose. \n \nSpeaker Info: \nSarah Jakes Roberts \nSarah is the daughter of pastor, best-selling author, and film producer, Bishop T.D. Jakes and Mrs. Serita Jakes, author, media personality, and business executive. \nAlongside her husband, Touré Roberts, Sarah pastors a dynamic community of artists and professionals at The Potter’s House at One LA and The Potter’s House of Denver. Together they have six beautiful children and split their time between Los Angeles, CA and Denver, CO. \n\n\n \nFAQ:\nIs seating assigned? \nWe offer open seating throughout the conference. With that in mind, we recommend that you arrive early to secure your seat. \nWill childcare be provided? \nNo. While families are extremely important to us, there will not be childcare available during the conference, and we are unable to accommodate children. However, we do have a nursing mom’s room available. \nCan I bring my daughter with me? \nAbsolutely! Our recommended age for girls sharing the conference experience is 12 years and older. Please note that if you choose to bring a child under 12 years of age but over 2 years old, registration is required.\n \nWhat is the refund policy? \nRefunds will not be given. All sales are final. \n \nHow can I contact the organizer with any questions? \nCaroline / flourish@myfaithfamily.com or 330-305-0925 \n \n \n \n ", "title": "Flourish Conference 2019", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "The 20th Annual Pumpkinvine Bike Ride and Friday Dinner Ride are fundraiser events.\nREGISTRATION OPENS FEBRUARY 4 at 9 AM EST\nThe main bike ride is on Saturday, however, there are 2 additional Friday night options for up to 200 people.  \n\n\n1-Both Friday Night Amish dinner RIDE $30 + Saturday ride $30 (100 people max) = $60\n\n\n2-Both Friday Night Amish dinner DRIVE $30 + Saturday ride $30 (100 people max) = $60\n\n\nSaturday Ride $30* Early bird price\n\n\nLate rate $50 May 15-June 11...Very Late rate $65 after June 11\n\n\nDoors open for check-in at 7:00 AM (EDT) on the day of the ride.\n\n\n**No refunds after May 15 as our volunteers need to order supplies.\n\n\nGo to ride.pumpkinvine.org for more information.", "title": "2019 Pumpkinvine Bike Ride - June 15, Check-in at 7:00 AM EDT", "selectedPreferences": ["Active"], "selectedCategories": ["Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "\nRecognized as one of America’s premier heritage music festivals, the award-winning Beale Street Music Festival enters its 43rd year in 2019. The kick-off event to the annual month-long Memphis in May Festival, the Beale Street Music Festival is held in picturesque Tom Lee Park, a river bluff park overlooking the Mississippi River in downtown, Memphis, TN, at the foot of historic Beale Street. \nLong known for its diverse line-up of top music stars both old and new, the annual event features 60+ artists on four stages over its three-day run.\nThe 2019 Beale Street Music Festival will include performances from Dave Matthews Band, The Killers, Cardi B, Khalid, G-Eazy, OneRepublic, Charlie Wilson, Shinedown, Gary Clark Jr., India.Arie, Rainbow Kitten Surprise, Lord Huron and MANY many more.\nCome experience the legendary music capital where rock and roll and blues music were born, and learn why music lovers from all 50 states and over 20 foreign countries travel to Memphis each year to attend this legendary spring time music festival.\nThis event will take place rain or shine.\n\nIf you have questions about ticketing, prohibited items or general information, please visit our website. If you don't find the answer there, hit us up on our Facebook, Twitter and Instagram pages.", "title": "2019 Beale Street Music Festival - Presented by Bud Light, FedEx, Terminix & Coca-Cola", "selectedPreferences": ["Cultural", "Lit"], "selectedCategories": ["Art", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "The annual procurement conference provides a venue for small businesses in Louisiana to meet federal, state and local governnment entities, as well as prime companies.  It also brings awarenes of the resources that are available via various agencies-for profit and non-profit.  Workshops are offered in various locations within the union and attendees are encouraged to attend the panel discussions where they are able to recieve answers to the questions they have.\n", "title": "15th Annual \"Connecting Businesses with Contracts\" Procurement Conference", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "The Kathy Helbig Group would like to invite you, your friends, your neighbors, anyone and everyone to our 19th annual Easter Egg Hunt at Independence Park, Weldon Spring's City Park on Saturday, April 13th!  Don't miss out on a morning of family fun with A Zoo 4 You Petting Zoo, featuring a miniature cow, pig, donkey, llama, goats, chickens, ducks and bunnies. We will also have egg coloring stations, over 30 prizes for golden egg holders, photos with the Easter Bunny, snacks and more! \nEaster Egg Hunt - Ages 0-5 - 10 am\nEaster Egg Hunt - Ages 6-12 - 10:45 am\nJoin us for tons of FUN!  Meet the Easter Bunny, face painting, and much more!      \n***Bring a dozen boiled eggs to decorate!!!***\nParking and shuttle will be available at:\nBryan Middle School, 605 Independence Road, Weldon Spring, MO 63304\n***There will be no parking available at Weldon Spring City Park***  \n**By registering for this event, I hereby grant and authorize Experience Realty Partners and The Kathy Helbig Group the right to upload my child(s) and/or family photo(s) to Experience Realty Partners and The Kathy Helbig Group Facebook pages for the sole purpose of printing my child(s) and/or family pictures from Experience Realty Partners and The Kathy Helbig Facebook pages.\n I have read this release and I fully understand contents, and meaning of this release.", "title": "Easter Egg Hunt 2019", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family"], "primaryPreference": "Relaxing", "primaryCategory": "Family"}, {"description": "SATURDAYS AT ARIF LOUNGE  - 5PM -3AM  ( 2847 BUFORD HWY ATL GA ) tables 4704516419 RESERVE EARLY :FREE ENTRY  / HOOKAH / FOOD / PARTY / BDAYS / TOP DJS / INTERNATIONAL + INDUSTRY NIGHT / SOCIALIZE / YOUNG PROFESSIONALS. ", "title": " SATURDAYS CELEBRATE YOUR BIRTHDAYS ( CALL 4704516419 FOR FREE BDAY SECTIONS)  /  AT THE ALL NEW ARIF LOUNGE ", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "The Steel Wheels present the 7th annual Red Wing Roots Music Festival.\nThree days, four stages and 40 bands at the beautiful Natural Chimneys Park and Campground in Mt Solon, VA, in the heart of the Shenandoah Valley. \nThe towering limestone chimneys, reaching more than 120' in the air, provide a spectacular backdrop for you to lounge in the Music Meadow and hear some great music in the great outdoors.\nThe 2019 line up includes First Aid Kit, The Wood Brothers, Mandolin Orange, Peter Rowan's Carter Stanley's Eyes, The Tim O'Brien Band, The Gibson Brothers, Della Mae, Charley Crockett, The Lil Smokies, Fruit Bats, River Whyless, Lindsay Lou, Birds of Chicago, Big Daddy Love, Hush Kids, Feufollet, Lonely Heartstring Band, The East Pointers, Sam Reider, Larry Keel, Dead Horses, Lula Wiles, The Hollering Pines, Sean McConnell, Kaia Kater, Fireside Collective, Cedric Burnside, Courtney Hartman, Cedric Watson, Danny Knicely, Kristin Andreassen, Allison de Groot & Tatiana Hargreaves, Locust Honey, John R Miller & the Engine Lights, Justin Jones, Jordan Tice, Oliver Craven, The Judy Chops, Corner House, Saw Black, Dogwood Tales, The Wildmans, The Walking Roots Band, The Bright Siders, Ragged Mountain String Band, Dirt Road Sweetheart featuring Nora Jane Struthers, The Fernandez Sisters and more!\nRed Wing focuses on the whole experience: an incredible variety of food, craft vendors, kids activities, camping, swimming, organized bike rides, yoga, runs, hiking adventures, and much, much more!\nAdded bonus: Kids 12 and under are FREE and teenagers 13-17 can get a 3-Day pass for only $65!  More info? www.redwingroots.com\n\nIMPORTANT TICKET INFORMATION\n\nOnce you purchase, you will receive an order confirmation email from Eventbrite on behalf of Red Wing 2019. Your e-ticket(s) will be attached to your order confirmation email. Make sure to print them out and bring them to the event. Or go green and download the Eventbrite app on your smart phone! IMPORTANT: If you do not see your order confirmation in your inbox, make sure to check your junk/spam folder.\nIf you do not see your order confirmation in your inbox, click here to access the Eventbrite help center.\nIf you are having any other technical ticketing-related issues with your order, click here to contact Eventbrite. For non-technical ticketing questions and general festival info, click here.\nNeed to view or update the information on your order? Click here for instructions.\n\n \nAll Sales Final - No refunds - Band Lineup Subject to Change \n_", "title": "Red Wing Roots Music Festival 2019", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Nightlife", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "Gathering of journalism pros, students, educators from SPJ Region 9 - New Mexico, Colorado, Utah, Wyoming and West Texas. Open to the public", "title": "Society of Professional Journalists Region 9 Conference in Albuquerque, NM", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "\nSaturday, 20 APR 2019 at 10:00AM - 06:00PM MDT @ Civic Center Park, Denver, Colorado Ages: All Ages (children not advised) Doors Open: 10:00AM\nPlease RSVP! This is a FREE event. We will be sending important information leading up to the event!\nTHE MILE HIGH 420 FESTIVAL IS THE LARGEST FREE 420 EVENT IN THE WORLD!!!This festival is completely free to attend and is open to the public. Head over to MileHigh420Festival.com for more information on the event.", "title": "2019 Mile High 420 Festival AKA Fly Hi Festival", "selectedPreferences": ["Cultural", "Relaxing"], "selectedCategories": ["Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "The Dean of Law, Professor Penelope Mathew, invites you to join her and members of the Faculty to a celebratory graduation morning tea at The Pavilion, in the grounds of Old Government House.", "title": "Auckland Law School Graduation Morning Tea", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family", "Food&Drink"], "primaryPreference": "Relaxing", "primaryCategory": "Food&Drink"}, {"description": "Join us for an afternoon filled with the Arts! Live Music, Lots of Kid friendly activities including a bounce castle, Crafts, painting, interactive booths, shopping, a silent auction benefitting The Made for More Project, food and More! FREE ADMISSION! Visit the madeformoreproject.org for more information.", "title": "FAM FEST (Family Art & Music Festival)", "selectedPreferences": ["Active"], "selectedCategories": ["Art", "Shows", "Family"], "primaryPreference": "Active", "primaryCategory": "Family"}, {"description": "Vanguard 9:05 AM\n***New time: Parade 9:30 AM\nThe Battle of Flowers Parade is the oldest event and largest parade of Fiesta® San Antonio attracting crowds of more than 350,000. It is the only parade in the United States produced entirely by women, all of whom are volunteers. These ladies, dressed on Parade day in yellow and wearing yellow hats, direct operations with the valued assistance of the Texas Army National Guard. In keeping with the original purpose of the Parade, honoring the heroes of the Alamo, participants place a floral tribute on the lawn as they pass in front of the Alamo.\nThe 2019 Battle of Flowers Parade will travel through Texas to discover what liest at the core of the State boasting the biggest heart with the theme, “For the Love of Texas!”\nFAQs\n\nWhere can I contact the organizer with any questions?\n\nUMAST Fiesta Parade Chair:\nCarisa Gamez\n(210) 207-5737\ncarisa.gamez@sanantonio.gov\nOR\nUMAST Secretary:\nPedro Reyes\n(210) 233-2355\npedro.reyes@saws.org\n\nDo I have to bring my printed ticket voucher to the event?\n\nYes. You will need to bring your printed ticket voucher to the parade to validate your seat(s).\n\nIs there a ticket limit?\n\n\nTicket sales are limited: 1st row (We encourage the maximum of six tickets per customer for the 1st row), 2nd row (20 tickets), 3rd row (20 tickets)\n\nWhat is the refund policy?\n\nThere are no refunds or exchanges allowed.", "title": "2019 Battle of Flowers Parade Reserved Street Chair Seating License #092", "selectedPreferences": ["Cultural"], "selectedCategories": ["Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "Foam Wonderland - Sunken & Savage Tour 2019⚓️ The Ultimate Foam Party Experience \n7th annual hometown massive! Presented by Crowdsurf\nDENVER, CO\nSaturday, June 15th 2019\nNational Western Complex\n7PM to 2AM \n16+ with 21+ Bars Available\nTICKETS \nTICKETS ON SALE NOW!\nGeneral Admission & VIP Available\nVIP Includes Express Entry Line + Access to Exclusive Elevated VIP Decks!\nLINEUP\nSTEVE AOKI\nGHASTLY\nSPAG HEDDY\nDNMO\nINZO\nPAWS THE MUSIC\nINFO\nFoam Wonderland produces the biggest foam party production across the country, touring from city to city and bringing the world's hottest DJ's to take over the stage. Brace yourselves a wild deep sea adventure with this year's theme on the Sunken & Savage Tour 2019!CONNECTInstagram: http://Instagram.com/FoamWonderlandAsk Questions on Facebook: http://Facebook.com/FoamWonderland--- DISCLAIMER ---Lineup subject to change.Tickets are non-refundable.YES, YOU WILL GET WET!Although there are dry areas within our venues, expect to get wet.. This is a foam party! If you have any concerns about your safety, please do not participate in this event. Take extreme caution, there is a zero tolerance policy enforced. Foam Wonderland disclaims responsibility and liability for injuries, accidents, and/or occurrences that may result at at a Foam Wonderland event. Have fun and enjoy the experience!--- HELPFUL SUGGESTIONS ---Wear clothes you don't mind getting wet - Swimwear is a great option.Bring your cell-phone in a plastic bag.Bring sunglasses or goggles.", "title": "Foam Wonderland - Denver, CO 2019 - Sunken & Savage Tour", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Nightlife", "Shows", "Food&Drink", "Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Margarita Madness 5k™ is a unique night 5K fun run focused less on speed and more on Margarita fun with friends and family.Margarita participants come from all different ages, shapes, sizes, and speeds; every participant will get Mad Margaritas™ and have the time of their life. ", "title": "Grand Rapids Margarita Madness 5k Run", "selectedPreferences": ["Active"], "selectedCategories": ["Food&Drink", "Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "\nWe are pleased to announce a special edition of the hugely popular Sensi Night event series to celebrate the three-year anniversary of our flagship Denver/Boulder edition. This free marquee event is taking place Wednesday, April 17 from 7 p.m. to 11 p.m. at EXDO Event Center in Denver’s RiNo Art District, followed immediately by the premiere Sensi Night After Party featuring Tierro with Bridget Law (of Elephant Revival) at the nearby Walnut Room.\n\n\n\n\n\n\n\n\nAlong with the brand exhibitors, Sensi Night will feature some of Denver’s best live artists and performers, massage and acupuncture stations, sweet giveaways, free promo items, book signing with Pot in Pans author and Sensi contributing editor Robyn Griggs Lawrence, Steuben's Food Truck, and more surprises and happenings—including the chance to win one of two signed copies of Higher Etiquette with Lizzie Post, co- president of the venerable The Emily Post Institute.\n\n\n\n\n\n\n\n\nOur events are always a flat-out good time!\n\n\n\n\n\nWhat: Sensi Night Denver/Boulder\n\n\nWhen: April 17, 2019, 7 p.m. – 11 p.m.\n\n\nWhere: EXDO Event Center, 1399 35th St, Denver, CO 80205\n\n\n", "title": "Sensi Night Denver 4.17.19", "selectedPreferences": [""], "selectedCategories": ["Nightlife"], "primaryPreference": "", "primaryCategory": "Nightlife"}, {"description": "Free Admission, Ladies! Enjoy some \"me time\" with the girls while browsing around the Historic Governor's Row House! We'll have some cute little pop up boutiques and other amazing vendors showcasing the best Topeka has to offer! We'll also have our signature free pampering services onsite! Along with a CASH bar. Come let us Spoil You Silly! :)A list of secured vendors and services will be updated shortly, so check back soon and often!Small Business Owners: want to showcase your goods and services at this event? Join our FB vendor group linked below! Then check the pinned post for all info about this event...https://www.facebook.com/groups/KCWomensEventsVendors/", "title": "Spoil Me Silly \"Ladies Night Out\" ", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Indy Pride Festival 2019 Presented By Sales Force at Military Park Indianapolis", "title": "Indy Pride Festival 2019 Presented By Salesforce", "selectedPreferences": ["Cultural"], "selectedCategories": ["Art"], "primaryPreference": "Cultural", "primaryCategory": "Art"}, {"description": "WE’RE BRINGING CRAFT BEER TO WELLINGTON...AGAIN!\nYour ticket includes a commemorative sample cup and an afternoon of unlimited craft beer samples from many northern Colorado breweries.\nAll proceeds from this event will benefit the Wellington Colorado Main Streets Program.\nLearn more at: https://wellingtonbrewfest.com/.", "title": "Wellington Brewfest 2019", "selectedPreferences": ["Relaxing", "Lit"], "selectedCategories": ["Food&Drink"], "primaryPreference": "Lit", "primaryCategory": "Food&Drink"}, {"description": "Nu Skin North America Leadership Conference provides the opportunity to learn from corporate and distributor leaders alike. This three-day event will feature workshops, general sessions, recognition, and many chances to mingle and network--all while enjoying the sites and sounds of downtown Provo and the Nu Skin headquarters! \nTickets are limited, so act now! ", "title": "Nu Skin North America Leadership Conference", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "Join us for The Experience: Faith Chapel Singles Conference on June 28-29, 2019 at The Word Dome (Birmingham, AL). It's our third annual singles conference and this year we're sharing more knowledge, insight and everyday tips on HOW TO \"do life\" as a single (unmarried) person - and enjoy the journey along the way. \nWith so much emphasis on finding the right person, we forget the most important part: becoming the right person, the type of person that you would want to date. When you are walking the path that God has created for you, that’s where you will find everything you want and need. Even a spouse, IF that’s what you want.\nThis year The Experience will tackle topics such as:\n\n\nThe Ultimate You\n\n\nWholeness\n\n\nBreaking Soul Ties\n\n\nDating\n\n\n...and more!\n\n\nSpeakers:\n\n\nDr. Michael D. Moore\n\n\nBrittany Morton\n\n\nDr. Thomas Beavers\n\n\nKeisa Sharpe\n\n\n\n\n", "title": "The Experience: Faith Chapel Singles Conference", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "Muddy Princess is an outdoor 5km (3.1 mile) obstacle mud run for women - and women ONLY! \nOur event is for Princesses of all sizes, ages and fitness levels. We don’t focus on fastest times or competitions, we focus on fun so be prepared to run, walk, crawl, climb, slide, balance and laugh your way along our course for an amazing “girls dirty day out!”\nWe have no limits on the size of your team, it can be as many Princesses as you can convince to join you for a day in the mud! Please don’t feel excluded if you are entering as an individual, all of our Princesses are part of our Muddy Princess family and there will always be help and support to ensure everybody makes it over the obstacles and crosses the finish line at their own pace. \nThe event venue opens at 7:00am for registration with the first wave starting at 8:00am and continuing every 20 minutes (8:00, 8:20, 8:40 etc) up until the last wave of the day. Please choose your preferred start time when choosing your ticket. PLEASE NOTE – for safety reasons, each wave has limited numbers and once it is full there will be no additions allowed and no exceptions.\nWhat you get:\n\nPricing:\n\nSpectators are welcome at no additional fee so bring your husband, kids and cheering squad. We have a Village where they can cheer you at the Start and celebrate you at the Finish Line. They can explore the food and drink stalls, or sit and relax while they wait for you to have your fun in the mud. Please Note - We don't have a designated spectator zone along the course. Due to the different set ups at each venue, we cannot specifically keep spectators off the course but, we do ask that you respect the privacy of all our Princesses and please stay in the Village area while waiting for your Princess to return.\nWe have a Bag Drop ($5 on the day) where you can leave your stuff until you have completed the course. Parking will be $10 and VIP Parking is $20 (limited availability)\nThe minimum age for entry is 9 years young – but please, Moms, little Princesses (up to 13 years old) must be accompanied by a registered, participating adult. Event waivers must be signed by a parent or legal guardian of all Princesses under the age of 18. No waiver, no run, no exceptions.\nThere will be a selection of food and drinks vendors available for your convenience so no additional food and drinks are allowed at the venue.\n*All registration fees are per person, we do not have group rates with Early Bird prices.\nJoin us on Facebook: https://www.facebook.com/MuddyPrincessUSA\nFAQ's: http://www.muddyprincess.com/faq-page", "title": "Muddy Princess Charlotte, NC", "selectedPreferences": ["Active"], "selectedCategories": ["Family", "Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "25th Anniversary Essence Music Festival - New Orleans - July 4th - 8th, 2019\r\n \r\nAs of April 1st, 2019, we have limited rooms available. In order to reserve your package, 50% deposit MUST be paid up front with the remaining balance due no later than May 3rd. No exceptions.  Room only option is available as well. Room only option must be paid upfront  in full at time of booking and rooms are non-refundable and cannot be cancelled. \r\nHost Hotel: Doubletree by Hilton - 300 Canal St  \r\n2019 Standard Hotel/Event Package (Scroll down for pricing and payment  plan)\r\n\r\n 4 nights at Doubletree by Hilton (300 Canal St) - Thursday, Friday, Saturday and Sunday night ** (Check-in Thursday, check out on Monday)\r\n3-Day Essence Music Festival Concert Weekend Pass - Friday night, Saturday night and Sunday night shows - Seating will be determined by what is available once your package has been paid 100%.\r\n  Upgrade to Floor Seating is available****\r\nSpecial Event Party (Friday or Saturday) \r\n**4 night minimum required by the hotel. You must accept package as is - checking in Thursday and checking out Monday. You can add days for a fee but cannot change to a 3 day stay. \r\n\r\n \r\n5 Day/4 Night Package Pricing is as follows:\r\nSingle Occupancy $2,550.00 - King Bed (no couch)\r\nDouble Occupancy -  $3,550.00 / $1,775.00 each - 1 King or 2 Queen Beds (no couch)\r\nTriple Occupancy - $4,375.00 / $1,458.33 each / 2 Queen Beds (no couch) \r\nQuad Occupancy - $5,225.00 / $1,306.25 each / 2 Queen Beds (no couch)\r\n Current Payment schedule for March 2019. :   50% deposit of package amount due ASAP upon booking. Final remaining balance due no later than May 3rd. No exceptions! Extnsions cannot be granted past this date. .  \r\n**All sales are final. No refunds.** \r\n *** Eventbrite does charge a processing fee each time you make a payment. Processing fees are collected by Eventbrite and therefore do not go towards your package price. All payments MUST be made via Eventbrite. Payments will show up on your bank statements as Paypal since they are the processor for Eventbrite ***\r\n **Meals, Airfare, Airport Shuttles, Hotel Parking and Ground Transportation are NOT included**\r\nHotel Self-Parking at the Doubletree as of summer 2018 starts at $40.00 per night. Valet Parking is not available. \r\nAll event tickets will be distributed in person at the Doubletree Hilton by Enjoy Yourself Vacations. Tickets will not be delivered via email or mail at anytime.  Ticket Pick-up will be from 12:00-3:00 PM on Thursday, July 4th.  Please arrange your travel so that at least one person from each room arrives no later than 3PM to the hotel to pick up tickets.  Hotel policy does not allow tickets to be left at the front desk or concierge. \r\n*** We DO NOT offer Event Only packages***\r\nEssence passes will get you access to: Mainstage Performances and Superlouge Performances at the SuperDome as well as the FREE daytime seminars/tradeshow at the Convention Center. Some special seminars and speakers at the Covention Center do require a separate registration fee which is NOT included in any of the packages. Beaty evenst at the convention center which require a fee are not included. \r\n \r\nPlease be advised that Floor seats are not included, guaranteed or promised with our standard package no matter when you booked your package.  You can upgrade to floor seats if you wish for an additional fee. \r\nRegistration instructions:  When making an Initial Deposit, please choose number of people registering for using the drop down box. For 2 people, choose '2 'then fill out each person's information on the registration form.  Each person's deposit must be paid during the Initial Deposit. Failing to do so, will result in cancellation of your reservation. For example, please do not choose Double Occupancy, then only pay deposit for 1 person.\r\nHow to make monthly payments: Log onto www.Essence2019.eventbrite.com - Click on 'Tickets' and you will see a $100 monthly payment option for the standard package.  We would prefer if each person makes individual payments since I track payments by each name. Payments are due by the last day of each month. Mandatory minimum monthly payments are minimum $100 per person. All packages must be 100% paid no later than Friday, March 29th, 2019. No exceptions.\r\n **Prior to making payments, please understand that due to strict contractual obligations, any and all payments are NON-REFUNDABLE for any reason including but not limited to: personal reasons, death, illness, weather, deployment, Acts of God. We DO NOT offer travel insurance as a service. If you wish to have travel insurance, it is the sole responsibility of you the traveler(s).  Reservations are transferrable to another person in your absence until March 1st, 2019.\r\n\r\nTo book rental cars, flights or other travel needs, please visit our travel site: http://www.EnjoyYourselfVacations.com\r\n \r\nPlease follow my Enjoy Yourself Vacations travel page on Facebook for updates.\r\n\r\nEnjoy Yourself Events, LLC DBA Enjoy Yourself Vacations is not affiliated with the Essence Music Festival or Essence Magazine. We are an independent Event Planning & Travel Agency. Please feel free to contact us directly with any questions. We do not have any information regarding vendor or performing artist opportunities. Please follow my travel page on Facebook for updates.\r\n ", "title": "25th Anniversary Essence Music Fest 2019 Hotel/Concert Package", "selectedPreferences": ["Lit"], "selectedCategories": ["Family", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "From the organizers of Ponyville Ciderfest and MLP-MSP F, Whinny City Pony Con is back for our fourth year! Chicagoland’s biggest My Little Pony: Friendship is Magic fan convention returns to the wonderful Hyatt Regency in Schaumburg, IL on April 5th – 7th, 2019!\r\nOur theme for 2019 is “Midwest Adventure”, where we will aim to capture the excitement of all kinds of experiences! Perhaps you’re travelling from far away places? Or maybe you’re discovering new people and making new friendships? Possibly even competing in exciting new challenges? You don’t need to visit ancient ruins for these things, because adventures can be found anywhere!\r\nWe look forward to once again bringing the excitement of MLP:FiM and its fandom to Chicagoland for a fun filled weekend of ponies, friends, fun and entertainment!", "title": "Whinny City Pony Con 2019", "selectedPreferences": ["Relaxing", "Active", "Active"], "selectedCategories": ["Food&Drink"], "primaryPreference": "Active", "primaryCategory": "Food&Drink"}, {"description": "\n\nOn behalf Of Empire Dynasty Travel, we thank you for your purchase. All Payments Are Nonrefundable, Should you have questions about your purchase please call us. Hours M-F 10a-4p Central Time. (excluding weekends & Holidays) 816-476-7805. Leave a message if no answer, we return calls the same day or in the case of a weekend the following day. Our Official Site: https://www.empiredynastytravel.com.\n\nWho Are We:\nEmpire Dynasty Travel host(s) several events during Essence Weekend. Darron Wheeler Ent. promotes all Empire Dynasty Travel sponsored events. Our primary goal is to bring guest(s) to New Orleans to patronize the City of New Orleans and the Essence Festival. We have been around for more than 15 years. Empire Dynasty Travel works with several travel agencies & event promoters. When you see \"our\" name including “our” affiliates, you can rest assure knowing that you will be satisfied as \" \"We Treat You Like Royalty\".\n\nAbout Essence Music Festival\nAbout Essence Music Festival: \nThe Essence Music Festival, known as \"the party with a purpose,\" is an annual music festival which started in 1994 as a one-time event to celebrate the 25th anniversary of Essence, a magazine aimed primarily towards African-American women. It is the most significant event celebrating African-American culture and music in the United States. Locally referred to as the Essence Fest, held in New Orleans, Louisiana every year since 1994 except for 2006, when held in Houston, Texas due to Hurricane Katrina. It features artists simultaneously performing on the main stage as well as four standing-room-only super lounge stages. [Wikipedia]\nJoin Empire Dynasty Travel as we head to New Orleans to partake in the best the city has to offer, face to face encounters with your favorite celebrities, concerts and much more.\nEmpire Dynasty Travel offers the best package to the Essence Music Festival and “We Treat You Like Royalty.”\n\nHotel\n4-Star Property WITHIN the French Quarter/Downtown Area.  Withing walking distance to ALL events.\n\n\n2019 PACKAGES\nTravel Package A Includes: (Economy Package) HOTEL ONLY— “Balling on a Budget”\n\nThree Hotel Nights \nDrawstring Backpack\nCup\nEmpire Dynasty Essence Shirt\n3 Days/2 Nights Vacation Getaway for Two Certificate (outside vendor)\n1 Yr. Essence Magazine Subscription (must complete postcard & return to us)\n\n\nTravel Package B Includes: “Girls Just Wanna Have Fun Package”\n\nThree Hotel Nights \nDrawstring Backpack\nCup\nEmpire Dynasty Essence Shirt\n“Spa Party” (Includes a 30-minute Swedish massage, 30 minutes therapeutic facial, and a foot treatment) (Friday, Saturday, & Sunday---you will be assigned a day)\n50 Shades of Black (Masquerade Edition) (Friday)\nEssence Music Concert Ticket—Lodge or Plaza Tickets Only (Saturday)\n\n\nComedy, Poetry, & Black Film Review Show (Sunday) \n\n\n3 Days/2 Nights Vacation Getaway for Two Certificate (outside vendor)\n1 Yr. Essence Magazine Subscription (must complete postcard & return to us)\n\n \nTravel Package C Includes: “All White Party Package” ---Early Bird Package—Thursday Arrival Only\n\nThree Hotel Nights \nDrawstring Backpack\nCup\nEmpire Dynasty Essence Shirt\nThe Official EMF Kickoff “All White Party” w/special guest (Thursday)\nThe Converse Just Wear White Party (Friday)---Early Arrival Suggested……Ticket Does Not Guarantee Immediate Entry\nAll White Masquerade Boat Party W/Special Guest (Friday)\nEssence Music Concert Ticket—Lodge or Plaza Tickets Only (Sunday)\n\n\nComedy, Poetry, & Black Film Review Show (Sunday) \n\n\n3 Days/2 Nights Vacation Getaway for Two Certificate (outside vendor)\n1 Yr. Essence Magazine Subscription (must return postcard & return to us)\n\n\nTravel Package D Includes: ““Hangover Package”\n\nThree Hotel Nights \nDrawstring Backpack\nCup\nEmpire Dynasty Essence Shirt\nAll White Boat Party (Friday)\n50 Shades of Black-Masquerade Theme (Friday)\nEssence Music Concert Ticket—Lodge or Plaza Tickets Only (Friday, Saturday, Sunday--your choice)\nHangover Brunch (Saturday)\n3 Days/2 Nights Vacation Getaway for Two Certificate (outside vendor)\n1 Yr. Essence Magazine Subscription (must complete postcard & return to us)\n\n \nTravel Package E Includes: “Party with A Purpose Package”\n\nThree Hotel Nights\nDrawstring Backpack\nEmpire Dynasty Travel T-Shirt \nCup\n3-Day Weekend Essence Concert Ticket Pass—Lodge or Plaza Tickets Only (Friday, Saturday, & Sunday)\n\n\nComedy, Poetry, & Black Film Review Show (Sunday) \n\n\nDrawstring Backpack\n1 Yr. Essence Magazine Subscription (must return postcard & return to us)\n\n\n2019 PRICING\nHotel-Event Package---(Entire Weekend Price!!!THIS IS ALL YOU PAY!!!)—Please Select 1 Package Only\n\n$1425 - Single Occupancy $850 per person– Double Occupancy $750 per person – Triple Occupancy $650 per person - Quad Occupancy\n\n\nHotel Only Package: (NO EVENTS) (Entire Weekend Price!!!THIS IS ALL YOU PAY!!!)\n\n$1350 - Single Occupancy\n$675 per person– Double Occupancy\n$500 per person – Triple Occupancy\n$375 per person - Quad Occupancy \n\n\nAdditional Fees:\nOne-time invoicing processing fee applied to your account. 3% +.30. of total package.  \n\n\"Property of Empire Dynasty Travel & Darron Wheeler Ent.  Advertisement not authorized to be used by no agency, individual, group, not anyone.  If you see this advertisement on another site, please contact us immediately.  Thank you!\"", "title": "2019 Essence Music Festival", "selectedPreferences": ["Lit", "Active", "Cultural", "Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "WHAT IS THE Margarita Madness 5K Run?Margarita Madness 5k™ is a unique night 5K fun run focused less on speed and more on Margarita fun with friends and family. Margarita participants come from all different ages, shapes, sizes, and speeds; every participant will get Mad Margaritas™ and have the time of their life. Whether you are an avid runner or a walk around the park walker, the 3 miles of the Margarita Madness 5k™ course will have you beaming and waiting for the next one!", "title": "Memphis Margarita Madness 5k Run", "selectedPreferences": ["Lit", "Active"], "selectedCategories": ["Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "By turns wicked, funny, warm, romantic and touching, The Music Man is family entertainment at its best. Meredith Willson’s six-time, Tony Award-winning musical comedy has been entertaining audiences since 1957 and is a family-friendly story to be shared with every generation.The Music Man follows fast-talking traveling salesman, Harold Hill, as he cons the people of River City, Iowa, into buying instruments and uniforms for a boys’ band that he vows to organize – this, despite the fact that he doesn’t know a trombone from a treble clef. His plans to skip town with the cash are foiled when he falls for Marian, the librarian, who transforms him into a respectable citizen by curtain’s fall.This award-winning, critically acclaimed Broadway classic is an all-American institution, thanks to is quirky characters, charmingly predictable dramatic situations and one-of-a-kind, nostalgic score of rousing marches, barbershop quartets and sentimental ballads, which have become popular standards.\n\nLength and Intermission\n2 and 1/2 hours, with intermission\nAll tickets are general admission and are non-refundable.\nDoors open 1:30 PM for the evening shows.\nThe use of video recording devices is strictly prohibited.\nThere are wheelchair accessible areas during each performance. Please contact us for these seats.", "title": "Murphysboro High School Presents The Music Man 4/7/2019", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family", "Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "The Memphis Local Music Festival is a Celebration of Memphis’s Greatest Natural Resource - Our Talent! Come out and enjoy a day of Fun, Local Memphis Food, and Great Local Music!\nVending, Performance, Sponsorship, and Volunteer SIGN-UP opportunities are available in the \"Register\" tab.\nThe 3rd Annual Memphis Local Music Festival 2019 will host live music performances from local and regional artist. ALL GENRES  & PERFORMERS WELCOME!! Sign up and show your talent!\nHeadlining Artist to be announced!", "title": "Memphis Local Music Festival", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "With the largest sampling of any festival of its kind, let your inner nerd dive into the love story between whiskey and beer with a smoky marriage of flavor profiles. We’re celebrating the evolution of the artistry in two of the most glorious craft industries. Discover cask-aged libations that even the most seasoned aficionado will geek out about. With over 60 tasting possibilities, try them all to your heart’s content and vote for your favorite! Experience more than just the obvious-- sample beer aged in whiskey barrels, whiskey aged in beer barrels, and small batch blends in between. Elevate your palate further with barrel aged wine, coffee, gin and many others in this uniquely charred space. \n\n\n\nDISTILLERIES3 Hundred Days DistillingArt of the Spirits WhiskeyAxe and the Oak DistilleryBear Creek DistilleryBulleitColorado Gold DistilleryDeerhammer Distilling CompanyDistillery 291Feisty SpiritsHale & BradfordHogback DistilleryIdlewild SpiritsIronton Distillery & CrafthouseLocke + Co DistillingMile High SpiritsMystic Mountain DistilleryMythology DistilleryOld Elk DistillerySpruce CreekTower 56 DistillingVapor DistilleryWestern Spirits\nBREWERIES14er Brewing CompanyAlpine Dog Brewing CompanyBanded OakBlue Moon RiNoClear Fork CiderCrooked Stave Artisan Beer ProjectEpic Brewing Co.The Intrepid Sojourner Beer ProjectJoseph James Brewing Co.Mountain Cowboy Brewing CompanyOdell BrewingPug Ryan's Brewing CompanySanitas BrewingSpangalang BreweryStrange Craft Beer CompanyWit's End Brewing Company\n\n\nGA: 3-6 pm\n\nunlimited sampling of barrel aged beer, whiskey, and other spirits\n\nEarly Entry: 2:30-6 pm\n\n30 minutes early entry to the event\nunlimited sampling of barrel aged beer, whiskey, and other spirits\n\nVIP: 2-6 pm\n\n1 hour early entry to the event\nunlimited sampling of barrel aged beer, whiskey, and other spirits\nVIP-only signature cocktail\nEngraved rocks glass\n\n21+ event, no refunds, the event will happen rain or shine.\nPlease note that the venue is indoors and outdoors and the outdoor portion will have heaters and heated tents. We recommend guests dress warmly as it's April in Colorado and you never know what you're going to get!\nFor more info visit barrelagedbeerandwhiskey.com or contact info@11creative.co!\nThe Barrel Aged Beer & Whiskey Festival proudly supports Minds Matter of Denver. Minds Matter of Denver is committed to making college education a reality for accomplished high school students from low-income environments since we first opening 2004. Students are paired with two adult mentors and spend time during weekly after-school sessions working on summer and college applications, standardized test preparation, community service efforts, writing and speaking skills, and other life skills that benefit the student academically and personally. How would we know? The staff of 11 Creative are also mentors at Minds Matter! If you're interested in learning more, shoot us an email and we will tell you all about it!", "title": "Barrel Aged Beer & Whiskey Festival", "selectedPreferences": ["Active"], "selectedCategories": ["Art", "Shows", "Food&Drink"], "primaryPreference": "Active", "primaryCategory": "Food&Drink"}, {"description": "WELCOME TO THE HOME OF THE 2019 HOUSTON ZYDECO FEST\n\nGET READY TO ATTEND THE BEST ZYDECO FESTIVAL IN THE STATE OF TEXAS. A DAY OF DANCING, EATING AND PARTYING HAS BEEN PLANNED FOR YOU AND YOURS. COME SPEND YOUR DAY WITH THE BEST ZYDECO BANDS IN THE NATION. OUR STAGE WILL BE ROCKING ALL DAY AND YOU WILL BE ON YOUR FEET NON-STOP. MAKE SURE YOU PURCHASE YOUR TICKETS AND ADVANCE AND PREPARE TO HAVE THE TIME OF YOUR LIFE!!!\n\nFULL LINEUP COMING SOON!!\n\nVENDOR OPPORTUNITIES\nPLEASE EMAIL US AT HOUSTONZYDECOFEST@GMAIL.COM IF YOU ARE INTERESTED IN BEING A VENDOR. VENDOR SPOTS ARE FILLING UP FAST, SO ACT NOW!!\n", "title": "2019 Houston Zydeco Fest", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Embark on a journey through sound, art, and light as an ILLevator. Now in its third year, ILLfest brings some of the world's greatest artists to the Travis County Expo Center in Austin, TX. \nArt installations and other spectacular sights and sounds await you at every turn. Welcome to ILLfest.\n\nPresented by ILLevated Sounds\nAUSTIN, TX |  SATURDAY MAY 25, 2019\nJoin our Ambassador program to earn rewards\n\nALL SALES ARE FINAL. NO REFUNDS WILL BE GIVEN AT ANY TIME FOR ANY REASON.", "title": "ILLfest Music & Art Festival", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "YOB with Voivod and Amenra on Saturday 4/13.", "title": "YOB with Voivod and Amenra @ Barracuda Austin", "selectedPreferences": ["Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": " \r\nSPRING GAMES 2019\r\n(Track & Field) \r\nThe event will be held at Lovejoy High School. There will be over 1,500 Special Olympics Athletes Competing in track and field events, tennis, and soccer.  Volunteers are needed for timing, scorekeeping, staging and escorting athletes, other  general event support and assistance, and most Fans in the Stands.  Volunteer roles are not pre-assigned but filled on the as needed basis once you arrive. \r\n \r\n \r\n\r\nVolunteer Shift Times (please plan on checking in 30 minutes before your shift time begins):\r\nApril 12, Friday: 1:00-4:00pm (Support Services)          \r\nApril 12, Friday: 5:00pm-9:00pm\r\nApril 13, Saturday, AM: 9:00am-1:00pm \r\nApril 13, Saturday, PM: 12:30pm-5:30pm \r\n \r\nVOLUNTEER REQUIREMENTS: \r\n\r\n\r\nMust be 15 years old or older to volunteer alone\r\n\r\n\r\nVolunteers between 8-14 years old must be accompanied by an adult (1 to 1 ratio) and will serve as Fans in the Stands to cheer our athletes on!!\r\n\r\n\r\nPHOTO ID is REQUIRED AT REGISTRATION!\r\n \r\n\r\n\r\nVOLUNTEER ROLES & EXPECTATIONS: \r\n\r\n\r\nNeeds will vary according to sport, we expect volunteers to be flexible to meet our competition needs\r\n\r\n\r\nRoles will include timing, score keeping, escorting athletes, fan base, and general event support.\r\n \r\n\r\n\r\nVOLUNTEER SERVICE HOURS: \r\n\r\n\r\n\r\nFor those needing confirmation of service hours, at the completion of your volunteer shift you may report back to volunteer registration for signatures or confirmation forms. \r\n\r\n\r\n\r\n\r\nGROUP VOLUNTEERING: \r\n\r\nIf you are affiliated with a group of 5 or more, a business/corporation, and/or organization, please register by emailing our Group Volunteer Coordinator, Kevin Wilbanks at volsotx10@gmail.com Please include the word  \"Group Spring Games\" in  the subject  line  of  your e-mail.\r\n\r\nWHAT TO WEAR / BRING: \r\n\r\nWear comfortable clothes \r\nClosed toed shoes (no flip-flops)\r\nHats & Sunglasses (since you will be outside) \r\nSunscreen \r\nWater bottle to stay hydrated \r\nMoney for souvenirs or concessions stands (food will be on your own)\r\nPhoto ID\r\n\r\n \r\nPARKING: \r\n\r\nGeneral parking is available at the venue. We ask the Volunteers park fartherst away from the Stadium as to allow for families and athletes to park closer. \r\n\r\n  \r\nWHERE TO GO WHEN YOU ARRIVE: \r\n\r\n Report to Volunteer Registration \r\nAn Email 2 days prior will be sent out to those who registered with specific directions on where registration is located in the Stadium. \r\n\r\n  \r\n We hope you enjoy your Spring Games Experience. Thank you for dedicating the time in your life to  help ensure our athletes have the time of their lives!\r\n", "title": "SOTX Area 10 Spring Games 2019 - Lovejoy", "selectedPreferences": ["Relaxing", "Active"], "selectedCategories": ["Family", "Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "\r\n\r\nTICKETS GO ON SALE FRIDAY DECEMBER 21st!\r\nALL TICKETS PURCHASES MUST BE ONLINE (NO TICKETS SOLD AT THE EVENT)\r\nPresented in part by:  Gordon Foodservice and The Ridge Hotel\r\nCome and enjoy burger samples from over a dozen of the areas best restaurants and chefs!  Ticket includes unlimited burger samples while they last.  Soft drinks, and other food items,  and live entertainment!", "title": "Geneva Lakes Burger Throwdown 8th Annual", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family", "Food&Drink"], "primaryPreference": "Relaxing", "primaryCategory": "Food&Drink"}, {"description": "John Butler Trio+ |  St. Paul & The Broken Bones  - Deer Valley Concert Series", "title": "John Butler Trio+ |  St. Paul & The Broken Bones", "selectedPreferences": ["Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "The HJSA Conference features wonderful, eclectic, and inspiring national and regional speakers.  The full conference schedule can be found at www.HJSAonline.com.  Please join us for this amazing juvenile justice conference!!! ", "title": "2019 HJSA Conference Registration", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": null, "title": "American Football @ Mohawk", "selectedPreferences": ["Active"], "selectedCategories": ["Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "This show is all-ages", "title": "Iration – Live From Paradise! Summer Tour", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family", "Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "\nJoin bestselling authors of contemporary and paranormal YA fiction and more at the Holiday Inn Tanglewood in Roanoke, Virginia on April 6, 2019 from 10am-4pm. This is a FREE family-friendly event for readers!\n\n\nEnjoy an afternoon of books, giveaways, and more as you get the latest releases from your favorite authors and discover new voices! PLUS, don't miss the fun after party from 7-10pm at the same location to get even more quality time with your favorite writers! Learn more and see our full list of authors at roanokeauthorinvasion.com.\n", "title": "Roanoke Author Invasion 2019", "selectedPreferences": ["Relaxing", "Cultural"], "selectedCategories": ["Family", "Free", "Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "\n\n\nBLCK Market Houston has partnered with the Buffalo Soldiers Museum to bring you a one of a kind experience - April 5th, 2019 FROM 6PM TO 10PM.\n\n\n\n\n\n\n\nA spin off from BLCK Box Studio's CREATE OFF - a living, breathing event that is ever changing, ever entertaining. You are invited to BLCK Market Houston - taking emerging, innovative, ground breaking artist and merging them with progressive \"out of the box\" companies to create a platform for discovery, pleasure and entertainment.\n\nSee you there!\n\nBLCK MARKET HOUSTON\nIG: @BLCKMARKETHOUSTON\n\nThe BLCK Market and BSM are not responsible for any lost or damaged items or any bodily harm to persons before, during or after the event.\n\nBe the peace.\n\n\n", "title": "BLCK Market - Houston's #1 Night Market", "selectedPreferences": ["Cultural"], "selectedCategories": ["Shows", "Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "We are happy to announce the 2nd Annual Southeast Texas Bigfoot Conference will be held on April 12th & 13th 2019, and once again it will be at the Walker County Fairgrounds in Huntsville, Texas\nWe are planning some new additions to the event and you will not want to miss this one!\nThere will be a kids activity center with Bigfoot movies playing on a big screen tv, and there will be lots of stuff for the young researchers to do, and have things to take home as well.\nWe have a great speaker line-up that will share their knowledge about all things cryptid!\n\nNotice:\nThe conference organizers and presenters accepts no responsibility for loss or damage to personal property. Purchaser shall indemnify the Southeast Texas Bigfoot, The Walker County Fair Association, The City of Huntsville, The County of Walker, and any participating hosts, speakers, or any directly invited participant appearing at the event from and against all liability in respect of any costs, claims, damages, demands, penalties, actions, proceedings, suits, losses or expenses in respect of any and all claims, losses, costs, damages of any nature whatsoever, including but not limited to claims arising out of the injury to or the death of any person, or damage to any property arising from my participation in the activity.", "title": "2nd Annual Southeast Texas Bigfoot Conference", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "Andrew Peterson in concert at First Byron Center Christian Reformed Church, near Grand Rapids, Michigan, April 13 at 7pm.  All proceeds from ticket sales will be donated to a Reformed church plant in Malawi. ", "title": "Andrew Peterson Resurrection Letters Tour", "selectedPreferences": ["Cultural", "Relaxing"], "selectedCategories": ["Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": null, "title": "A Night of a Million Dreams PROM 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Shows", "Nightlife"], "primaryPreference": "Active", "primaryCategory": "Nightlife"}, {"description": "Sing! ― A conference for pastors, musicians, and leaders to reform and encourage congregational singing August 19-21, Nashville TN.\r\nOur theme for Sing! 2019 is The Life of Christ - building on the foundation of the Gospel story in all we sing and seeing how it shapes the church’s year.\r\nThis conference exists to help pastors, musicians, and leaders build a Biblical understanding and creative vision for the congregational singing in their churches. Bringing together speakers and artists from many traditions and walks of life, our desire is to encourage churches towards a deeper, more dynamic view of theology, artistry and mission in congregational singing. \r\nSpeakers Include – Keith Getty, Kristyn Getty, John Piper, Joni Eareckson Tada, John MacArthur, Anne Graham, Lotz, D.A. Carson, Jackie Hill Perry, Fernando Ortega, Conrad Mbewe, Mark Dever, Os Guinness, Trip Lee, and many, many more!\r\nOnce you've completed your registration, consider expanding your conference experience by joining the 2019 Sing! Choir.  Click here for more info.  \r\nHotel information is available.  Click here to book now.", "title": "2019 Sing! Getty Music Worship Conference", "selectedPreferences": ["Relaxing", "Lit", "Active"], "selectedCategories": ["Shows", "Art"], "primaryPreference": "Active", "primaryCategory": "Art"}, {"description": "SEM Link's Math and Science Career Academy is hosting its 12th Annual STEM Career Fair is in partnership with the Morehouse School of Medicine Health Careers Opportunity Program. The event will provide K-12 students and their families with an opportunity to explore careers and meet and interact with professionals in these fields. At this event, attendees learn about STEM careers by moving freely among the tables of the exhibitors, to learn about STEM careers by engaging in hands on STEM activities and demonstrations. This event is free and open to the public but pre-registration is strongly suggested.", "title": "12th Annual STEM Career Fair", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "See America's Got Talent Finalist Samuel J Comroe Live at The Hillman Center for Performing Arts Monday April 8th.\n\nShow is Rated PG18. Not Recommended for anyone under the age of 18, but will be allowed entry with their parent or legal guardian.", "title": "Samuel J Comroe Live in Pittsburgh!!!", "selectedPreferences": ["Lit"], "selectedCategories": ["Art", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "Wallen, Whiskey & Woodcliff\nMorgan Wallen featuring special guest Hardy perform July 5, 2019 at Woodcliff Marina & Backprch Lounge starting at 8pm.\nGeneral Admission.  Doors open at 6pm\n", "title": "Wallen, Whiskey & Woodcliff", "selectedPreferences": ["Relaxing", "Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "\nWE HAVE A NEW EVENT DATE:  Thursday, April 18, 2019 at 6pm\n-----------------------------------------------------------------------------------\nKira Cheree’ and EBB (Entrepreneur Business Basics) will host Conscious Conversations: Minority Entrepreneurship, Education and Economics in Wyandotte County.\nThe event will be held at the Kansas City Kansas Community College – Performing Arts Auditorium on Thursday, April 18th, 2019. The doors will open at 6:00pm.\n The discussion will feature a panel of notable guests: \n\n\nDell Gines, Sr. Community Development for Federal Reserve Bank of Kansas City\n\n\nDr. Charles Foust, Superintendent, USD 500\n\n\nMark Dupree, Sr., District Attorney for Wyandotte County\n\n\nAdditionally, we will be honoring Wyandotte County native, Dr. Latoria Chinn of International Speedway Corporation with the Legacy of Excellence Award for her many contributions and advocacy in Wyandotte County. \n\n", "title": "Conscious Conversation: Entrepreneurship | Economics | Education  ", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "A lovely evening honouring all moms", "title": "Mommas on Broadway", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family", "Art", "Family"], "primaryPreference": "Relaxing", "primaryCategory": "Family"}, {"description": "\nGet your food and wine tasting tickets NOW for the most delicious event in Frisco,Texas!!\n\nDUE TO RAIN: THE EVENT WILL BE LOCATED AT HALL PARK IN A COVERED AREA! :)\n\n\n\n\n\nFrisco Uncorked Presented by O'Neil Wysocki Family Law is a food + wine festival experience that features over 100 wines, food from the best Frisco restaurants and food trucks, talented artists, beer & cocktails, a play area for kids, 50+ boutiques, local businesses and shops, Culinary and mixology classes, grape stomping and more!  There will be FOUR  bands playing throughout the day thanks to our entertainment sponsor: Trinity Falls! \n\n\n\n\n\nThe festival is free to attend and family friendly! Wine tasting tickets are available NOW for purchase! Reserve your tickets before they sell out!  \n\n\n\n\n\nA portion of the proceeds will benefit our partners Frisco Arts! The official hotel partner of Frisco Uncorked is the Omni Frisco Hotel! They have a specil rate for Frisco Uncorked attendees! Click HERE for info!\n\n\n\n\n\nThank you and CHEERS to our media partner Lifestyle Frisco!!\n\n\n\n\n\n\n\n\nVisit our presenting sponsor O’Neil Wysocki - Family Law here: www.owlawyers.com\n\n\nRAIN OR SHINE... WE DRINK WINE! :)\n", "title": "Frisco Uncorked", "selectedPreferences": ["Active"], "selectedCategories": ["Family", "Art"], "primaryPreference": "Active", "primaryCategory": "Art"}, {"description": "THE HIVE BUCKHEAD  - SATURDAYS WE BRUNCH JOIN  US FOR SATURDAY BRUNCH + DINNER AFTERWARDS 11AM DOORS OPEN the most exciting SATURDAY brunch in the city at THE HIVE BUCKHEAD ( 1845 peachtree rd nw atl ga 30309- THE OLD BUCKHEAD CAFE INTERMEZZO ) :rsvp 4704516419 ( text first name and last name , party size and arrival time ).FOOD / MINGLE / CHAMPAGNE BRUNCH / BOTTOMLESS MIMOSAS/ PATIO / DAY TIME FUN / SATURDAY FUNDAY .\n", "title": "THE HIVE BUCKHEAD  - SATURDAYS WE BRUNCH JOIN  US FOR SATURDAY BRUNCH + DINNER AFTERWARDS 11AM DOORS OPEN the most exciting SATURDAY brunch in the city at THE HIVE BUCKHEAD ( 1845 peachtree rd nw atl ga 30309- THE OLD BUCKHEAD CAFE INTERMEZZO ) ", "selectedPreferences": [""], "selectedCategories": ["Food&Drink"], "primaryPreference": "", "primaryCategory": "Food&Drink"}, {"description": "DAWNLAND\r\nA documentary about cultural survival and stolen children\r\nFor over 100 years, the United States government has systematically removed American Indian children from their homes and communities to be raised by white families. Recently, the first government-sanctioned child welfare Truth and Reconciliation Commission (TRC) was formed in Maine. DAWNLAND documents Maine’s TRC journey, as it begins to address the devastating impact child welfare practices have had on the Wabanaki Confederacy, and searches for justice and healing. See dawnland.org for more information.\r\n \r\nApril 8th 5 - 8 pm or April 13th 11:30 am - 2:30 pmU of M St Paul Student Center Theatre2017 Buford AvenueSt Paul, MN 55108\r\nSandy Whitehawk (Sicangu Lakota) will facilitate a discussion following the film. Sandy played an integral part of the TRC work in Maine and continues to support reconciliation efforts around the country, including Minnesota.\r\nAppetizers and beverages will be served. Get your ticket today! \r\n \r\n\r\nScreenings are sponsored by the Center for Advanced Studies in Child, College of Education and Human Development, Circle of Indigenous Nations, and the School of Social Work.\r\n", "title": "DAWNLAND Documentary Screening", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "**Payment Plans are available in the checkout cart under the \"Payment Method\" drop down.**\nJULY 11, 12 AND 13TH 2019\n#NDGOODTIME\nLove Your Outdoor Country Experience!\nTHE DESTINATIONNew Salem, North Dakota (Just 25 minutes West of Bismarck)Morton County Fairgrounds (Right Under the Big Cow)\nINFORMATION:\n*Payment Plans are available in the checkout cart under the \"Payment Method\" drop down.\n*RFID Admission Wristbands will be mailed to you 2-3 Weeks Prior to the festival.\n*RFID Wristband replacement will have a fee of $25 per wristband.\nPrices will Increase over time.\nAll Sales are Final.  No Refunds or Exchanges.\nFestival Tickets do not include Campsites or Camping Admission.\nArtists are subject to change. \nWristbands Must stay on. Tampered wristbands will not be replaced or admitted for entrance.\n\nWWW.NDCOUNTRYFEST.COM", "title": "ND COUNTRY FEST 2019", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family", "Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "Join us for Cultivate: A Gathering Around the Word.\nWorship with an acoustic band, learn from Bible teacher Kelly Minter, and experience the sweetness of community and prayer. This is the perfect event to bring your whole group of friends or come on your own and leave with freshly-formed, deep friendships.\nNo matter where you are in your spiritual walk, we want to see you at Cultivate.\nRegister now.\nMore details available at cultivatevent.com.", "title": "Cultivate | Pilot Point, TX", "selectedPreferences": ["Cultural"], "selectedCategories": ["Art"], "primaryPreference": "Cultural", "primaryCategory": "Art"}, {"description": "IF IT'S YOUR BIRTHDAY\nIf you signed up to have a free b-day party at V-Live this is your official confirmation that your party is booked.  Please send this link to your guest {or you can order there tickets for them} and have your guest take the free tickets and they will be FREE until 11pm.  If your having a birthday party \"YOU\" do not need a ticket.  You also will receive a free table {{ FIRST COME FIRST SERVED }}.  Tickets are only for your guest  you are free all night.  When you arrive our b-day coordinator will be at the door to seat you at your table.  Doors open at 10pm.  \nIF YOU ARE A GUEST!!\nThese tickets will get you and your friends in for Free until 11pm on Friday.  Tickets are limited so please only take what you need so others can get tickets also.  This is a 21+ event.  Doors open at 10pm.", "title": "MY BIRTHDAY PARTY FREE VIP ADMISSION TICKETS GOOD UNTIL 11PM FRI APRIL 12TH @ V-LIVE ATLANTA", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "\nVenue-------------------------------------------------------------------April 15th, Preston Bradley Hall, Chicago Cultural CenterPianist and composer Fazıl Say will be performing a Troy Sonata in the first part of the concert. Vocalist Serenad Bağcan will be joining him on stage in the second part to present extraordinary examples from Turkish classical and literature fusion songs from the İlk Şarkılar album.\"He is not merely a pianist of genius; he will undoubtedly be one of the great artists of the twenty-first century.\" (Le Figaro, Paris)\n\n", "title": "Fazil Say in Chicago, IL", "selectedPreferences": ["Cultural", "Relaxing"], "selectedCategories": ["Art", "Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "\nTHE ENCHANTED BALL\n\n\nSUPPORTING Te Mata Park\n\n\nPRESENTED BY \n\n\nEtiquette & The Flagship Events Company\n\n\n\n\n\nSATURDAY 6th APRIL 2019\n\n\nSECRET LOCATION\n\n\n\n\n\n\n\n\nLimited tickets go on sale to those pre-registered Monday 28th January. \n\n\nGeneral release Tuesday 29th January. \n\n\n\n\n\nPre-Register Tickets - $165 + booking fee (limited tickets) \n\n\nGeneral Release - $175 + booking fee (limited tickets)\n\n\n\n\n\n“I WANT TO BE WITH THOSE WHO KNOW SECRET THINGS OR ELSE ALONE”\n\n\n\n\n\nSet in an idyllic secret location with the stunning surrounds of the Hawke’s Bay landscape, the location sets the scene for the most magical of summer celebrations. The mystery of The Enchanted Ball is set to be revealed as guests venture into the secret location, with locally produced fare, live music, DJ's, performers and an outstanding selection of beverages.\n\n\n\n\n\n\n\n\nTICKETS INCLUDE:\n\n\n- Beverage package including a selection of premium beer, wine, cider and non-alcoholic beverages\n\n\n- Locally produced street style fare served throughout the evening \n\n\n- Return transportation to the secret location from Napier, Hastings & Havelock North pickup points\n\n\n- Live music\n\n\n- Entertainment throughout the evening including, performers and much more\n\n\nTickets are strictly R18 and limited, once they are sold out there will be no more released. \n\n\n\n\n\nTRANSPORTATION - Nimon and Sons Ltd\n\n\nDue to the nature of this event being at a ‘Secret Location’, transportation is included in the ticket, which includes pickup before the event and drops off at the completion of the event.\n\n\n\n\n\nThere will be three pickup points, one in Havelock North, one in Hastings and one in Napier. Please choose the pickup point you would like to be collected from when you\n\n\npurchase your ticket.\n\n\n\n\n\nThe exact pickup points for each town will be sent out via email prior to the event.\n\n\n\n\n\nCATERING\n\n\nThe Enchanted Ball catering differs from the standard style of sit down catering usually served up at a ball. We have two of Hawke’s Bay’s best street style caterers Mamacita Restaurant & The Good Table serving a selection of made to order food as the evening rolls out. Each person will be able to order and receive fare when they are ready for it. The catering will be available all night, to eat at your own convenience in a street style service.\n\n\n\n\n\nENTERTAINMENT\n\n\nSHAUN PRESTON \n\n\nCOOL KIDS CLUB \n\n\nJONNY AVERY\n\n\nThere is one more act to be announced which will be released in the coming weeks. \n\n\n\n\n\nDRESS CODE\n\n\nBLACK TIE\n\n\n(ONE OF THE MURKIER DRESS CODES)\n\n\nMen have the option of either wearing a tuxedo or a dark suit and a tie. Because men have the option of dressing in a more casual manner, the dress code is open for women too, who can wear anything from a long dress to a cocktail number.\n\n\n\n\n\nWe think the only way to sum this up is to say, dress to impress.\n\n\n\n\n\n\n\n\nTE MATA PARK \n\n\nTe Mata Park is the jewel in Hawke's Bay's crown. 'The Sleeping Giant' has a significant and commanding presence in every way - a landmark with outstanding geological, ecological, recreational, spiritual and cultural significance. \n\n\n\n\n\nTe Mata Park is a vital recreational asset for our community and a popular attraction for tourists to the region. The Park is a magnet for walkers, runners, mountain bikers and paragliders, attracting 1 million visitors every year. It is managed by the Te Mata Park Trust Board, which is made up of 7 volunteers from our local community. Te Mata Peak Trust is delighted to be the recipient of the proceeds from this popular Hawke’s Bay event. \"Thank you to all the team behind the Enchanted Ball, for your outstanding support\" - Te Mata Peak Trust.\n\n\n\n\n\nDuring and before The Enchanted Ball, we will conduct a number of silent auctions, and a couple of live auctions. All the proceeds from these auctions will be donated to the Te Mata Peak Trust. When you purchase a ticket to The Enchanted Forest Ball, there is an option of a small donation to the Te Mata Peak Trust, we encourage all participants to make a small donation with their purchase.\n\n\n\n\n\nEtiquette and The Flagship Events Company will make a donation to the Trust at the completion of The Enchanted Ball.\n\n\n\n\n\n\n\n\nPARTNERS AND SPONSORS\n\n\nSpecial thanks to our sponsors and supporters, without them,\n\n\nspecial events like this could not go ahead!\n\n\n\n\n\nPRESENTING PARTNERS\n\n\nEtiquette – www.etiquetteevents.com\n\n\nThe Flagship Events Company – https://flagshipevents.nz/\n\n\n\n\n\nPLATINUM PARTNER\n\n\nNic & Cole - https://www.facebook.com/nicandcolenz/\n\n\n\n\n\nMAJOR PARTNERS\n\n\nNZDigital - https://nzdigital.co.nz/\n\n\nBayleys Real Estate - https://www.bayleys.co.nz/commercial/sales \n\n\nGifford Devine Barristers & Solicitors - https://www.gifforddevine.co.nz/your-legal-champions/\n\n\nNimon and Sons Ltd - http://www.nimons.co.nz/\n\n\n\n\n\nSUPPORTING PARTNERS\n\n\nPixie Munro - https://www.pixiemunro.co.nz/\n\n\nPremier Loos - http://www.premierloos.co.nz/\n\n\nIntense - https://www.intense.net.nz/\n\n\nA Touch of Elegance - http://www.elegancenz.co.nz/\n\n\nLynn Electrical - http://www.lynnelectrical.co.nz/\n\n\n\n\n\nMEDIA PARTNERS\n\n\nZM \n\n\nThe Hits\n\n\nHawke's Bay Today\n\n\nHawke's Bay App\n\n\n\n\n\nBEVERAGE PARTNERS\n\n\nThree Wise Birds Cider - http://www.threewisebirds.co.nz/\n\n\nPeroni - https://www.independentliquor.co.nz/peroni/\n\n\n\n\n\nCATERING PARTNERS\n\n\nMamacita Restaurant - https://www.mamacita.co.nz/\n\n\nThe Good Table - http://thegoodtable.co.nz/\n", "title": "The Enchanted Ball Supporting Te Mata Park", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlright stop, collaborate and listen!! The I Love the 90's Bash is coming back to Columbus Saturday April 6th!  We're lacing up our high tops, putting on our fanny packs and gettin' jiggy with it to the best music of the 90's!\n\nWhat you get:\n\n\n- Commemorative Tshirt available with ticket included!  You MUST purchase ticket with Tshirt included to receive shirt.\n- I Love the 90s color changing stadium cup for all your drinks\n- Slap bracelet to bring back childhood memories\n\n\n- No cover with ticket at participating bars\n\n\n- Drink specials at participating bars\n\n\n- Crawlers dressed in outrageous 90's gear\n\n\n- A party with kids from the 90s and the best 90's music\n\n\n\nTSHIRTS:  You must purchase the ticket with Tshirt included to receive the shirt.\n\n\n\n\n\n\n\n\n\n\n\n\n**EVERYTHING YOU NEED TO KNOW ABOUT THE CRAWL**\n\n\n\n\n\nREGISTRATION IS FROM 3PM-5PM AT:\n\n\nPARK STREET CANTINA\n\n\n491 PARK STREET\n\n\nCOLUMBUS, OH 43215\n\n\n\n\n\nREGISTRATION: You'll receive your 16oz color changing I Love the 90s color changing stadium cup and slap bracelet. If you can't make it by 5pm have a friend pick everything up for you and they will need to have your ticket.\n\n\n\n\n\nTICKETS: You MUST have a copy of your ticket with you or on your phone. Screenshots will not work, it must be the actual ticket. If purchasing at the door it's $20 cash only!\n\n\n\n\n\nROUTE: You’re able to go to any of the participating bars at your leisure after you register!\n\n\n\n\n\nDRINK SPECIALS: All specials are listed below or can be found on the Facebook event page at https://www.facebook.com/events/2172040843073519/\n\n\n\n\n\nINTERACTIVE MAP: All the drink specials and bars on an interactive map are at www.ilove90sbash.com/columbus\n\n\n\n\n\nREFUNDS: All sales are final and there are no refunds for the crawl.\n\n\n\n\n\nID: DO NOT FORGET YOUR ID!! It will be checked at every participating bar that you choose to go to. All participants must be 21 years old or older.\n\n\n\n\n\nWEATHER: Event goes on rain, snow or shine! Must be 21 to attend. All sales final, no refunds. Bar specials subject to change at bars discretion.\n\n\n\n\n\nParticipating bars:\n\n\nPark Street Cantina (Registration 3pm-5pm)\n\n\n$3 Corona \n\n\n$3 House shots\n\n\n\n\n\nBar Louie\n\n\n$3 Miller LIte bottles\n\n\n$4 Vodka Red Bulls\n\n\n$4 Grape Gatorades\n\n\n\n\n\nBBR\n\n\n$4 Bd Light drafts\n\n\n$4 Purple Hooter\n\n\n$5 double Vodka Red Bull\n\n\n\n\n\nBrothers Bar & Grill\n\n\n$3 Bud Light bottles\n\n\n$4 Jolly Rancher shots\n\n\n$5 double Vodka Red Bulls\n\n\n\n\n\nDhalia\n\n\n$4 Bud Light drafts\n\n\n$4 Purple Hooter \n\n\n$4 Bay Breeze\n\n\n\n\n\nGaswerks\n\n\n$3 Bud Light bottles\n\n\n$4 Cinnamon Toast Crunch shots\n\n\n$5 double vodka Red Bulls\n\n\n\n\n\nGranero Lounge\n\n\n$3 Corona\n\n\n$3 House shots\n\n\n\n\n\nNovak's Tavern\n\n\n$3 Miller Lite bottles\n\n\n$4 Scooby Snacks\n\n\n$5 Jameson\n\n\n\n\n\nPark Street Tavern\n\n\nSpecials coming soon!\n\n\n\n\n\nBe safe and have a great time! Please don't drink and drive. Call a cab, Lyft or Uber, or have someone who will be a designated driver. Don't miss out on the best crawl of the year! Must be 21 to participate. Event will go on rain, snow, or shine!\n\n\n\n\n\nHAPPY CRAWLING!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "title": "I Love the 90's Bash - Columbus", "selectedPreferences": ["Active"], "selectedCategories": ["Nightlife"], "primaryPreference": "Active", "primaryCategory": "Nightlife"}, {"description": "\r\nFoster Parents and Expecting or First Time Parents/Grandparents are invited to shop our exclusive Presale before we open our doors to the public. \r\nFind all you need from maternity items, newborn clothing, nursery gear, bathtime essentials, safety must-haves, swings, bouncy chairs, strollers, high chairs, pack 'n plays and so much more! \r\nEverything to set up your nursery and house... and don't forget the need to set-up grandma and grandpa's house in preparation for your new bundle of joy.\r\nTo be eligible for this FREE  pass you must either be pregnant or your child/grandchild is less than one year old.\r\nWe would LOVE it if you shared this on FACEBOOK.  After you register with your email...share!  Thank you in advance!\r\nWe look forward to having you at the sale!\r\n\r\nLaura Staggs I Event CoordinatorJBF HUGE KIDS’ Salesjbfsale.com I 303.506.1643Save\r\n", "title": "COS April 2019 Foster Parent & Expecting or First Time Parent/Grandparent Tickets FREE", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family"], "primaryPreference": "Relaxing", "primaryCategory": "Family"}, {"description": "Shop our First Time Mom/Foster Mom/Adoptive Mom Presale on Tues, April 16th from 6pm-9pm  This is the BEST time to stock up on all your New Baby needs!  With items from 500 families, you will have a vast selection of all types of items from baby gear, furniture, accessories, clothing and more!", "title": "First Time Mom/Foster Mom/Adoptive Mom Presale", "selectedPreferences": ["Active"], "selectedCategories": ["Family", "Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "Built In Brews is a monthly happy hour co-hosted by Built In Chicago and Chicago’s most exciting tech companies. It’s an opportunity for you to discover new career opportunities, mingle with Chicago’s tech leaders, and enjoy a few drinks, of course.\nSTATS invites you to meet the team behind the data, as in the most sports data in the world. Not to mention, an open invitation to check out their digs and learn about what they have in store for the future.\nTickets are required for this event and walk-ups are not permitted. Space is limited, so register now.\nDrinks and appetizers will be provided. This private event is for Built In Chicago members ages 21+. Please bring your ID and ticket to the event. Resumes optional. By registering for this event, you are agreeing to Built In's Terms of Use.\nThis is not an appropriate event to solicit for business or for staffing agencies to attend.", "title": "Built In Brews at STATS", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Nightlife", "Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "SOOOEEEEE! Calling all PIGS! Spring is just around the corner! Now, even if you are just getting started, you should be getting trained up for that awesome Pig Trail Mud Run scheduled for June 1, 2019 in Springdale!!! Help a great cause!\nPLEASE NOTE-All participants under the age of 18 MUST have a parental consent form signed. No one under 14 years of age may participate in the race.\nDON'T WAIT TILL THE LAST MINUTE!!  TAKE ADVANTAGE OF LOWER RATES!!   THE PRICE IS ONLY $65 PER RUNNER, BUT YOU CAN STILL APPLY GROUP DISCOUNT AND PROMO CODES IF YOU HAVE THEM. THE PRICE GOES UP IN MARCH!!. SO TAKE ADVANTAGE OF LOWER PRICES NOW!!!!!  (Included T-shirt, goody bag, commemorative medal, free food and beverages of ALL types at the area.  Each runner also gets a free raffle entry for numerous prizes!) \nAdvance Paid Parking and Premium Parking is NOW available due to overwhelming requests.  Look under \"individual\" tickets aside from you race ticket order!  NOW ON SALE!\nIf you are on the fence of the pig pen, it’s time to fall in the mud and register NOW!! Why leave Northwest Arkansas when a first class event such as this is right in your back yard???? And it is great fun regardless of your physical condition.\nBy yourself or on a team, THE EARLY PIG SPECIAL through MARCH! There is a MILITARY, LAW ENFORCEMENT, FIRE and FIRST RESPONDER $20 discount!!!! There is a GROUP discount of up to 20 % if you sign up NOW for the 12 for 10 Special or take advantage of our LARGE GROUP (per runner) DISCOUNT. New to 2019, Educators with a Teacher's License receive a $10.00 per person discount!! Set up your team, invite 12 or more of your friends via this site and you can take the already-discounted \" individual runner group rate\" by selecting the 12410 code under team tickets. There are other promo codes that can be used with these discounts if you know where to look and SHARE with your friends.\nYou can get all the details on the 2019 Pig Trail Mud Run at http://www.pigtrailmudrun.org/ or http://springdalerotary.org/.\nCome wallow in the mud with other swine, sows and pork lovers at the Pig Trail Mud Run, built and directed by the Springdale Rotary Club. If you think getting wet and dirty sounds fun and you and your piggy pal team members love to be mentally and physically challenged, then the Pig Trail Mud Run is the race for you. 2019 will bring more fun and some additional challenges to the course.\nCome on – get a team together, encourage your team to train a little (you DON’T have to be an Olympian) and join the Pig Trail Mud Run for a day that you’ll only be able to describe as “A Muddy BLAST!” This race promises to be more fun than a barrel of pickled pigs’ feet. Get in shape, have fun and KEEP those resolutions to cross the finish line on June 1!!!! Just select the GROUP option and get a discount on top of the Early Bird discount! Or opt for the 10 for 12 large team discount!  Code 12410.  Small teams still get the standard group discount. \nAfter you run, plan to stick around for more fun!!!! Pig out on COMPLIMENTARY food, drinks and beer and enjoy some great entertainment at our PIG party. Or, if you don’t like the idea of getting off the couch to prepare for the race, come on out and join the party anyway. Don't forget to bring the whole family and the little piggies can enjoy the Piglet Corral.\nIf our particular categories do not fit your group, call us to see if we can \"right-size” you into this event!! 479-422-7465 or e-mail pigtrailmudrun@springdalerotary.org .\nThis muddy mess is a fundraiser for the Springdale Rotary Club to help pay for the organization’s many local, national, and international projects. Registration includes t-shirt, commemorative medal, a goody bag, food and beverages (adult and otherwise). A portion of all registration and other fees is tax-deductible. Packet pick-up will be on Friday May 31, 2019 at Jose's Mexican Restaurant from 1-7 p.m. near the corner of US 412 and Hwy 112 in Springdale. Packets may be picked up on race day for those getting in town late.", "title": "2019 Rotary Pig Trail Mud Run!!!!", "selectedPreferences": ["Active"], "selectedCategories": ["Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "\nJoin Chicago Housewives & The Sugar Factory for our Girls Night Out as we socialize and shop local vendors while enjoying craft cocktails, wine and delicious bites!\n\n\n\n\n\nIt's out with the old and in with the new this spring! Come out and help us celebrate the start of a beautiful spring season. We'll be giving away Luau flowers to the first 50 women to check in. Let's sip, shop, and social! \n\n\n\n\n\n\n\nIt's FREE to attend, but please register your ticket.\n\n\n\n\n\n\n\n\nThe first 25 attendees will receive a swag bag full of goodies from Shadow Light Beauty Bar. Check them out on Instagram @ShadowLightBeautyBar\n\n\n\n\n\n\n\n\n\nNot sure what we do? Check out photos from our past events.\n\n\n\n\n\n\n\n\n\nFor vendor, swag bag, sponsorship, advertising, sponsorship and partner info please email chicago@housewivesinthecity.com\n\n\n\n\n\n\n\n\n\nWe love all people and have a great group of women from all different walks of life at our events! Want more info? Check us out\n\n\n\n\n\n\n\nMore info to come!!\n", "title": "Girls Night Out Happy Hour Luau at The Sugar Factory", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Muddy Princess is an outdoor 5km (3.1 mile) obstacle mud run for women - and women ONLY! \nOur event is for Princesses of all sizes, ages and fitness levels. We don’t focus on fastest times or competitions, we focus on fun so be prepared to run, walk, crawl, climb, slide, balance and laugh your way along our course for an amazing “girls dirty day out!”\nWe have no limits on the size of your team, it can be as many Princesses as you can convince to join you for a day in the mud! Please don’t feel excluded if you are entering as an individual, all of our Princesses are part of our Muddy Princess family and there will always be help and support to ensure everybody makes it over the obstacles and crosses the finish line at their own pace. \nThe event venue opens at 7:00am for registration with the first wave starting at 8:00am and continuing every 20 minutes (8:00, 8:20, 8:40 etc) up until the last wave of the day. Please choose your preferred start time when choosing your ticket. PLEASE NOTE – for safety reasons, each wave has limited numbers and once it is full there will be no additions allowed and no exceptions.\nWhat you get:\n\nPricing:\n\nSpectators are welcome at no additional fee so bring your husband, kids and cheering squad. We have a Village where they can cheer you at the Start and celebrate you at the Finish Line. They can explore the food and drink stalls, or sit and relax while they wait for you to have your fun in the mud. Please Note - We do not have a designated spectator zone along the course. Due to the different set ups at each venue, we cannot specifically keep spectators off the course but, we do ask that you respect the privacy of all our Princesses and please stay in the Village area while waiting for your Princess to return.\nWe have a Bag Drop ($5 on the day) where you can leave your stuff until you have completed the course. Parking will be $10 and VIP Parking is $20 (limited availability)\nThe minimum age for entry is 9 years young – but please, Moms, little Princesses (up to 13 years old) must be accompanied by a registered, participating adult. Event waivers must be signed by a parent or legal guardian of all Princesses under the age of 18. No waiver, no run, no exceptions.\nThere will be a selection of food and drinks vendors available for your convenience so no additional food and drinks are allowed at the venue.\n*All registration fees are per person, we do not have group rates with Early Bird prices.\nJoin us on Facebook: https://www.facebook.com/MuddyPrincessUSA\nFAQ's: http://www.muddyprincess.com/faq-page", "title": "Muddy Princess Atlanta, GA", "selectedPreferences": ["Active"], "selectedCategories": ["Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "During the course of three lectures focused on \"Coming to Our Senses,\" acclaimed author, critic, and photographer Teju Cole explores what it means to be a sensing being. Through personal accounts and literary examples, Cole will examine how the physical senses—and not only the traditional five of sight, smell, sound, taste, and touch—inform our experiences, open us up to epiphany, and shape our ethics. \nPlease note that attendees must register separately for the three Berlin Family Lectures. To register for Lecture 2 and Lecture 3, click on these hyperlinks.\nExperience\nAs sensing beings, how do we experience our own senses? Cole draws on his personal stories of the senses, examples in literature, and built and natural environments to describe the universal experiences of our senses. \n\nThe Berlin Family Lecture series are sponsored by Randy L. and Melvin R. Berlin, Chicago philanthropists and longtime supporters of the University of Chicago. Randy Lamm Berlin, AM’77, is a former lecturer at the University of Chicago Law School and a member and past chairperson of the Humanities Council at the Division of the Humanities. Melvin R. Berlin is Chairman Emeritus and founder of Berlin Packaging, LLC. The Randy L. and Melvin R. Berlin Family Lectures are named in honor of their gift to the Division of the Humanities.\n ", "title": "2019 Berlin Family Lectures, Teju Cole, Lecture 1 of 3", "selectedPreferences": ["Cultural"], "selectedCategories": ["Free"], "primaryPreference": "Cultural", "primaryCategory": "Free"}, {"description": "SPECIAL PRICING FOR ONLINE ORDERS!\nPowered by Acoustiguide, the Bishop’s Palace audio tour allows visitors to see historical images not seen by previous tours on a handheld, high-resolution screen. The Acoustiguide device also features new tour commentary specifically created for the self guided format.\nHours (last entrance 45 minutes before posted closing time)\n10 am – 5 pm, Sunday – Friday10 am – 6 pm, Saturday\nABOUT THE 1892 BISHOP’S PALACE\nBishop’s Palace, also known as the Walter and Josephine Gresham House, is one of the island’s best known and most popular tourist attractions. Bishop’s Palace is recognized as one of the nation’s most important late 19th century Victorian residences. Nicholas Clayton, Texas’ most accomplished architect of the period, designed the house for the Gresham family. In 1921, Galvestonians raised money to buy the house for the Galveston-Houston Archdiocese to make it the home of Bishop Byrne.\nGHF purchased the property in 2013 from the Galveston-Houston Archdiocese. The foundation is the third owner of the property and assumed management in 2007. It welcomes over 65,000 local, national and international visitors each year.", "title": "1892 Bishop's Palace Audio Tours", "selectedPreferences": ["Active"], "selectedCategories": ["Art", "Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "3 Days of Country and Rock!\nGreat Camping at Lakes Jam!  Come Early on Wednesday for the Camping Party and Stay through Sunday!\n\nNeed to spread out your payments?  Affirm Payment Plan - How does the payment plan work? \nAffirm offers clear, simple financing to split your Eventbrite order into 3 or 6 monthly payments (rates from 10-30% APR) for orders over $150. Once you select Monthly Payments with Affirm on the Eventbrite checkout page, you will need to confirm your loan on Affirm. Your tickets will be emailed to you immediately upon checkout. Make sure you pay your Affirm bills on or before your due dates. ", "title": "Lakes Jam 2019 Event", "selectedPreferences": ["Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "Happy New Year Queens!!!  We are excited to be returning to your city!Tribe of Dumo will be having its pop up shop. New Collections available! Clothes, jewelry and accessories will be available Styles come in Small - 4xl INVITE A FAMILY OR FRIEND ❤ \none ticket grants access to your friends and family. Register with your phone number and you'll receive a text reminder about this event one day prior.\nWe are also online at www.tribeofdumo.com", "title": "Tribe of Dumo African Pop Up Shop Boston", "selectedPreferences": [""], "selectedCategories": ["Art"], "primaryPreference": "", "primaryCategory": "Art"}, {"description": "Come join us for a 5K fun and reward yourself with Daiquiri's, Music, Food & Fun!\nThis run is not about finish times, this fun run is about having a great time with your friends & family! No Timing...feel free to track your time yourself.\nWalkers Welcomed!!!!\n7am - Gates Open7am - 8:30am - Race Day Packet Pickup9:00am - Race TimeFree Daiquiri refreshment immediately follow after participants cross the finish line.\nFeel free to stay to picnic and hang out at the Park after you complete your run. We will have Daiquiri's & Beer for $5 before and after the race!\nNO OUTSIDE LIQUOR ALLOWED.This is a trail run. Please be prepared to run/walk through dirt, rocks, grass etc...\nRegistration includes a T-shirt (First come first serve for sizes S, M, L, XL), Race Bib, Medal & a free Daiquiri at finish line.\nCostumes are encouraged! Please feel free to wear Tutus, Costumes, etc... We love it!\nNo Goodie Bags!!! We are saving the environment and most parks do not allow bags anymore.\nRain or Shine. Start Time, Location subject to change.Our policy are \"no refunds\". \"No Refunds\" for any reason.Transfer to another participant must take place 14 days prior to the event.\nWe do not give out refunds for changes! \nThank you and we look forward to seeing you!", "title": "DAIQUIRI DASH - New Orleans", "selectedPreferences": ["Active"], "selectedCategories": ["Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "\n\nJust Between Friends Williamson County is excited to bring 28,000 sq. ft. of bargains to our thousands of shoppers!  Join us for a shopping extravaganza for babies through juniors, shoes, baby equipment and gear, maternity items, feeding and bathing gear, bedding, room decor, outdoor and indoor toys, sports equipment, electronics, books, games, toys, baby and children's furniture, strollers, children's decor, bouncy seats, and so much more! \n\nThursday, May 2\n\n9:00am-7:00pm Open to the public$5 Admission or FREE with this pass!*2nd Drop Off tonight! Come back and see us tomorrow!*FRIDAY, May 3:9:00am-4:30pm Open To the Public (FREE Admission)*Come see the new items that were dropped off last night!*\nSATURDAY, May 4:                                                                        \n9:00am-2:00pm Open To the Public*1/2 Price Sale Day!* (FREE admission and most items will be half price)\n\n NOTE: Kids are welcome Thursday through Saturday,\n\nFurther details on www.jbfsale.com\n\n\nWe look forward to seeing you at the sale!\n\n\n\n\n", "title": "FREE Admission Pass - JBF Williamson County Spring Sale 2019", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Professional", "Family"], "primaryPreference": "Relaxing", "primaryCategory": "Family"}, {"description": "\nRevival on the River's annual worship festival, is a time for the community to come together as a unified body of Christ to worship, pray, and fellowship together. This is a FREE event, and all are invited to attend. Come join us for a day of worship, prayer, food, fellowship, and fun! \n\n\n\n\n\nFeaturing local artists and headlining, People & Songs. \n\n\n#revivalontheriver2019\n\n\n\n\n\nSupporting local artists and bands will be announced at a later date. \n", "title": "Revival on the River 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "AGES 18+ TO ENTER WITH VALID ID\nAGES 21+ TO DRINK WITH VALID ID\nNO REFUNDS | ALL SALES FINAL \nNo Cameras or Recording Devices Allowed.\nEvent may contain strobe lighting, fog, and other special effects.\nTickets: After completing your purchase on Eventbrite, you will receive an email confirmation with your attached PDF ticket(s). You MUST print and bring your PDF tickets AND VALID PHOTO IDENTIFICATION to be admitted for the event. You may download the Eventbrite app and show your ticket on your mobile device for entry in lieu of printing.\nNightCulture Ticketing Policy: Tickets can be transferred between patrons at their own risk. If a transferred ticket does not scan, proof of purchase will be required to redeem the ticket. Acceptable Proof forms: Legal, Valid Government ID. NightCulture cannot be held responsible for any issues that arise with a transferred ticket.\nTicketing Related Issues can be directed to: Tickets@NightCulture.com\nTICKET REMINDER: To ensure your satisfaction, NightCulture cannot guarantee tickets purchased from un-authorized 3rd party resellers (individuals or brokers). We recommend that you purchase tickets directly through Nightculture.com, eventbrite.com, our authorized partners, and the venue box offices. Questions: tickets@nightculture.com\nFor more information visit nightculture.com", "title": "Malaa - Houston", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Chi Omega 50 Years of Zeta ThetaEmbassy Suites Nashville SE – MurfreesboroApril 6, 2019~~ Two Events, a Brunch, and a Formal\nPlease buy tickets early. Tickets are limited due to space.Deadline to purchase tickets- March 15, 2019\nYou may buy tickets/tshirts through Eventbrite or download and print the Mail-In Order sheet which is located below.  \nEleusinian Brunch for all Zeta Theta Sisters - $4010:00-11:00 Registration for AlumnaeCoffee Bar and Mimosa Cash Bar for Alumnae11:00 MTSU Active Chi Omega Members Arrive11:00-2:00 BrunchKeynote Speaker-Emily Pentecost Ellis ('69)Group Pictures TakenTours of Chi Omega House2:30-4:30 Tours of Chi Omega HouseSign up at EventFormal for Alumnae Sisters (solo or with a date) - $75 per person6:30 pm - 12:00 amCocktail attireHeavy appetizers, dessert, and Cash barDJ and DancingVideo Presentation\n********************************************************************************\nMail In Order Sheet Option-Print order form and send payment to:Kalyn Catlett  2025 Mosaic Trail   Murfreesboro, TN 37130\nYou will receive an order confirmation via email.\nPrint Order Form: https://drive.google.com/file/d/1j6_D4oTbl0rVlizPU1aHL4q7wRm9PLlm/view?usp=sharin\n********************************************************************************\nClick here to see the  TSHIRT design.\nhttps://drive.google.com/file/d/12fvnWLZJx9aGpThL5MRrVbv-vubukBnE/view?usp=sharing\n********************************************************************************\nAccommodationsEmbassy Suites Nashville SE – Murfreesboro - April 5-7, 2019Rooms $159 a nightDeadline to receive Group Rate – March 4, 2019Group Name- Chi Omega Alumnae Chapter of MurfreesboroCode- COSPhone for Reservations- (615) 890-4464 or (800) 362-2779 orOnline Reservationshttps://embassysuites.hilton.com/en/es/groups/personalized/M/MBTESES-COS-20190405/index.jhtml?WT.mc_id=POG\n********************************************************************\nSponsors: Are you looking to promote your business or would just like to help out?\nDue to the expense of the venue, we are looking for monetary sponsors for the following items:Photo booth (evening) 1-3 sponsorsLiability Insurance- 1 sponsor- possibly an insurance brokerDecorations – 1-2 sponsorsFor more information: Please callMargaret Dill Andrea ('84) – 615-927-0002 Chairman of 50 Years of Zeta ThetaKalyn Catlett ('82) – (615) 308-5731 Chi Omega Murfreesboro- Alumnae Chapter President\n********************************************************************************\nUPLOAD YOUR Chi-O PHOTOS and VIDEOS for the video presentation presented at the formal.  We are looking for group photos/videos showing activities demonstrating sisterhood and MTSU involvement.  \nPlease scan and upload your photos with high resolution. Deadline to upload photos- March 15th.  Double click on link for Google Photos. \n1969-1979 https://photos.app.goo.gl/zhET7mKrjpaoXvYZ8\n1980-1989 https://photos.app.goo.gl/hXyqB6KmhKPdrojw8\n1990-1999 https://photos.app.goo.gl/FatPNKD3a6nxBeGv5\n2000-2009 https://photos.app.goo.gl/NQf3JxcYeUHCQ54A7\n2010-present https://photos.app.goo.gl/67a2upkgPaV12oQZA\n********************************************************************************\nThe Committee looks forward to celebrating this milestone with you in the Spring!  Hootie Hoo!!!! XOXO\n\n", "title": "Chi Omega - 50 Years of Zeta Theta ~  Two Events ~ A Brunch and A Formal", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Doors at 5\nSlightly Stoopid\n\nThe Ocean Beach, California-based band formed by multi-instrumentalists Kyle McDonald and Miles Doughty has matured into a versatile musical ensemble consisting of drummer Ryan “Rymo” Moran; percussionist Oguer “OG” Ocon; saxophonist Daniel “Dela” Delacruz; keyboardist Paul Wolstencroft; trumpet and trombone player Andy Geib, and an arsenal of guests that frequent the stage, most notably Karl Denson (Rolling Stones/Greyboy Allstars), Don Carlos, Chali 2na (Jurassic 5) and Rashawn Ross (Dave Matthews Band).\nThe band’s prolific 2017 schedule has included international shows in South America, Australia, England and the Netherlands, in addition to the 30+ national headlining dates that encompassed the band’s annual outdoor amphitheater tour, titled “Sounds Of Summer 2017,” ranking in Pollstar’s Top 100 Global Tours of Summer 2017. In December 2017, the genre-mashing outfit will host its 4th annual Closer To The Sun festival, a four day gathering of music in an intimate \"all inclusive\" setting for their hardest core fans and favorite hand selected talent, taking place on the sand in Puerto Morelos, Mexico, amidst the spiritual Mayan Peninsula. The Closer To The Sun festival also represents Slightly Stoopid’s philanthropic side, as the event helps to raise funds for the non-profit charity, Positive Legacy.\nAdditionally, Slightly Stoopid has generously supported the pediatric cancer organizations Grind For Life and the Sheckler Foundation by teaming with the legendary skateboarder Danny Way for a limited edition custom skate deck/CD fundraising project. Also, the 2017 animated video for their recent single “One Bright Day” (featuring singer Angela Hunte), included an “on-line auction” component utilizing limited edition hand-painted canvases used in the video. The effort helped to provide light to 4 villages associated with the Global Brightlight Foundation, a charitable organization for providing third world villages in need of solar power.\nRecently Slightly Stoopid churned out their second live webcast performance with music legend Bob Weir (Grateful Dead) at his TRI Studios complex, a session that yielded live versions of Grateful Dead’s “Franklin’s Tower” and Prince’s “Purple Rain” (the latter recorded at the respectful request of Weir on the morning that witnessed the legend’s unanticipated passing).\nAn eclectic band when it comes to musical styles as well as collaborations, Slightly Stoopid, now in their second decade of making music, continues to manufacture an energizing and multifaceted sound that has been described as “a spiritual bath of positive party energy.” Look for new music from the band in 2018…", "title": "Slightly Stoopid with special guests Matisyahu & HIRIE", "selectedPreferences": ["Active"], "selectedCategories": ["Food&Drink", "Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "Bring the entire family and come enjoy The Victory Cup Hot Air Balloon Festival & Polo Match!Join dozens of vendors, chefs, local musicians, artists, cooking demonstrations, pop-up art galleries, PLUS food and alcohol tasting partners. Weather permitting, Saturday will include a morning launch and evening glows and tethered rides. Not just about the balloons, Saturday will include Live Music, a Battle of the Chefs Tasting Competition, Polo Matches (a little bit of cowboy polo!) and a kids play area!Learn more by visiting: https://victorycup.org/riogrande.\n\n\n\n\n\nBoth VIP and General Admission Passes to the Victory Cup include the Hot Air Balloon portion of the event (weather permitting). Watch social media for updates. Balloon Pilots will be begin setting up 7AM and then again around 4PM, on the polo field, for a morning launch and then night time burn, glow and tethered rides. \nThe day starts early morning (daybreak - weather permitting), Saturday with a morning launch (around 7AM) and evening glows and tethered rides (around 4PM to 9PM). Not just about the balloons, Saturday will also include Live Music, a Wine Tasting Tent, a Battle of the Chefs Tasting Competition, Polo Matches and a kids play area! Limited passes still available. Polo. Fashion. Food. In its fifteenth year, this event isn’t just a polo match it’s a networking and social destination drawing thousands for each event. With events throughout the United States, The Victory Cup has become known as “America’s Polo Match!” Come on out and enjoy a gorgeous day of green grass, majestic horses, heart pounding polo, dozens of food and alcohol partners, and beautiful hot air balloons!\nTicket purchases & sponsorships are final and there will be absolutely no refunds made.\n\n\n\n\n", "title": "Rio Grande Valley Hot Air Balloon Festival & Polo Match", "selectedPreferences": ["Lit", "Active"], "selectedCategories": ["Shows", "Family", "Food&Drink", "Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "Easter 2019 is almost here! We are preparing and getting excited about seeing our park filled again with families having a good time! We will be in Mason Mill Park on Saturday, April 20, 2019 from 10am-11:30am. We will have lots of eggs, cotton candy, balloons, Easter Bunny, and also Buzz from Georgia Tech! We want to say thank you to Bridgepoint Church at Toco Hills for the continued financial support in order to make this event possible. Our event has grown every year and we are making plans to help with the lines and confusion. Last year, we more than doubled the number of people in the park. This year, when you arrive, you will check in for a field and a time. This way, we can help to control the number of kids on the field and make sure the kid to egg ratio is fun! If you are interested in helping us with the event, please message us or reply to the event. We would love to have you join us! Also, we want to collect hygiene products and/or toilet paper for our friends (Toco Hills Community Alliance) helping our neighbors in need. We will have a collection station at the park. ", "title": "Mason Mill Park Easter Egg Hunt", "selectedPreferences": ["Cultural", "Active", "Cultural"], "selectedCategories": ["Sports"], "primaryPreference": "Cultural", "primaryCategory": "Sports"}, {"description": "ADA ACCESSIBLE SEATING: \nPlease choose the accessible seating option to ensure ADA accessibility. These seats are located in Rows O and P of Sections A, B and C only.\n\nMust be 21 or older to attend. \nRESTRICTIONS: Photography / Coolers / Audio / Video / Smoking \nCAMERAS: Professional cameras are not allowed at any FireKeepers event.\nPARKING: There are over 2,600 regular lot spaces, valet parking (free with Red Hot Rewards Club membership), a 2,080 space covered parking garage, and RV Parking (no hook-ups).", "title": "Smokey Robinson", "selectedPreferences": [""], "selectedCategories": [""], "primaryPreference": "", "primaryCategory": ""}, {"description": "MUST PURCHASE PASSES AND PARKING IN ADVANCE!\nTicket, Updated Schedule and All Other Details Here: https://victorycup.org/nashville/\nBalloons. Polo. Fashion. Food. In its fourteenth year, this event isn’t just a polo match it’s a networking and social destination drawing thousands for each event. With events throughout the United States, The Victory Cup has become known as “America’s Polo Match!” Come on out and enjoy a gorgeous day of green grass, majestic horses, heart pounding polo, dozens of food and alcohol partners, and beautiful hot air balloons!\nThe day starts at day break with a scheduled Hot Air Balloon launch, on the polo field! After the Hot Air Balloon launch, the food, wine and polo portion of the schedule kicks off around 11AM for Golden Mallet VIP’s and Founder’s Lounge Passholders. The VIP portion of the event will include live music, a Hospitality Alcohol Tasting Tent a Battle of the Chefs Tasting Competition, rivalry Polo Matches, and a kids play area For all passholders, don't forget to join us for an evening Hot Air Balloon Glow and Tethered Rides. Founder’s Lounge Passholders will also be able to enjoy a Farm to Table Dinner on the Polo Field, with the Polo Players that evening. Both VIP and General Admission Passes include the Hot Air Balloon portion of the event starting at sunrise and then again in the afternoon lasting until sunset (weather permitting). Watch social media for updates. Balloon Pilots will be setting up at 4 PM on Saturday, on the polo field, for a night time burn, glow and tethered rides.", "title": "Nashville's Hot Air Balloon Festival & Polo Match", "selectedPreferences": ["Lit", "Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "Indiana High School Football authority Paul Condry and his team at the Indiana Football Digest as well as Regional Radio Sports Network collaborated with the Colts organization as well High School coaches to create a celebration of Indiana High School Football once per year. This event would become the Oscars® or ESPY’s® of football in Indiana.\nEach year, over 400 attendees to this banquet and award ceremony gather together to recognize the best players, coaches, and media representatives in Indiana High School Football. These award recipients are chosen after a panel of media and coaches review over 18,000 varsity players in Indiana.", "title": "2019 Griddy Awards Banquet", "selectedPreferences": ["Relaxing", "Cultural"], "selectedCategories": ["Family", "Sports"], "primaryPreference": "Cultural", "primaryCategory": "Sports"}, {"description": "TACO TUESDAYS : \nTHE HIVE BUCKHEAD RESTAURANT AND BAR ( 1845 Peachtree rd nw ATL ga 30309 : FORMER BUCKHEAD CAFE INTERMEZZO ) ( $2 TACOS / $7 MARGARITAS/ $5 SANGRIA / $7 MOJITOS / $5 SHOTS / $15 SHISHA /$100 BTLS : SPECIALS ) .  FOOD / MINGLE /  HD TVS / BRUNCH HAPPY HOUR SPECIALS / DINE /PARKING IN THE REAR :", "title": " INTERNATIONAL AFFAIR  ON TUESDAYS  IN ATL  :THE HIVE BUCKHEAD ", "selectedPreferences": ["Cultural", "Relaxing"], "selectedCategories": ["Family", "Food&Drink"], "primaryPreference": "Relaxing", "primaryCategory": "Food&Drink"}, {"description": "\r\n\r\nHouston has Pride!!!\r\nTime to celebrate Pride Downtown. The Parade moved Downtown a few years ago and it gets better every year!! Houstonians love going Downtown for this event. Come Downtown check out the Parade and celebrate with the city!! Every year over 700,000 people attend the Festival from all over the world. \r\nIn addition to official parade and events, there will also be many other activities and events happening within blocks of the parade. We will gather that information and put it together in an easy to read format. All of that will be done for FREE. That information will be sent out to our mailing list and posted to our website and social media. Let us know that you are interested in going. Please consider telling one friend who would love this.\r\nPlease email us things you want to see at this event. We plan to make this a yearly event which will get better every year. So your feedback is crucial. Downtown Houston is well on it's way to becoming the true cultural heart of the city. Houston deserves a party like this. This will only happen with your continued support and enthusiam. PLEASE JOIN OUR MAILING LIST\r\n\r\n\r\n\r\nCOME CELEBRATE WITH THE CITY!!!!\r\nSHARE TAG INVITE YOUR FRIENDS ON SOCIAL MEDIA \r\n-----------------------------------------------------------------------------------------------------------------------------------------------\r\nNow that you are considering celebrating with us, here is some information you may find helpful.\r\nwww.downtownfest.org\r\nCheck downtownhouston.org/parking to help find parking spots.\r\nPARKING: Due to Hurricane Harvey, many of the garages downtown are not available. Please consider taking the MetroRail, Uber, Lyft, Taxi or using PARK & RIDE for the celebration. Please look for emergency no parking signs before parking. Cars will be towed for security purposes. If you drive downtown, please use this website to locate a garage:www.downtownhoustonparking.org.\r\nATTIRE: This is Pride. Please dress accordingly. This is a chance to dress up In the spirit of the holiday. Many locations will have a dress code. Some will not. Ladies the best part about Downtown is how close all the venues are to eachother. Wearing heels downtown is much easier than other neighborhoods. Each party may have individual requirements please contact the venue for more specific information. This page is intended as an informational page. Registration not required to attend any individual event. Each event may have it's own requirements. \r\nBy registering we will inform you of updates to any events downtown as we see them. We will also inform you of other events happening Downtown in the future. \r\nThank you so much for reading all of this. We are excited to celebrate with you!! Since you read this we think you have a strong interest in attending. Please consider sending a personal invite to one friend who you think would also love this event. At the end of the day, the most fun events are about the people who attend them. Bring us your most fun friend. We will do the same. We will all celebrate together!!! \r\n \r\n#PrideDowntown\r\n\r\n\r\n\r\n\r\n", "title": "Pride Downtown", "selectedPreferences": ["Active", "Cultural"], "selectedCategories": ["Free", "Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "The 6th Annual Saint LAAA FaB --- BLACK PRIDE DAY, Celebrating the rich history and culture of people of African descent.The festival is FREE to the Public and will feature artifacts,art, music, dance, food, vendors, children activities, health & wellness, prizes and so much more. \n\nSeeking Sponsorship,Vendors, Entertainment & Volunteers!!!\nVist: www.saintlaaafab.com \n\nDon't forgot to like,follow, & Share!\nFacebook, Instagram, Twitter @saintlaaafab\n", "title": "6th Annual Saint Louis African American Artifacts Festival and Bazaar", "selectedPreferences": ["Active", "Cultural"], "selectedCategories": ["Art", "Free", "Shows", "Food&Drink", "Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "We've seen them before: The candidates sit at the front of the room, they're asked questions, we listen to their answers, and then everyone goes home. Nope. Not on our watch. Our generation demands more creativity, more excitement, more energy! And we're gonna give it to you, San Antonio.Come on in, grab a beer, and watch the finest millennial-focused candidate forum in the land: MOVE Texas's San Antonio Night Live! : Learn (and laugh) as we ask the candidates about their vision for the Alamo City through interactive game shows, a creative showcase, and deep-dive discussions. Best of all, YOU get to play a part, too. Don't want to miss this episode. LIVE FROM THE BRICK, IT'S SAN ANTONIO NIGHT! ", "title": "San Antonio Night Live: A Youth Municipal Candidate Forum", "selectedPreferences": ["Cultural"], "selectedCategories": ["Nightlife", "Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "Bring a friend and join us for a night of free:\n\nIce Skating\nNacho/Taco Bar\nChocolate Fountains\nFace Painting\nGlitter Tattoos\n", "title": "Stieper & Brust Orthodontics Ice Skating Party", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family", "Sports"], "primaryPreference": "Relaxing", "primaryCategory": "Sports"}, {"description": "Join me for an evening of connecting with your soul and communicating with spirit and loved ones! This will be a profound experience and an amazing chat, with a huge focus on life and the afterlife. I’ll take the edge off the overwhelming subject of death with my sense of humor. I’ll first talk about how I see the world as a psychic and medium, then I’ll speak about the real reason you chose to be here on Earth. Finally, I’ll be doing as many audience readings as I can during the evening. This is a gallery event, so not everyone is guaranteed a reading. This is very interactive, so bring a friend too!Doors will open at 5:30 pm. There will be a cash bar available. Products from my store, Awakenings, will be available for purchase, such as crystals, sage products, pendulums, jewelry, essential oils, and so much more! Tickets are only $40 and once purchased, will be non-refundable. There is no reserved seating, it is first come, first serve. Everyone ages 15 and up is welcome. I’ll see you there!", "title": "LIVE Audience Reading-Kearney, NE-Psychic/Medium Kelli Miller", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "\nHall of Fame Induction Evening pricing schedule\nMar 1-Mar 21 $339 | Mar 22-Apr 6 $399 \n\nThank you for your support!\n\nEvent Overview\nHonoring the Induction Class of 2018 | Snowsport History Celebration is a series of events held in historic Park City and will culminate with the U.S. Ski and Snowboard Hall of Fame Induction Ceremony in Salt Lake City. The week boasts gatherings, riding and sliding, organized reunions, parties, presentations and much more! \n\n\n\nLodging and Lift Tickets\nIn order to book lodging at the discounted rates, please FIRST PURCHASE your tickets. Once you have completed the registration process you will be sent a conformation along with hotel codes, links and instructions for booking. Once you are registered you will automatically have access to the discounted daily lift ticket deals Monday-Sunday at various Utah resorts. Please be sure to bring a picture ID to purchase lift tickets onsite. ", "title": "Class of 2018 Induction | Salt Lake City Edition | 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Shows", "Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "\nPLEASE BE AWARE: To CHOOSE your seats, you MUST be on a laptop or a desktop. A mobile device will not allow you to choose your seats and you will automatically purchase next available seating. \n\n\nThis year's 2019 Annual Princess Tea Party presents A Mermaid's Tale! Join us May 19th, 4-6 PM with doors opening at 3pm. Ladies, you are invited to enjoy a magical afternoon of high tea and events with the special little princesses in your life. The afternoon will include a silent auction, visits from your favorite princesses, vendors, activities, and so much more. TICKET REGISTRATION:\nTicket Registration is $30 for the early bird sale through December 31st and increases to $40 January 1st. Children under \"1 & under\" are FREE as long as they sit on an adult's lap. \nPLEASE BE AWARE: To CHOOSE your seats, you MUST be on a latptop or a desktop. A mobile device will not allow you to choose your seats and you will automatically purchase next available seating. \nSEATING: PLEASE READ CAREFULLY.\nPlease use the venue map to select which table you would like to sit at. Although the layout of the venue is a close representation of the venue itself, it may be adjusted slightly to accomidate decor. It is recommended that you purchase your tickets at the same time as those you want at your table to ensure you can both choose open seating together.\n\nIf you do not have guests you choose to sit by, please choose to fill other empty seating first before opening a new table. \n\nThank you! \n\nATTIRE:Our young guests are invited to dress as their favorite princess. Ladies are encouraged to dress in tea party attire; sun dresses, hats, gloves, etc. You are also more than welcome to dress as a princess yourself alongside your little princess if you desire. HIGH TEA: Available to our guests will be hors d'oeuvres, tea sandwiches, desserts, & beverage refreshments. FUNDRAISER BENEFITING CHILD RESCUE EFFORTS:Enjoy a great event for an even greater cause! Every year, proceeds from this fun and whimsical event are donated to a non-profit organization dedicated to rescuing children from human trafficking and sexual exploitation. Once rescued, these children and young adults are offered medical care and counseling, are brought to a “rescue home\" where they can live peacefully, eat nutritious meals, get a valuable education and play interactive games with other children. In addition, when they reach a certain age, they can learn a skilled trade like sewing, jewelry making, hairstyling, waitressing or cooking.\n\n** Please note that all conversation at this event will be age appropriate\n\n\nCONTACT: For general questions and inquiries you can email us at princessteapartyfw@gmail.com or message us here on Facebook. \nDONATIONS: Interested in making a donation towards the cause or making a donation to our silent auction? Contact us at princessteapartydonations@gmail.com\nSPONSORS: Interested in becoming a business sponsor with our event? Contact us at princessteapartysponsors@gmail.com.VOLUNTEERS: Interested in volunteering at this event? Contact us at princessteapartyvolunteers@gmail.com.TABLE CONTEST: Interested in entering our table decorating contest? Contact us at princessteapartydecorators@gmail.com\nTickets: Do you have questions about your ticket purchase? Please email princessteapartyboxoffice@gmail.com\n", "title": "A Mermaid's Tale (Main Event)", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "SATURDAY :FREE ENTRY /PARKING ALL NIGHT SEDUCTION SATURDAY AT ARIF LOUNGE ( 2847 BUFORD HWY NE ATL ) SECTION STARTS AT 1 BTL $250- EVERY SATURDAY  JOIN US : LIVE / EXCITING/ FUN / BIRTHDAYS AND FREE ENTRY / FREE PARKING  / BIRTHDAY  AFFAIRS /NO HASSLE FOOD - SERVED ALL DAY / $200 BOTTLES /  PARTY/  DANCE / INDUSTRY NIGHT / INTERNATIONAL NIGHT /MINGLE LIVE ./info / table 470-451-6419\n", "title": "Free entry free parking at Arif lounge Saturdays ATL ( section starts at 1 btl = $250 )  : litt every SATURDAY ", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife", "Food&Drink"], "primaryPreference": "Lit", "primaryCategory": "Food&Drink"}, {"description": "Clothing and accessories by: Polkadotted Pineapple Boutique located in KentuckyCelebrating 9 years of suicide prevention with Live Out Loud Charity a non profit organization focused on suicide prevention, anti bullying, and core character development.  Our 3rd Annual Kentucky Derby Fashion Show will celebrate life through fashion, fun, and a very informative suicide prevention seminar to be held Sunday, April 14, 2019 in Louisville, Kentucky. This is a night everyone will remember. Are you ready for the fashion show of your lifetime? Help us raise funds while attending this fun yet informative event.  Models and titleholders from nationwide are taking a stance by parading down our runway, to stop the most preventable cause of death, suicide. Top performers, suicide prevention seminar, electric fashions, and bold people.... It can't get better than this.  To learn more about Live Out Loud Charity you may visit  www.liveoutloudcharity.org  Purchase tickets below. All net proceeds will be given to Live Out Loud Charity. CHECK US OUT IN THE NEWSNBC5 CHICAGO NEWSWAVE 3 LOUISVILLE NEWSAWARD WINNING PUBLICIST FASHION BLOGI LIVE IN A MAGAZINE FASHION ARTICLEDAILY 24 MAIL (BANGLADESH, ASIA)\r\nEVENT DETAILSSunday, April 14, 2019Crowne Plaza Hotel830 Phillips Ln. Louisville, KY 40209\r\n2nd Annual Kentucky Derby Fashion ShowBenefit for Live Out Loud CharityVenue: Louisville, KY 5:00pm Guests Arrive, Red Carpet Interviews, raffles, shopping with our vendors, cash bar, photo ops on the Red Carpet, media interviews6pm to 9pm Fashion Show (dress code is dressy)\r\nTicket Link: THIS PAGE. PURCHASE ABOVE. (Green button that says tickets). Please note that our fashion shows tend to sell out 3 weeks to 1 week in advance. Plesae get your tickets way in advance. Must pre-purchase tickets online. Enjoy couture fashion designers, inspirational speakers, ambassador crowning & award ceremony, LIVE music, and more!LIKE OUR FAN PAGE on facebook: https://www.facebook.com/liveoutloudcharity/ Leave a positive comment under one of our recent posts. We appreciate your support. Check out our website to learn more about the charity: www.liveoutloudcharity.org\r\nView our suicide prevention video CLICK HERETake our suicide prevention pledge CLICK HEREView our anti bullying video. CLICK HERE. Take the anti bullying pledge. CLICK HERE. Recommended Hotel(s):Crown Plaza host hotel. We do not have a discount rate. Look onHotels.com search Louisville, KY to find great deals on hotels.Hotels near the show:We recommend booking at the hotel listed above since this is where the show will be held. We recommend that our out of town models book Saturday night since we usually have mandatory model fittings on Saturday with a optional Model Boot Camp and on Sunday we hold the mandatory rehearsal. In addition Sunday is the big  fashion show day. We recommend if you can to stay Sunday night as well. \r\nTicket InformationWe do not mail tickets or hand out actual physical tickets. You can however print out your ticket once you purchase it here online. Your name will be placed on our ticket list. You will check in with your name at the door. Your name will be listed as it appears when you pay online. Bring a receipt of your ticket just in case. Refunds are not given for any reason. If you can not make it to our event after purchasing a ticket we will hold your seat for the next show. \r\nDoors close directly at the time the show starts. No one let in after the show has begun until intermission.\r\nDuring the show an LOLC Ambassador will present a QPR Suicide Prevention Steps & LOLC seminar.There will be other speakers from the Live Out Loud Charity Leadership Academy. To learn more about our Leadership Academy and Live Out Loud Charity go to www.liveoutloudcharity.orgThings guests should know:\r\n-Everyone is to arrive at the time doors open to check in at the door and find their seat. Doors will stay closed at the start of show time and guests will not be allowed in late and must wait until intermission. There are no refunds. Tickets were not handed our prior to our event but if you bought a ticket online your name is on our ticket list. If your guest bought your ticket in person, then your email address was given and you were emailed a ticket copy (again your name will be on the list at check in). *Please print out your ticket confirmation (print receipt from online) when purchasing online just in case.-Dress code for all guests is dressy NOT business casual. We prefer fancy dresses, suits, dressy pants outfits, etc. This event theme is fashion forward so think fun fashion or dressy.  No gym shoes, hats, jeans, or casual clothing allowed. Purses and bags should be stowed under the chair. We are not responsible for missing items. If you need to keep items with you during the show they must be stowed under your seat during the fashion show at all times until intermission or after the show. Do not have your purse or coat showing on our seat or it will ruin the asthetic of the photos taken during the event. Thing glamorous and have fun dressing up for this fun event. -If requesting handicap or have other special needs seating please email info@liveoutloudcharity.org We care about our attendees and will do our absolute best to accommodate those with any special or specific needs. Please inform us and state what is needed.-Dress code colors: anything dressy. All colors allowed. Have fun! Keep in mind the colors of the charity are blue, yellow, green. Bright blue (turquoise shades) are our absolute favorite. These colors are not mandatory.-Guests may purchase raffles tickets, DVDs, silent auctions. There will be various vendors with clothing, jewelry, etc.-If you know anyone that would like to donate or volunteer please have them contact us directly at info@liveoutloudcharity.org\r\n\r\nThere are no ticket refunds for any reason. In the event a guest can not attend an LOLC paid event, we do not issue refunds, however we will hold the funds for up to one year so the guest may attend any of our events held across the USA (guest must inform us at least 3 weeks before the event to ensure we can save a seat.)", "title": "3rd Annual Kentucky Derby Fashion Show ", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "Eugene Bullard's story would be unbelievable if it were not all true. He was a professional boxer, World War I flying ace, jazz musician and a spy. Who is this remarkable African-America? Born in Columbus, Georgia, Bullard traveled the world, joining the French Foreign Legion after being denied a meaningful place in the United States Army. He rose through the ranks and flew agaisnt the famous \"Red Baron\" as part of the Lafayette Escadrille. But when the Escadrille was incorporated into the new U.S. Army Air Corps in 1917, the color of Bullard's skin prevented him from taking his place alongside the other American heroes of his day. But that didn't stop him.He went on to fame as a bandleader in Paris  during the 1920's and was a spy against the Nazis. This original play by Mad River Theatre Works shows how Bullard's determination and perserverance helped him to overcome discrimination throughout his life. It is an uplifting tale of vision and hope.\r\nRecommended for 3rd - 12th grades.  \r\nThe Carver Community Cultural Center‘s Youth Matinee Series engages children, teachers and families through the performing arts by igniting imaginations and introducing students to the diverse cultures of our global community, these performances open doors to greater knowledge and understanding of our world and fosters a love for the arts and learning.\r\nAll performances are free and open to the public. Registration required for all guests. Priority reservations for school groups. All matinees begin at 11:00 am and last approximately an hour.\r\n\r\n\r\nFAQs\r\nGENERAL INFO\r\nAddress:  226 N. Hackberry, San Antonio, TX 78202, between Houston and Commerce Streets. View map\r\nTRAIN DELAY ADVISORY:  We strongly advise using Nolan, Iowa or  Montana Streets to get here. Avoid using Commerce, Houston and Pine Streets, all of which have street-level railroad crossings and often have slow-moving or parked trains on the tracks. Many school groups have arrived late to our matinees because of these train crossings.\r\nEvent Start:  All matinees begin promptly at 11 a.m., lasting approximately 50-60 minutes.\r\nArrivals:  Doors will open for most shows at 10:15 a.m., at which time seating will begin.\r\nHELP/CONTACT\r\nFor questions and assistance with online registration, call the Carver Box Office (210-207-2234) or email education@thecarver.org.\r\n\r\nREGISTRATION & TICKETING\r\nWhen can I register and how are tickets distributed?\r\nWe have implemented new registration practices this year. These procedures are intended to give school groups priority access to our matinees and ensure higher attendance at the performances by reducing the number of no-shows.\r\n\r\n\r\nSchools (state-licensed public, charter and private) have priority registration for ticket requests. Registrations for the all matinees will open for schools September 1, 2018. \r\n\r\n\r\nAll School registrations will be reviewed for eligibility. If we determine your request to be ineligible as a School, your registration will be cancelled and we will notify you via email of this action.\r\n\r\n\r\nAll other ticket types (homeschool, senior groups, individuals) will become avialableas follows: Events occuring between October - December 2018 will go onsale as of Sept. 19, 2018. Events occurring January - May 2019 will go onsale as of December 1, 2018. Tickets are reserved for all these ticket types, so will be available effective the on-sale date.\r\n\r\n\r\nAvailable ticket for \"all other ticket types\" may increase, based upon advance school group registrations.\r\n\r\n\r\n\r\nCan I register for multiple events in the series at one time?\r\nSchools, yes; other ticket types, no.\r\nSchools may register for all of the matinees that are open to registration; however, each matinee requires a separate registration. Other ticket types can only register for a matinee four (4) weeks prior to the matinee's date. \r\nMy school group is larger than 100 attendees, but ticket requests are capped at 100. What do we do?\r\nYou must complete two registration requests.Place your initial request for 100. Later in the registration process you will be asked for the total number of tickets needed for your group, if greater than 100.  Enter the total number of tickets needed in that space. Once you have completed the registration, you will need to place a second registration for the remaining balance of your group. You will need to fill out all the requested information, which is minor inconvenience, but it is efficient in the long run.\r\nWhat if I don't know how many will be attending on the day of the event?\r\nRegister the number of attendees that are most likely to attend the event. Two weeks prior to the event, we will contact you to confirm your group's final attendance. Do not order in excess of your best estimate, as attendance will be reviewed and a history of lower group attendance than tickets requested for future events may affect your group's ticket allocations.\r\nCan homeschool households and co-ops register as a group or school?\r\nNo. Homeschoolers may only request as an individual households, and may request no more than six (6) tickets per household. We will cancel all requests by homeschools attempting to register as a school or other group.\r\nI'm trying to register, but when I enter my quantity it says the amount requested isn't available. What's up with that?\r\nIf you're registering late, there may not be enough tickets left. We are distributing 660 tickets to each matinee. Each ticket type has been allocated a predetermined quantity. All tickets requests are pulled from the total 660 tickets available. So, if schools have claimed 450 tickets during advance registration, only 210 tickets remain to be distributed among all other ticket types.\r\nRegardless of the type of tickets being requested, when the total amount distributed reaches 660, tickets will no longer be distributed. Likewise, the number of tickets allocated to a particular ticket type may all be claimed.\r\nCan I email or fax my registration?\r\nNo. All orders must be made through Eventbrite.\r\nCan I update my registration information?\r\nYes, you may update your registration information online up to the sales end date, or thereafter by contacting the Carver Box Office: 210-207-7211, liz.cardenas@sanantonio.gov.\r\n\r\nCANCELLATIONS/NO-SHOWS\r\nWhat happens if we register but later find out that we can't attend?\r\nIf you registered but are later unable to attend, update your information using your Eventbrite registration confirmation or contact the Carver Box Office (liz.cardenas@sanantonio.gov) to release your seats.\r\nAll school registrations will be contacted via phone or email  2-3 weeks prior to the event to confirm attendance at the event. If you do not confirm your registration within three business as required, your tickets for the event will be released. If you confirm and are a no-show at the event, all registrations for future events in the series will be cancelled. \r\nIn the event that a school registers then cancels their registration less than a week prior to the event or is a no-show after cancelling, we will send notification to the registrant and the school's administrators to make them aware of the situation and of any possible consequences, i.e. cancellation of all remaining reserverations for the school.\r\nDo I have to present a ticket at the event?\r\nNo. Physical tickets are not being distributed. You will be required to check-in upon arrival.\r\nIs there reserved seating?\r\nYes and no. Seating is typically on a first-come, first seated basis; however, we reserve the right to designate assigned seats or sections based upon the registrations received for each matinee. We understand that you may desire to sit in a particular area, and will accommodate those requests if possible. The Carver will determine available seating locations for all matinees.\r\n Saving seats is prohibited.\r\nIs ADA seating available?\r\nYes, indviduals requiring accessible seating will be offered an opportunity to request it during registration. ADA seating may be apart from the rest of your group. If a minor requires special accommodations, a chaperone is required to accompany the minor.\r\nWe ordered tickets individually, but we want to sit together. How can we arrange that?\r\nIf you are meeting up with other households or individuals and wish to sit together, you are requested to arrive early and be prepared to enter as a group. We do not guarantee that space will be able for you to sit in a group, however. We also do not permit seat-saving for anyone not present, if you choose to be seated before everyone you're expecting is present.\r\nIs parking available? View map\r\nBus Parking:  If arriving by bus, busses may unload passengers on Hackberry Street in front of the theatre. After unloading, drivers may proceed north on Hackberry to park, or may park on Mesquite and Swiss Streets. Do not park in the Brackenridge Learning Center or Taylor Mortuary lots.\r\nVehicle Parking:  Individuals arriving by vehicle may park free at 215 N. Hackberry, in our Center St. lot, located behind the theatre or on any available side streets. The streets are not metered.\r\nSenior Center Vans and Handicapped Parking:  Seniors and handicapped individuals should unload on Center Street, just north of the theatre, where an ADA ramp is conveniently located. Using the side entrance also reduces the number of stairs required to enter the facility. After unloading, drivers may park in our Center Street lot, located behind the theatre, which offers designated Handicapped Parking spaces.\r\nDo you offer transportation assistance for schools?\r\nYes. Transportation funds are available for public, charter and private schools until funding runs out. To receive information on reimbursement, select \"Yes\" when asked during the registration process, and information will be emailed to you.\r\n\r\nReimbursements are capped at $125 per bus/driver, and will be limited to your actual expense if less than $125\r\nYour school group must have at least 25 attendees\r\nReimbursements are processed after you have submitted invoices (not estimates) for bus services\r\nReimbursements will be pre-approved upon receipt of your registration\r\nAs funding is limited, funds may not be available for all programs late in the season.\r\n\r\n \r\n", "title": "Youth Matinee: Mad River Theatre Works presents Wings of Courage", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Art"], "primaryPreference": "Relaxing", "primaryCategory": "Art"}, {"description": "Join Tattered Cover for a special evening with Pulitzer Prize-winning columnist and bestselling author Dave Barry for the release of his newest book Lessons From Lucy: The Simple Joys of an Old, Happy Dog ($26.00 Simon & Schuster). \nFaced with the obstacles and challenges of life after middle age, Dave Barry turns to his best dog, Lucy, to learn how to live his best life. From “Make New Friends” (an unfortunate fail when he can’t overcome his dislike for mankind) to “Don’t Stop Having Fun” (validating his longtime membership in a marching unit that performs in parades—and even Obama’s inauguration), Dave navigates his later years with good humor and grace. Lucy teaches Dave how to live in the present, how to let go of daily grievances, and how to feel good in your own skin. The lessons are drawn from Dave’s routine humiliations and stream-of-consciousness accounts of the absurdities of daily life, which will leave you heaving with laughter and recognition.Laugh-out-loud hilarious, whether he’s trying to “Pay Attention to the People You Love” (even when your brain is not listening) or deciding to “Let Go of Your Anger,” Dave Barry’s Lessons From Lucy is a witty and wise guide to joyous living.\nA limited number of tickets are available now through Eventbrite.\n\n**Important Event and Ticket Information**\n-- Tickets are $26.00 (plus tax and convenience fee), include a copy of  Lessons From Lucy: The Simple Joys of an Old, Happy Dog and a place in the signing line.\n-- Presentation begins at 7:00 pm, signing to follow.\n-- Check in begins at 5:00 pm.\n-- Books can be picked up at check in or prior to the event, starting on Tuesday, April 2, 2019. To pick up your book early, you must show your ticket to the Colfax Reserve desk.\n-- Ticket guarantees you a spot in the signing line, but seating is limited and available on a first-come, first-served basis.\n-- The end time of this event is an estimate.\n-- Event tickets are available online ONLY, through Eventbrite. Tickets will not be sold in-store.\n-- Ticketed customers will be called up to the signing line after the presentation, sequentially by row. i.e. The closer to the front you sit, the earlier you will be in the signing line.\n--If you are unable to attend the event, your book will be held for one month after the date of the event. There is no guarantee the book will be signed if you are unable to attend.\n\n** DISCLAIMER: Event details, signing rules and restrictions are subject to changes beyond our control, and often change up to, and during the event. Thank you for your understanding.\nWhen you purchase a ticket, or register for an event, you will automatically be added to the Tattered Cover's email subscriber list. We will always protect your privacy. Our email list is used only to promote Tattered Cover events and news, and your information will never be shared or sold. You may unsubscribe or update your subscription at any time.\n\n\n", "title": "An Evening with Dave Barry, Book Talk, Presentation, & Signing", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "We invite you to join us on April 6th at Marathon Music Works as we celebrate our beautiful city and raise money for The Oasis Center. The black tie fundraiser will include live entertainment from Bobby & The Aristocats, hors d'oevres, a silent auction and a wide selection of libations for patrons to enjoy. \n \nThe Oasis Center provides a wide range of opportunities that reflect the diverse needs of over 3,000 youth and their families annually. Put simply, The Oasis Center strives to ensure all young people can easily access basic needs: caring adults, a warm bed, hot meals, a safe environment, good health care, an effective education and opportunities to help others.\n\n \nTo learn more about the Oasis Center, be sure to follow them on Facebook and check out their website by clicking here!\n \nShare this event with your friends on Facebook.\nWe hope you can make it!Cheers!\n\n \nFAQs\n \nAre there ID or minimum age requirements to enter the event?\n21+ required for entry with valid ID\n \n\n ", "title": "The Iris Ball", "selectedPreferences": ["Active", "Relaxing", "Active"], "selectedCategories": ["Family", "Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "DOORS: 7:00 PM // SHOW: 8:30 PM", "title": "40 OZ To Freedom (Sublime Tribute Band)", "selectedPreferences": ["Lit"], "selectedCategories": ["Shows", "Nightlife", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "EL EVENTO DE MODA SUSTENTABLE MÁS GRANDE DE MONTERREY", "title": "ECO FESTIVAL-  Fashion & Beauty", "selectedPreferences": [""], "selectedCategories": ["Art", "Shows"], "primaryPreference": "", "primaryCategory": "Shows"}, {"description": "Doors at 7:00pm, Show at 8:00pm. All sales are final.", "title": "Arlo Guthrie", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Art", "Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "Free Show!The premiere Dallas country cover band, Straight Tequila Night, plays all your favorite hits from 90s country radio! Come sing along to the songs of Garth Brooks, George Strait, Alan Jackson, Brooks and Dunn, Tim McGraw, Dwight Yoakam, and more!\nGET VIP SEATING: Enjoy Legacy Hall in style with your very own reserved area. Click this link and fill out the SECOND FLOOR RESERVED AREA section.\nFREE EVENT DETAILS: This is a FREE event, therefore registration does NOT guarantee seating or access to the venue. Seating is first come, first served. Tickets will NOT be collected. PRO TIP #12: Arrive early to popular events as seating may go quickly!\nYOUR VISIT: Is this your first time visiting us? Great! Legacy Hall is an innovative, European-style food hall combining the best elements of a beer garden, craft brewery and live entertainment venue. You’ll love the three-story, 55,000-square-foot space featuring more than 20 curated restaurant stalls offering flavors from around the world. Plus, the Box Garden which is the Hall’s expansive outdoor entertainment venue, where guests sing along to live music, watch movies, cheer on live sports broadcasts and more. To learn more, visit www.legacyfoodhall.com or call (972) 846-4255. Get social with Legacy Hall (@legacyfoodhall) on Facebook, Instagram and Twitter.", "title": "Straight Tequila Night (90s Country Covers)", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Free", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "GaPQC Annual Meeting\nThursday 4.25.19 from 8 am - 5 pm* and Friday 4.26.19 from 8 am - 3:30 pm\n\n           \n\n\n                       Register Soon!  Registration ends Thursday, April 18, 2019.\n\n\n\n\nGaPQC\nJoin GaPQC for our 2nd Annual Conference, featuring nationally recognized leaders in perinatal quality improvement, as well as local experts, to join the conversation about the issues impacting Georgia and initiatives within the state. Topics covered include AIM Maternal Safety Bundles, Maternal Mortality, Pregnancy-Related Cardiac and Hypertensive Conditions, Maternal Substance Use Disorder, Health Equity, Neonatal Abstinence Syndrome, and Stories from Survivors.\nTarget Audience\nHealthcare providers and staff who are interested/participating in QI implementation, public health providers, community advocates, or anyone interested in issues impacting perinatal outcomes.\nAgenda/Schedule\nAgenda/Schedule for this event is attached to the initial email invite.  \n\nLOCATION AND ROOM BLOCK INFORMATION\nDoubleTree by Hilton  •  Atlanta Perimeter Dunwoody  \n4386 Chamblee Dunwoody Rd  •  Atlanta, GA 30341  •  770.457.6363\nA limited number of rooms have been blocked for this event.  Rooms book quickly, so make your reservations, today.  Room block rates have been discounted to $119/night excluding taxes.  Special room rates are available until April 4, 2019, or until room block is full.  Please contact DoubleTree and ask for the \"2019 Dept of Public Health Meeting\" room block. \nOr click directly via booking link:\nhttp://group.doubletree.com/2019deptofpublichealthmtg\nDoubleTree by Hilton Hotel features:\n\n100% Non-Smoking Rooms & Suites\nComplimentary Wi-Fi throughout the hotel\nComplimentary Shuttle Service within a 5-mile radius of the Hotel\nComplimentary Self-Parking\n250 newly renovated guest rooms and suites\nFull-Service restaurant open for Breakfast, Lunch & Dinner\nRoom Service\nCoffee makers in each room\nHeated outdoor pool\n\n\nALTERNATIVE HOTELS (no room block available at these locations)\nSonesta ES Suites Atlanta Perimeter Center East\n\n1901 Savoy Dr, Chamblee, GA 30341 • (770) 455-4446\n\nhttps://www.sonesta.com/us/georgia/chamblee/sonesta-es-suites-atlanta-perimeter-center-east\n\n\nHilton Garden Inn Atlanta Perimeter Center\n\n1501 Lake Hearn Dr NE, Atlanta, GA 30319 • (404) 459-0500\n\nhttps://hiltongardeninn3.hilton.com/en/hotels/georgia/hilton-garden-inn-atlanta-perimeter-center-ATLPHGI/index.html?SEO_id=GMB-HI-ATLPHGI\n\n\nWHAT ARE MY PARKING OPTIONS?\nComplimentary Self Parking is available in both the front and back of the hotel.\nWHAT ARE MY PUBLIC TRANSPORTATION OPTIONS?\nThe closest MARTA station to the hotel is the Chamblee Marta Station.  Take an Uber or a Lyft directly to the hotel from Chamblee Marta Station.\nTHINGS TO NOTE\nRegistration will begin at 8:00 AM with a continental breakfast and networking opportunities with vendors and attendees.  Breakfast, snack breaks, and lunch will be provided both Thursday and Friday.\n*An evening networking reception will be held Thursday evening from 5:30 pm-7 pm in the hotel lounge area with heavy hors d'oeuvres & a cash bar.  This opportunity is available on a first-come-first-serve basis to the first 75 attendees that register for the evening networking option.  No additional charge for this option.", "title": "GaPQC 2019 Annual Meeting:       2 Day Event (4.25-4.26.19)", "selectedPreferences": ["Active"], "selectedCategories": ["Family", "Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "Join us as we go Back to Basics!", "title": "2019 School Nurse Conference: Back to Basics", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "Indoor space so we will be there come rain or shine!!\r\nThe TVCC Auxiliary is excited to be sponsoring a free Family Fun Day for all TVCC clients and their families!\r\n What is Family Fun Day?\r\nThis day is an opportunity to meet and connect with other Thames Valley Children's Centre client families and have some FUN! There will be a chance to enjoy some adapted sport activities, games, crafts, games, face painting, complimentary cotton candy, popcorn, snow cones and more.\r\nStar Wars characters, princesses and action heros will be there too! New friends will be made, memories will be created and laughter and giggles will fill the Carling Heights Community Centre. Help us spread the word!\r\nCheck out the Youth Zone. There's something for everyone!\r\n\r\n \r\n \r\n \r\n \r\n ", "title": "Family Fun Day for TVCC Families", "selectedPreferences": ["Relaxing", "Active"], "selectedCategories": ["Family"], "primaryPreference": "Active", "primaryCategory": "Family"}, {"description": "A moving drama based on the gospel of John and Leonardo da Vinci’s famous painting, “The Last Supper.”\nTICKETS ARE FREE\nSunday Matinée - April 14, 2:00 p.m.Tuesday, April 16, 7:00 p.m.Wednesday, April 17, 7:00 p.m.Thursday, April 18, 7:00 p.m.", "title": "The Living Last Supper", "selectedPreferences": ["Relaxing", "Cultural"], "selectedCategories": ["Art", "Free", "Family", "Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "You're invited to Opening Day for PASSION: 50 Years of BMW Cars & Community!\nThe year 2019 marks 50 years of the BMW Car Club of America, and five decades of the BMW enthusiast experience on our shores. So let's get this party started!\nPASSION brings together five decades of legendary machines, and stories of the people who made the BMW scene what it is today. It's an all-out celebration of the enthusiast experience...and that means you are an important player in the show.\nAnd...heiliger strohsack...the cars! We've got 22 pristine examples of the cars you wish you owned…or still owned. These are the machines that dominated each of the five decades since 1969, and defined the aspirations of the BMW brand, and the fans. From Bobby Rahal's Inka 2002, to the angled anger of the M1, to the Euro-only M5 Touring, you'll see a room full of the very best BMWs in the world. \nBut we don't stop with stock. After all, PASSION is a celebration of the enthusiast. And enthusiasts like to...how do we put this...make changes. So you'll see the Active Autowerke M3 that won its class in the 2008 One Lap of America. You'll see incredible creativity and workmanship from the best home garages. And the rumors are true...you'll see the famed Rusty Slammington, straight from the West Coast and perhaps the most-Googled BMW of the last decade. It's an absolute monster, and you don't want to miss it.\nPASSION launches to the public on May 20, and runs through January 17, 2020. But you've got the opportunity to see the show three days early, on Friday, May 17...IF you act quickly and buy your tickets on this page.\nThe May 17 Opening Day celebration will feature;\n- Multiple celebrity speakers\n- Multiple give-aways from your exhibition sponsors (including valuable sets of tires)\n- A free exhibition collectible for every guest\n- Music, food trucks, and general opportunities to mess about and enjoy yourself\nAnd of course, PASSION exhibition books, posters and merchandise will all be available to feed your unhealthy obsession.\nPASSION: 50 Years of BMW Cars & Community is presented by Tire Rack and Yokohoma, and generously supported by Active Autowerke, Classic BMW, Dinan, Kelly BMW, Odometer Gears, CocoMats / Furstil, Otto’s BMW, and TC Kline Racing.\n_____________________________________\nWe're charging $25 per person for this experience ($10 for kids).  Here's why. Your BMW CCA Foundation is a nonprofit organization, and exists only through the generosity of its donors. Your admission fee will help to sustain the CCA Foundation Museum & Archive, and it will also help fund Tire Rack Street Survival, a national car-control training program for teenage drivers.  \nYou'll leave with something cool. Your admission fee includes a special PASSION collectible for you to take home. You'll love it...promise.\nFood Trucks will be serving up lunch onsite. Between 11:00am and 2:00pm, you will have the ability to purchase lunch from top-quality food trucks parked onsite (lunch is not included in your admission fee).  There are also several restaurants located at exits 63 and 54 on Interstate 85.\nThis place is worth seeing.  The BMW CCA Foundation Museum & Archive is located just 50 minutes south of the Vintage host hotel, directly next door to the BMW Performance Center, and across the street from BMW's largest manufacturing center. The Museum & Archive currently preserves about 45,000 BMW-related items, from rare cars to engines to art. It's the largest such collection in the Americas.  And if you're a member of the BMW Car Club of America, it's all here for you.\n_______________________________________\nFAQs\nYou're charging admission for this event.  Where does my money go?\nYour admission fee will be used to operate your BMW CCA Museum & Archive, the largest in the Americas.  It will also help to support Tire Rack Street Survival, a nationwide car-control clinic for teenagers.  And finally, your admission charge covers the cost of a special item you'll receive when you're here.  Last year, the Foundation, our volunteers and supporting organizations trained more than 2,800 young drivers.  The Foundation's programs are donor-supported.  They don't happen without you, so we're grateful for your support! \n\nIs there an age limit to enter the event?\nAll are invited.  There is no age limit for this event.\n \nWhat are my transport/parking options getting to the event?\nWe've got the only building on our street. We have plenty of parking all around our building, on the street, and you are welcome to park on the grass. We will have volunteers here to show you where you can park.\n \nWhat can/can't I bring to the event?\nBring your enthusiasm and love for the marque!  And bring your cameras...you are welcome to take all the photographs and video you want.  Pets may be brought to the property, but they will not be allowed inside the building.\n \nIs this event registration separate from my registration for The Vintage?\nYes. On this page, you will only register for the BMW CCA Foundation's PASSION exhibition on Friday, May 17. You do not have to be registered for The Vintage to attend the PASSION opening event. To register for The Vintage event on Saturday, May 18, 2019 in Hot Springs NC, please visit www.atthevintage.com.\n\nWhere can I contact the organizer with any questions?\nFor The Vintage: contact Scott Sturdy at scottsturdy@yahoo.com or visit www.atthevintage.com.\nFor the Foundation's PASSION Exhibition: contact us at 864.329.1919. You may also send an email to info@bmwccafoundation.org.\n \nIs my registration/ticket transferable?\nYes.  Just make sure to give us the name of the new registrant, so we can put them on the list.\n \nCan I update my registration information?\nYes, please contact us using the phone number or email above.\n ", "title": "PASSION: 50 Years of BMW Cars & Community", "selectedPreferences": ["Active", "Relaxing"], "selectedCategories": ["Shows", "Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": null, "title": "DON'T YOU DO THIS TO ME TOUR/ BATON ROUGE LA", "selectedPreferences": ["Relaxing", "Active"], "selectedCategories": ["Art"], "primaryPreference": "Active", "primaryCategory": "Art"}, {"description": "Will Week 2019", "title": "Will Week 2019", "selectedPreferences": [""], "selectedCategories": ["Family"], "primaryPreference": "", "primaryCategory": "Family"}, {"description": "The 20th Annual Denver Career Fair - Premier Sales & Professional Job Fair\nJune 19, 2019 at the DoubleTree Denver - Denver Tech Center.\n \nMeet, sit down and interview with Nationally Known employers at Denver Career Fair and Job Fair - Premiere Sales & Professional Career Fair.  Professional Dress (suit & tie or business suit) Bring plenty of resumes. \n \nIndustries represented at our Career Fairs:   Sales,  Inside Sales, Outside Sales, Retail Sales, Financial, B2B Sales, Customer Service, Healthcare Sales, Entry Level Management, Consulting, Customer Service, Security Sales, Pharmaceutical Sales, Recruiting, Insurance, Marketing Sales, Sales Management, Medical Device and more... \n__________________________________________________________________________\n20th Annual Denver Career Fair & Job Fair - Sales & Professional Job FairWednesday - June 19, 201911:30 AM to 1:30 PMDoubleTree Denver Tech Center 7801 E Orchard RdGreenwood Village, CO 80111\nNote: Eventbrite Map may not be correct \n\n*Come with your Eventbrite ticket for 1st admission\n\n** EMPLOYERS: Please Contact us for Best Rates / DCG Career Fairs\n \nBenefit packages at The Denver Career Fair & Job Fair vary by company, most include a combination of the following : \n \nCorporate Benefits Packages: Salaried PositionsBase Salary + Positions BonusesCommissionCar or Car AllowanceCell/LaptopFull Medical/Dental/VisionLife InsurancePaid HolidaysExpense AccountComplete Corporate TrainingCollege Tuition ReimbursementManagement TrainingRapid Career Advancement\n \n*Free Attendance and Parking for Candidates at the Denver Career Fair and Job Fair - Open to all candidates! \n \n **Be prepared to interview with hiring managers and recruiters, Professional Dress (suit & tie or business suit) required. Bring plenty of resumes. \n \nEMPLOYERS:\nHundreds of Denver's Best and Most Qualified Candidates Attend The Denver Career Fair Every Year. Please contact us for Special Discount Rates to participate.\nwww.diversitycareergroup.com\nor\nRequest Employer Pricing Information\nINDUSTRIES THAT HIRE AT OUR CAREER FAIRSAccommodations, Accounting, Advertising, Aerospace, Agriculture & Agribusiness, Air Transportation, Apparel & Accessories, Auto, Banking, Beauty & Cosmetics, Biotechnology, Chemical, Communications, Computer, Construction, Consulting, Consumer Products, Education, Electronics, Employment, Energy, Entertainment & Recreation, Fashion, Financial Services, Fine Arts, Food & Beverage, Green Technology, Health, Information, Information Technology, Insurance, Journalism & News, Legal Services, Manufacturing, Media & Broadcasting, Medical Devices & Supplies, Motion Pictures & Video, Music, Pharmaceutical, Public Administration, Public Relations, Publishing, Real Estate, Retail, Service, Sports, Technology, Telecommunications, Tourism, Transportation, Travel, Utilities, Video Game, Web Services\nKey Words: Account Executive, Sales Representative, Account Manager, B2B, retail sales, furniture, sales, financial services, customer service, Business Development Manager, Sales Manager, Financial Services, Insurance, Telecommunications, Pharmaceutical, Hospital Representative, Medical, Marketing, Advertising, Healthcare, office equipment, Telecom, Information Technology, Software, Security Services, Advertising, Payroll, Sales Management, Sales Trainee, Management Trainee, At home sales, cold calling, telemarketer, telemarketing, financial advisor, insurance sales, outside sales, outside sales representative, sales executive, salesman, salesperson, sales women, marketing", "title": "Denver Career Fair & Job Fair June 19, 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "FREE TICKETS!\nTHE FRESH DRUNK STONED COMEDY TOUR is coming to the HOUSTON IMPROV!!!!\nThis triple Headliner show featuring Franco Harris, Matt Bellak, and Tim Hanlon brings you an unapologetic, irreverent humor. In a showcase style performance, you will get three different perspectives and a night full of laughs. So kick back, relax, stay fresh, enjoy a drink and have a smoke!\nFREE TICKETS!\nFREE TICKETS ARE FIRST COME FIRST SERVE. PLEASE ARRIVE 30 MINS BEFORE SHOW TIME TO GUARANTEE SEATING OR YOUR SEAT WILL BE GIVEN TO THE NEXT AVAILABLE GUEST.\n** Two Item Minimum **There is a two item minimum purchase per person in the showroom.If you do not choose to order anything you will be charged a $4 surcharge per item not ordered.\nwww.freshdrunkstoned.com\nDOORS OPEN at 7:00pm\nSHOW STARTS at 8:00pm\nFREE TICKETS!\nFACEBOOK PAGE REVIEWS FOR OUR SHOW!\nAngela Bruno Santas reviewed The Fresh Drunk Stoned Tour — 5 star ·\nThese guys were hilarious!! We loved them all. They kept it real, raw and vulnerable. It was a night we won't soon forget. We would definitely love to see them again. From the laughs at Dead Crow Comedy Club, the whole crowd want to see them back again soon. #watchoutforthestonedhippyladies\nStephanie Batte reviewed The Fresh Drunk Stoned Tour — 5 star·\nMy face hurt from laughing. Drove 2 hrs just to see them. SOOOO worth it! #looselyspeaking#stalker#F%$KHondas!!! ���� can’t wait to see you guys again\nTarah reviewed The Fresh Drunk Stoned Tour — 5 star\nSaw the show tonight at the Tempe improv and it was excellent! Highly recommend\nRandy reviewed The Fresh Drunk Stoned Tour — 5 star\nThis show was amazing def would watch them again next time there in Florida!!\nJustin reviewed The Fresh Drunk Stoned Tour — 5 star\nGreat group of up and coming comics with a fresh outlook on life. Laughed so hard i was on tears!\nJeremy reviewed The Fresh Drunk Stoned Tour — 5 star·\nWent with a group of friends to the late show Saturday night at Funky Buddha... had a great time!! All the comedians were fantastic, but Matt Bellak was the favorite from a lot of our group!! Hope you all find tons of success and next time you're in Florida or we're in Chicago, we'll definitely be checking you out!", "title": "FREE TICKETS! HOUSTON IMPROV 4/15 Stand Up Comedy Show", "selectedPreferences": ["Relaxing", "Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "\r\nThe Wild West Brewfest - \r\nAwarded the #1 Event in North America by BeerYeti.com\r\nHere is your opportunity to taste some great beers - listen to some fantastic bands - eat some terrific foods from the top food trucks around and hang out with your friends in our multiple party zones all while giving back to our community!  \r\n \r\nOver the past 7 years the WWBF has given back over $700,000 to charities thanks to you!  Come find out why we have been awarded #1 in North America!\r\n Saturday April 27 2019\r\nVIP opens at 2PM\r\nGA opens at 3PM\r\nEvent ends at 9PM\r\nLimited number of tickets will be sold!\r\nWhat you can expect:\r\nBenefiting many Katy and surrounding area non-profits - staffed by 100% volunteers, and we give back 100% of the net profits and we take no fee from the event!  \r\nOnly one of its kind in Katy, TX - and one of the largest in the country!\r\nOver 100 Specialty Craft Brewers bringing 600 individualized beers!\r\nMultiple bands to keep you entertained during the day UNDER SHADE! \r\nVIP ticket holders gain admission at 2 pm\r\nGeneral Admission opens at 3 PM\r\nLaunch Party will be held April 26, 2019, 7-10pm - buy a combo ticket for the best deal and stay at one of the hotels for ease of access!  \r\nSpecial rates for WWBF patrons.  Why drive when you can WALK! Location = Katy Mills Mall\r\nHop House over 11,000 square feet of climate controlled shear beer nirvana WITH OVER 40 TAPS AND OVER 20 PACKAGED PRODUCTS!  \r\nLimited ticket sales - GET YOUR TICKETS TODAY! VIP will sell out!Event is Rain or Shine!\r\n\r\nWe will have some special things on tap for this party that we did not have for 2018, stuff that you will have a hard time finding anywhere else in the city! \r\nDONT LET THE PARTY STOP!!! \r\nJoin us for our first ever Wild West Brew Fest AFTER PARTY! Just when you think the fun is done, our After Party begins at 9p. Whiskey River DJ's take the stage and will warm you up. \r\nBart Crow takes the stage from 10-11:30. Be sure you purchase your ticket ahead of time and add a few drink tickets to your After Party experience. Tickets to the After Party are just $10 and drink tickets are only $5 for FULL POURS! \r\n Remember, last call is at 11:30 so get your drink tickets early!\r\nFor more information visit      wildwestbrewfest.com\r\n\r\n\r\n\r\n \r\n\r\n \r\nFAQs\r\n \r\nHow can I contact the organizer with any questions?\r\nYou can find most answers on our website:  www.wildwestbrewfest.com , including questions about sponsorship, if your a brewer or want to participate as a vendor.\r\n ", "title": "Katy Wild West Brew Fest 2019", "selectedPreferences": ["Relaxing", "Lit"], "selectedCategories": ["Nightlife", "Food&Drink"], "primaryPreference": "Lit", "primaryCategory": "Food&Drink"}, {"description": "Armisen (Saturday Night Live, Portlandia) mixes comedy & music in his patented hilarious, offbeat way.", "title": "Fred Armisen: Comedy for Musicians but Everyone is Welcome.", "selectedPreferences": ["Lit", "Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "MTAC (Middle Tennessee Anime Convention) is an annual convention that produces events related to Anime, Manga, and relevant Popular Arts, providing enthusiasts and the public at large with a forum for patronage and education thereof. Established in 1999, MTAC has been a steadily growing, annual event based in Nashville, Tennessee.\n\nGeneral memberships do not include mailed badges, only mailed option.  Mailed option cannot be added after initial purchase. All sales are final, chosen days of purchase cannot be transferred, unless upgrading while at the event. Memberships can be transferred to another individual on or before April 18th, 2019. Memberships cannot be transferred to a future year.\n\nBy purchasing a membership, you agree to abide by the rules and regulations listed at http://mtac.net/rules/. ", "title": "MTAC Lunar", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": " 64th Annual Texas Electric Power Conference\r\n \r\nNew Braunfels Civic Center\r\n375 S Castell Ave.\r\nNew Braunfels, Texas 78130 \r\nApril 3rd - 5th, 2019\r\n \r\nPurpose of Conference\r\nThe Texas Electric Power Conference is primarily an operations conference targeting linemen, technicians, superintendents and operations engineers/managers. The conference combines equipment and safety presentations for the participant to utilize in their daily operating environment. The conference is open to personnel from all electric utilities – municipals, cooperatives and investor-owned. Utility contractors will also find the conference beneficial in their daily operations. Manufacturers’, Suppliers’, Distributors’ and Vendors’ support and participation is appreciated.\r\n \r\n \r\nConference Golf Tournament\r\nLanda Park Golf Course\r\n180 Golf Course Dr.\r\nNew Braunfels, Texas 78130\r\nWednesday, April 3rd\r\n11:30 A.M. —1:00 P.M. Practice and Lunch\r\n1:00 P.M. Shotgun Start\r\nMeal and prizes following at the Golf Course.\r\n \r\nConference Schedule:\r\nThursday, April 4th\r\n8:00 A.M. to 9:00 A.M. Registration\r\n9:00 A.M. to 4:30 P.M. Presentations\r\nVendor Show will be held from 11:00 A.M. to 1:30\r\nLunch Provided during Vendor Show\r\n \r\nFriday, April 5th\r\n8:30 A.M. to 12:00 P.M. Presentations\r\n Topics for the 2019 Conference\r\n LCRA Flood Gate Operations\r\n Why do my Pole Lean\r\n Regulatory Updates\r\nHandling difficult customers and their dogs\r\nClosing Presentation Friday\r\n \r\nHotel Information (Mention Texas Electric Power Conference)\r\nLaQuinta Inn – $92.00     830-627-3333\r\nCountry Inn & Suites or Candlewood Suites - $75.00     830-387-4014\r\nSleep Inn & Suites - $62.00 Single and Doubles     830-625-7700 (online link) http://www.sleepinn.com/ires/en-US/html/ArrivalInfo?hotel=TX932&srp=LTXEPC&pu=no\r\nHoliday Inn Express - $94 Kings $99 Double Queens     830-626-1234\r\nQuality Inn & Suites - $59.00     830-643-9300\r\nCourtyard River Village - $109- $129 (Online link) Book your group rate for Texas Electric Power Conference \r\nFairfield Inn & Suites $89 to $109 (online link) Book your group rate for Texas Electric Power Conference \r\n For more information about hotels contact:\r\nJon Blalock 979-764-5026 \r\n \r\n \r\nTexas Electric Power Conference Planning Committee\r\nDavid Baker, Chairman, City of Hondo\r\nTodd Craven, Guadalupe Valley Electric Cooperative\r\nJon Blalock, Treasurer, City of College Station\r\nJason Lange, Secretary, City of Brenham\r\nBobby Christmas, Guadalupe Valley Electric Cooperative\r\nDarrell Clifton, CPS Energy\r\nKyle Dicke, M&S Engineering\r\nJohn Green, Retired, New Braunfels Utilities\r\nDon Bolenbarr, Retired, City of Brenham\r\nTony Michalsky, Retired, Ctiy of College Station\r\n \r\n\r\nFAQs\r\nIs my registration/ticket transferrable?  Yes\r\nDo I have to bring my printed ticket to the event?  Yes\r\nWhat is the refund policy?  Yes\r\nThe name on the registration/ticket doesn't match the attendee. Is that okay? Yes, please notify organizer and write correct name on registration form.", "title": "Texas Electric Power Conference 2019", "selectedPreferences": [""], "selectedCategories": ["Professional"], "primaryPreference": "", "primaryCategory": "Professional"}, {"description": "{Every Saturday}\n\nDFW Upscale | iLyke2parti.com | Crown Holders |presents......….I Love Day PartiesThe Checks Over Stripes \n@ Level Dallas3005 Routh StDallas, TX3PM - 8PM::: Enjoy :::*Complimentary Admission w/ RSVP (YOU Must RSVP to enter)*Main Room Lounge*Patio*Hookahs Available*Valet Parking*$7 Crown and Down before 5:30pm*Discounted bottle service before 5:30 ($200 Titos and $100 Moet)RSVP to www.leveldayparty.eventbrite.comTable Reservations & Early Arrival is Highly Recommended:Chris Stribling 972.365.1364 or Kevin Soward 972.748.7948Powered By:DFW Upscale | iLyke2parti.com | Crown Holders |", "title": "I Love Day Parties The Checks Over Stripes Edition @ Level ", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "PLEASE READ BEFORE REGISTERING!In an effort to keep the registration and count accurate we are asking for attendees to ONLY register for the people in your household. Please register each person with their own name but you can use the same email address multiple times if needed. Please check with your spouse to see if they have registered before you register and if you don’t receive a confirmation email from Eventbrite please contact our office at (423) 478-3456 or by email at aanderson@voe.org to see if your registration went through. DO NOT register multiple times until you receive a confirmation email. Thank you for your cooperation!", "title": "2019 International Campmeeting", "selectedPreferences": ["Active"], "selectedCategories": ["Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "Flite Fest 2019Over the years Flite Fest has become a massive success making our festivals one of the largest gathering of radio control pilots in the world. With 2,500 pilots and 10,000 attendees coming to our festivals, we couldn't be more proud of how they all represented the regions they were in!\nFlite Fest OhioOur Ohio event is being held again at Furey Airfield, the home of our very first Flite Fest in 2014. \nCampingYou can also register here for camping. We have RV Camping and Tent Camping options. The camping registration is not per person but it is per camping spot.  You will be assigned to a specific camping location once you check in at the registration tent. These spots are first come first served so the sooner you confirm your ticket, the more central your location will be. The Tent Pass and RV Pass DO NOT include your Pilot and/or Spectator Pass.\n", "title": "Flite Fest Ohio 2019", "selectedPreferences": ["Active", "Active"], "selectedCategories": ["Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "The 7th Annual Flagstaff Blues and Brews Festival is almost here!\r\nFriday June 7th from 2:30 pm to 9 pm\r\nSaturday June 8th from 11 am to 8 pm\r\n  The festival will feature live blues music, craft beer, a vendor garden, delicious food, a kids area, and onsite parking.   Limited handicap parking is available.    \r\n \r\nThe Friday festival lineup will include: \r\nTab BenoitLarkin PoeCarvin JonesInnocent Joe and the Hostile Witnesses\r\n The Saturday festival lineup will include: \r\nKenny Wayne Shepherd BandSamantha FishJeremiah Johnson BandCurley Taylor and Zydeo TroubleBeverly “Guitar” Watkins and the RD Olson Blues BandArizona Hired Guns\r\n \r\nTICKET INFORMATION:\r\nOnce you purchase, you will receive an order confirmation email from Eventbrite on behalf of Flagstaff Blues and Brews Festival.\r\n\r\nIf you do not see your order confirmation in your inbox, make sure to check your junk/spam folder.\r\nIf you do not see your order confirmation in your inbox, click here to access the Eventbrite help center.\r\nLimited number of tickets in each price category. Price may change without notice.\r\n\r\nIf you are having technical ticketing-related issues with your order, click here to contact Eventbrite. \r\nFor non-technical ticketing questions and general festival info, click here.\r\nHave questions about Flagstaff Blues and Brews Music Festival 2019? Contact Us\r\nProceeds benefit: Flagstaff Arts and Leadership Academy\r\nAll sales final. No refunds or exchanges. Event is rain or shine. Artists subject to change.\r\n \r\nFAQs\r\n \r\nWhat's the refund policy?\r\nNO REFUNDS. ALL SALES FINAL. \r\n \r\nDo I have to bring my printed ticket to the event?\r\nYes and no. Yes unless you can pull up your ticket on your mobile device.\r\n \r\nIs it ok if the name on my ticket or registration doesn't match the person who attends?\r\nYes", "title": "Flagstaff Blues and Brews Festival", "selectedPreferences": ["Active"], "selectedCategories": ["Nightlife", "Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "Hop on board of a hayride to the Magic Forest and hunt for Easter Eggs in the wonderful woods.\nExchange your eggs for tasty treats, enjoy the great outdoors and snap a family photo. Enjoy racing around on our pedal tractors, bouncing on hop balls and getting up close personal with some of our friendly farm animals. \n\nEaster egg hunts begin once an hour. Tickets are purchased for 1 time slot only. Be sure to not miss it! Tickets are required for all participants.\nPurchase a family ticket and save!\n", "title": "Easter Egg-Stravaganza ", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "Classic Rock Meets Classic Country: Steve Miller Band & Marty Stuart & His Fabulous Superlatives", "title": "Classic Rock  Meets Classic Country: Steve Miller Band and Marty Stuart", "selectedPreferences": ["Relaxing", "Relaxing"], "selectedCategories": ["Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "Zeeland Christian Preschool Registration Official Site \r\n*Password will not be need after 7pm on Thursday, January 31*To register your child for Zeeland Christian Preschool, please select a \"seat\" for your child in the class of your choosing and click Register.  Once you enter the registration form, your spot is secure.  You will have 15 minutes to complete the registration form, and then you will receive a confirmation of your registration.\r\nIf your preferred class no longer has tickets available, that means the class is full.  Please register for your second or third choice. If you would like to be added to the waitlist for your first and/or second choice, please send an email to waitlist@zcs.org with your name and your first choice.  (Ex: My name is Mary Smith.  My child, Jack, is currently enrolled in Session 7.  Please add him to the waitlist for Session 6.)  You will be added to the waitlist in the order in which we receive the emails.\r\n \r\n2019-2020 Tuition Rates:\r\n2 Day: $1040\r\n3 Day: $1,456\r\n4 Day with 1 afternoon: $2,688\r\n4 Day with 2 afternoons: $3,328\r\n4 Day with 3 afternoons: $3,968\r\n4 Full Days: $4,608", "title": "Zeeland Christian Preschool Registration 2019-2020 ", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSATURDAY April 6th 2019 \n\nCHINGY & FRIENDS \n\n\n\n\n  Concert after party \n\n\n\n\n\n\n\nDOORS OPEN AT 10PM\nEVERYBODY FREE ALLNITE W/ RSVP\n\nRSVP AT EVENTBRITE \nAFTERPARTYLITLOUNGESATURDAY.EVENTBRITE.COM\n\n\n\n\n\nLIT LOUNGE \n6736 N TRYON ST \nCHARLOTTE,NC \n\nINFO OR TABLES 704.582.2452 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "title": "CHINGY & CELEBRITY FRIENDS  CONCERT AFTER PARTY", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Béla Fleck and the Flecktones feat. Victor Wooten, Roy \"Futureman\" Wooten and Howard Levy at Tower Theatre in Oklahoma City on June 24.", "title": "Béla Fleck and the Flecktones", "selectedPreferences": ["Relaxing", "Lit"], "selectedCategories": ["Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "Conference on April 12 ---\nTraining classes on April 10th & 11th", "title": "BSides Oklahoma 2019", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "Visit www.railsconf.com for details!\r\nView our conference terms & conditions regarding privacy and data here.", "title": "RailsConf 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "\nYou Have a Place Here. The Mountain is Calling. \n\nBackwoods at Mulberry Mountain returns for 2019 with new summer time dates! Backwoods is a 3 day, 4 night camping and music festival held on the top of a mountain in the middle of the Ozark National Forest in Arkansas. Warmer weather dates means more summer fun like cooling off in the streams and rivers high in the the Ozark National Forest. \n\n\nNew stage designs, more jam and bluegrass, and the bass heavy electronic you've come to wobble to will help make this the best festival yet. We've increase the amount of art in the Nirvana Woodlands this year and brought back some of the original stage designers and builders from 2015 and 2016.  This year three main stages will host over 150 musical artists throughout the weekend.\nMore upgraded camping with electric and water will be available this year and vendor row will be adjusted to line the main concrete path in one long \"Shakedown Street.\"\n\n\nThe event is known for it's attention to creative production, art installations, and unique visual performers.  Guests are immersed in 360 degree artistic stage performance environments providing a one-of-a-kind festival experience. Helicopter rides, waterfall hikes, and other fun activities during the festival provide unique experiences had no-where-else.  \n\n\nNew experiences await you on the Mountain this coming summer...\n\nRemember:  Only buy tickets from this official page, or by navigating to BackwoodsMusicFestival.com to prevent fraud and ensure your tickets will be valid for the event.  This is a rain or shine event.  All sales are final and no refunds are provided once a purchase is made.", "title": "Backwoods at Mulberry Mountain 2019", "selectedPreferences": ["Relaxing", "Active"], "selectedCategories": ["Sports", "Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "AGES 18+ TO ENTER WITH VALID IDAGES 21+ TO DRINK WITH VALID IDNO REFUNDS | ALL SALES FINALNo Cameras or Recording Devices Allowed.Event may contain strobe lighting, fog, and other special effects.NO REFUNDS | ALL SALES FINALANY & ALL FREE/RSVP/GUESTLIST/CONTEST WINNERS Tickets cut off at midnight. If you are in line when the clock turns midnight, you will have to purchase a ticket from the box office.Doors open at 10pm and Lines can be long, so we recommend showing up as soon as possible to ensure entry.Tickets: After completing your purchase on Eventbrite, you will receive an email confirmation with your attached PDF ticket(s). You MUST print and bring your PDF tickets AND VALID PHOTO IDENTIFICATION to be admitted for the event. You may download the Eventbrite app and show your ticket on your mobile device for entry in lieu of printing.NightCulture Ticketing Policy: Tickets can be transferred between patrons at their own risk. If a transferred ticket does not scan, proof of purchase will be required to redeem the ticket. Acceptable Proof forms: Legal, Valid Government ID. NightCulture cannot be held responsible for any issues that arise with a transferred ticket.Ticketing Related Issues can be directed to: Tickets@NightCulture.comTICKET REMINDER: To ensure your satisfaction, NightCulture cannot guarantee tickets purchased from un-authorized 3rd party resellers (individuals or brokers). We recommend that you purchase tickets directly through Nightculture.com, eventbrite.com, our authorized partners, and the venue box offices. Questions: tickets@nightculture.comFor more information visit nightculture.com", "title": "Vini Vici - Dallas", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Engineering Honors is pleased to invite faculty, staff, and students (undergrad and grad) to a Distinguished Lecture.\nBefore and after the talk is a reception with the speaker and the Texas A&M Grand Challenge Scholars Program (GCSP) research symposium. This is a great way to promote the Texas A&M GCSP to students (more information can be seen here: https://engineering.tamu.edu/student-life/gcsp/index.html)\nBelow is the program:\n• 5:30 - 6:00 p.m. — GCSP Poster Presentations | ZACH Atrium\n• 6:15 - 7:15 — Distinguished Lecture: Dr. Robert E. Skelton | ZACH 297-299\n• 7:30 - 8:00 — GCSP poster presentations and meet-and-greet\n*For Engineering Honors students, you can earn an EH activity credit by attending both the lecture and one of the poster presentations, either before or after the lecture.\nAbout the Distinguished Lecture\nFor more than fifty years, Robert E. Skelton’s research has focused on integrating system science with material science to create new material systems. His contributions to innovative engineering serve humankind in outer space and on Earth. Skelton joined the faculty at Purdue University in 1975, where he served for twenty-one years as a professor of aeronautics and astronautics. In 1996, Skelton moved to the University of California, San Diego (UCSD), where he founded the university’s Systems and Control Program and became director of UCSD’s Structural Systems and Control Laboratory. In 2006, UCSD named Skelton the Daniel L. Alspach Professor of Dynamics Systems and Controls in the Jacobs School of Engineering and professor emeritus in 2009. Skelton joined the Department of Aerospace Engineering at Texas A&M University as a TEES Distinguished Research Professor in 2015.\nTENSEGRITY SYSTEMS: AN INTEGRATION OF MATERIALS, STRUCTURES AND CONTROL EDUCATION\nSkelton recently pioneered the mathematical description of tensegrity structures. Derived by combining “tension” and “integrity,” the term “tensegrity” describes materials composed of strings and rods. His papers have explained the tensegrity nature of the cytoskeleton of red blood cells and of the molecular structure of nature’s strongest tensile material, the spider fiber.\nTensegrity materials can change shape by altering their string tension. This ability to adapt allows tensegrity to produce materials systems that can modify their acoustic, electromagnetic, or mechanical properties. In addition, tensegrity structures may include built-in actuators, sensors, and power-storage devices. This versatility makes tensegrity an attractive alternative to conventional design.\n", "title": "*Engineering Honors Distinguished Lecture & Grand Challenge Scholars Program (GCSP) Symposium Spring 2019*", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "Austin Dance Festival is a three-day dance festival that includes professional dance showcases by modern dance companies from all over the country, artist interviews, master classes with visiting guest artists, community pop-up dances, youth dance concerts, and a Dance on Film screening.\n\nFRIDAY, APRIL 5, 2019\nMASTER CLASSES:\n*****Held at Cafe Dance\nEllen Sickenberger 10:30-12:00pm\nLAJAMARTIN 12:30-2:00pm\nMaster Classes are held at Cafe Dance, 3307-B Hancock Drive, Austin, TX. Each class is $10. Space is limited! Get bios and class descriptions at www.austindancefestival.com.\n \nFRIDAY, APRIL 5, 2019\nDANCE ON FILM\n8pm at AustinVentures Studio Theater in the Ballet Austin building, 501 W. 3rd, Austin, TX.\nDance on Film will screen “Digital Afterlives,” a Finalist for Best Experimental Film at the 2017 SAE Atom Awards in Melbourne and described as \"one of my ABSOLUTE favourite dancefilms of all time (yeah, I said it!)\" by the curator of CAPITOL Dance & Cinema Festival as well as other acclaimed dance films by local and international filmmakers. Vote for the Audience Favorite awards! See the complete line-up at www.austindancefestival.com.\n \nSATURDAY, APRIL 6, 2019\nPROFESSIONAL SHOWCASES\n5pm and 8pm at AustinVentures Studio Theater in the Ballet Austin building, 501 W. 3rd, Austin, TX.\nThere are two completely different curated concerts with performances by some of the best modern dance companies in the country. Showcases are at 5pm and 8pm. After the show, head up to City View Lounge to hear Kate Warren interview the choreographers. Stop by the lobby to buy a t-shirt, bid on the silent auction, make a move for our InstaDance Video, and have a cookie. Each concert is $25 General Admission and $20 Students and Seniors. You can view the complete line-up at www.austindancefestival.com. Can’t decide which one to see? Attend both concerts with the ONE-DAY PASS for $40 and get priority seating.\nWait! Wanna see both professional showcases AND Dance on Film? Buy the TWO-DAY PASS for $50 and get priority seating! BEST DEAL!!!\n \nSUNDAY, APRIL 7, 2019\nYOUTH EDITION CONCERTS\n2:30pm and 5:30pm at AustinVentures Studio Theater in the Ballet Austin building, 501 W. 3rd, Austin, TX.\nThere are two completely different Youth Concerts featuring youth dance companies from all over Texas (and even Alabama!): one at 2:30pm and one at 5:30pm. Not sure which one to see? Check out the line-up at www.austindancefestival.com.Tickets are $10 General Admission and $5 Students and Seniors. Please double-check which concert you want to attend before buying your tickets.\n\nREMINDERS:\nPlease give yourself plenty of time to park. This is downtown Austin, folks! We have all kinds of information on parking and transportation at www.austindancefestival.com\nADA Policy: Please email admin@kdhdance.com for questions or concerns about accessibility. AustinVentures Studio Theater meets ADA requirements.", "title": "5th Annual Austin Dance Festival, April 5-7, 2019!", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Nightlife", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "Please join us on April 6th, 2019 at the Houston Microsoft MTC for our 10th Annual Office 365 Saturday.\nOffice 365 Saturday is an educational, informative and lively day filled with sessions from respected Office 365, Azure, SharePoint professionals and MVPs, covering a wide variety of Cloud-oriented topics. Office 365 Saturday is FREE, open to the public and is your local chance to immerse yourself in cloud technologies!\nOur Keynote Topic will be Lost and Found! Tips for Improving Search and Where It Fits Into the Digital Workplace presented by BAInsights Chief Experiecne Officer, Microsoft MVP, Jeff Willinger.\nLocation:\nHouston Microsoft Technology Center​ located at 750 Town and Country Blvd. Suite 1000, Houston, TX 77402.​\n\nPlease contact Johnny.Lopez@hou365.org or Rick.Garcia@hou365.org for more information.\n", "title": "Houston Office 365 Saturday (Formally SharePoint Saturday)", "selectedPreferences": [""], "selectedCategories": ["Free", "Professional"], "primaryPreference": "", "primaryCategory": "Professional"}, {"description": "Light The Night Community Easter Egg Hunt\nFriday, April 19th at 7:00 pm\nLocation: 3517 W Grand Ave\n\nFree Entrance\n8,000 Eggs\nPrizes\nMultiple Age Groups\nActivities \nGlow In The Dark\nPictures with the Easter Bunny\n\n \nFAQs\n \nWHEN AND WHERE IS THIS YEAR'S EVENT?\nWhere: 3517 W Grand Ave\nWhen: Friday, April 19, 2019 \nDOES MY CHILD NEED TO BE REGISTERED IN ORDER TO PARTICIPATE AT THE EGG HUNT?\nYes, every child must be registered before the event begins. Your child will be given a colored wristband to wear according to their age. Children will not be allowed in the egg hunt area without a wristband.\nI'M PRE-REGISTERED, NOW WHAT?\nFantastic! Print your tickets and arrive to the event early. Look for the pre-registered line and someone will meet you there to get you your colored wristbands. Gate will open at 7pm.\nWHAT IF I PRE-REGISTER MY CHILD AND THEN BRING EXTRA CHILDREN TO THE EGG HUNT?\nAnyone who has not pre-registered will need to stand in line at the event to register. Eventbrite registration will be open the entire time so get on there and register those extra kids to avoid longer lines.\nIS THERE A COST?\nEntrance is FREE. Egg hunt is FREE. Activities are FREE. There is a cost for the snack bar. (CASH ONLY)\nIS THERE A CHARGE TO HAVE YOUR PICTURE TAKEN WITH THE EASTER BUNNY?\nNo, it is free. We will have professional photos taken and uploaded to our Facebook account for you to download. Follow us now on Facebook so you will see the pictures when they get uploaded (usually within 3 days following the event). You may also take photos with your phone.\nWHAT IF IT RAINS?\nRain, Snow or Shine we will be having the egg hunt! If it becomes dangerous weather like lightening we will move the event inside.\nDO WE NEED TO BRING OUR OWN BASKETS TO COLLECT EGGS?\nYou are absolutely welcome to bring your own basket. We will also have plastic bags on hand for children without baskets.\nHOW MANY EGGS ARE THERE?\n8,000!\nWHAT IF MY CHILD DOESN'T GET ANY EGGS?\nAfter each egg drop, there will be a volunteer at the prize table (located inside) with extra eggs for children who did not receive any eggs.\nWHAT IS IN EACH EGG?\nThe eggs will have candy in them. Each age division will have one grand prize ticket inside an egg. Please take the time to check your child's eggs to see if they have won a prize. Take your ticket to the prize table (located inside).\nCAN I KEEP THE EGGS?\nYes! But if for some reason you do not want them, please place them in the recycle bin located near the prize table.\nCAN I HELP MY CHILD AT THE EGG HUNT?\nChildren ages 1-2 and 3-4 years may have one adult help them during the egg hunt. All other parents are asked to stay outside of the roped off area.\nWHAT IF MY CHILD GETS SEPARATED FROM ME?\nWe will have a \"lost parent\" station located at the Prayer Tent. \nWILL THERE BE RESTROOMS AND CHANGING TABLES?\nYes. There are restrooms located inside the building. A changing table is located inside the women's restroom.\nWHERE DO I PARK?\nOur parking lot will be blocked off since we are using it for the egg hunt, but there is street parking (free) and a parking lot across the street that they allow us to use for the event. Look for the parking sign.\nWHO IS HOSTING THIS EVENT?\nPraise Chapel Chicago! We love our community. If you don't have a church home, we would love for you to join us Easter Sunday at 10:00am. \n", "title": "Glow-In-The-Dark Easter Egg Hunt", "selectedPreferences": ["Active"], "selectedCategories": ["Sports", "Family"], "primaryPreference": "Active", "primaryCategory": "Family"}, {"description": "\nYou Have a Place Here. The Mountain is Calling. \n\nBackwoods at Mulberry Mountain returns for 2019 with new summer time dates! Backwoods is a 3 day, 4 night camping and music festival held on the top of a mountain in the middle of the Ozark National Forest in Arkansas. Warmer weather dates means more summer fun like cooling off in the streams and rivers high in the the Ozark National Forest. \n\n\nNew stage designs, more jam and bluegrass, and the bass heavy electronic you've come to wobble to will help make this the best festival yet. We've increase the amount of art in the Nirvana Woodlands this year and brought back some of the original stage designers and builders from 2015 and 2016.  This year three main stages will host over 150 musical artists throughout the weekend.\nMore upgraded camping with electric and water will be available this year and vendor row will be adjusted to line the main concrete path in one long \"Shakedown Street.\"\n\n\nThe event is known for it's attention to creative production, art installations, and unique visual performers.  Guests are immersed in 360 degree artistic stage performance environments providing a one-of-a-kind festival experience. Helicopter rides, waterfall hikes, and other fun activities during the festival provide unique experiences had no-where-else.  \n\n\nNew experiences await you on the Mountain this coming summer...\n\nRemember:  Only buy tickets from this official page, or by navigating to BackwoodsMusicFestival.com to prevent fraud and ensure your tickets will be valid for the event.  This is a rain or shine event.  All sales are final and no refunds are provided once a purchase is made.", "title": "Backwoods at Mulberry Mountain 2019", "selectedPreferences": ["Relaxing", "Active"], "selectedCategories": ["Sports", "Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "\n\nDuring the month of May, San Antonio Counseling and Behavioral Center aims to bring awareness through an event that brings leaders and the community together in breaking the stigma of mental illness. Many individuals go without seeking help because they do not want to be judged or stigmatized for dealing with a mental health problem. \n\n\nIndividuals experiencing mental health conditions often face rejection, bullying and discrimination. This can make it difficult to reach out and ask for help. Our goal is to break the stigma associated with seeking mental health services and provide the community with support and additional resources. \n\nSACBC would like to invite the community to come and join us for an evening of fun, inspiration and hope. The lantern release will signify a visual representation of the individuals living with a mental health illness and those who have lost the fight. \nThis event is for families & individuals to come together to “Break the Stigma of Mental Health!” \n\nCome join us! Check us out on Facebook to reserve your lantern at facebook.com/sacounselingcenter! \n\n\nThis event is made possible through the support of San Antonio Behavioral Hospital. \n\n", "title": "Breaking the Stigma of Mental Health", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Free", "Family", "Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "\n\nJoin us on June 13, 2019 for the Charlotte Career Fair. \nMeet face to face with recruiters and hiring managers to apply for positions in: \n\n\nSales\n\n\nManagement\n\n\nGovernment\n\n\nCustomer Service/Call Center\n\n\nInsurance\n\n\nBanking/Financial Services\n\n\nHealthcare\n\n\nEducation\n\n\nIT/Engineering \n\n\nRetail.....and more\n\n\n\nThe career fair starts at 9:30 AM and professional dress is strongly recommended. This job fair is free to job seekers and allows you to connect face to face with top employers. \n A list of the attending employers and open positions will be sent to all registered candidates the week before the career fair. \nTo apply directly to open positions please register here: http://talentcareerfairs.com/candidates/ \nWe are looking forward to seeing you there!\n\nRecruitment Services\nTalent Career Fairs.\n800-201-3873\n\n\n", "title": "Charlotte 2019 Career Fair. ", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "\nIn today’s society, many of us are struggling in our relationships - good or bad - happy or sad - we are striving to make them better than they were yesterday. From our personal observation, the issue that many us have is, that we react more from our emotional side than the practical side, meaning we \"feel this way\" more than \"I thought this\" with respect to the issue.\n\n\n\n\n\nLast year we created and hosted a series of events entitled Kocktails & Konversations with a few close friends, as a panel discussion on “What It Takes For Proper Relationship Development.” The focus of the discussion was – Where our emotions should stop and where critical thinking should begin in our love relationship development. We decided to begin the serious again one expand the platform, this time we have invited local celebrities to sit on a panel and discuss a variety of topics. \n\n\n\n\n\nEach of the co-panelist have similar, yet diverse backgrounds allowing attendees to relate in different aspect to the panelist views / perspective on Love and Relationships. We invite you to come participate ask questions, see how we relate to others, and make new friends.\n", "title": "Kocktails & Konversations - Ladies Edition ", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Encoreatx.com Presents\nEncore Food Truck Fest |  Saturday April 6th | 11am - 6pm\nExperience the most Delicious Food Trucks in ATX in a Fun Family Friendly Environment!\nThis is a Free Admission Event for all ages.\nFeaturing \n- Diverse Variety of Food Vendors\n- Indoor and Outdoor Seating\n- Live Music and DJs\n- Sand Volleyball\n- Face Painting & Games for Kids\n- Plenty of Free Parking\n@ Hanovers 2.0 in North Austin\n RSVP Reccomended\n Reserved Seating and Vendor Opportunities available | Text/Call 817.403.7281", "title": "Canceled Due to Weather - Encore Food Truck Fest | 4.6", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Food&Drink"], "primaryPreference": "Relaxing", "primaryCategory": "Food&Drink"}, {"description": null, "title": "Built to Spill @ Mohawk", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "LIVE CONCERT WITH MAZE FEATURING FRANKIE BEVERLY, SIR CHARLES JONES, BISHOP BULLWINKLE, NEXT LEVEL LIVE AND LO-KEY. ", "title": " KC SUMMER SOUL FEST", "selectedPreferences": [""], "selectedCategories": ["Art", "Shows"], "primaryPreference": "", "primaryCategory": "Shows"}, {"description": "Noah's Ark Children's Foundation is hosting a 5K Family Friendly Fun Run. Along with the 5K we will have food trucks, a live DJ and MORE! This event benefits children in poverty, children with special needs and children lacking nutritious meals. Come make a difference in a child's life today! \nChildren 12 & under run for FREE! \n\n5K Heats are as follows:\n9:00AM-Running Heat\n9:15AM-Family/Walking Heat\n9:30AM-Same Day Registration Runners/Walkers", "title": "Children First 5k Family Fun Run", "selectedPreferences": ["Active"], "selectedCategories": ["Family"], "primaryPreference": "Active", "primaryCategory": "Family"}, {"description": "June 9, 2019 after commencement from 9pm-2am at Salem High School is the Senior All Night Party!  This is the final farewell for the Senior class.  All 3 schools attend this fun filled evening at Salem High School.  This event keeps our kids safe on graduation night.  This is a lock-in and doors close at 10pm for admittance to the event.\nIt is NOT a dance!  Students need their ID to enter (just like homecoming and prom).  Casual attire, but school appropriate and school rules apply.\nPLEASE submit your child’s name and student number after the first name as the attendee. Example - Jane 20012345 Smith. Thank You! \nPurchase your Senior All Night Party Tickets online via Eventbrite.  $40 until December 31st, $50 January 1st - March 31st, $60 April 1st - May 31st.  NO TICKETS WILL BE SOLD AT THE DOOR! ", "title": "PCEP Senior All Night Party", "selectedPreferences": ["Lit"], "selectedCategories": ["Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Buy Early and save : Ticket Prices Increase At The Gate\nKids 16 and under get in FREE with paying adult!\nMotoAmerica Championship at Michelin Raceway Road Atlanta: April 5-7, 2019\nMichelin Raceway Road Atlanta\nMotorcycle road racing is the fastest form of motorcycle racing in the country – a sport that delivers motorcycles of the latest technology, raced by riders who are athletes of the highest level. The MotoAmerica Championship brings this action to racetracks across the country in five exciting classes ranging from the premier Superbike class to the Junior Cup class, where riders as young as 14 years old do battle. So, immerse yourself with Friday qualifying (admission is free on Fridays) and two full days of racing where you can view the on-track action up close and also find yourself within an arm length of both the motorcycles and the men and women who race them. The MotoAmerica Series is a family event so bring the kids to enjoy our Kids’ Zone carnival games, bounce houses, motorcycle stunt shows and so much more. VIP packages are available and if you’re so inclined take advantage of our Cycle Corral package and ride your own bike on the very same racetrack that the pros ride on. Join us and experience the best racing competition found in any motorsport.\n \nMotoAmerica.com\n\nFAQs\nWhen can campers arrive at the venue?\nCampers will be allowed to come in Thursday at 1pm (all entrants must have a 2-day pass)\n \nAre there reserved spots for the tent camping?\nTent camping is on a first come first serve basis.\n \nWhat is the Full Throttle?\nEscorted grid tour to Superbike race 1&2 and preferred podium viewing. Meeting at the podium 20mins before Superbike race. (Pit Lane and grid access is limited to ages 16 and older)\nFan Lap\nDo I need to tape up my lights? No, it’s a safety car escorted lap around lap the track. You are required to wear helmet and have a signed waiver.\n \nWhat is the Cycle Corral Tickets?\nPreferred motorcycle parking with free gear check and a fan lap around the track on the end of the day on Saturday.\n \nDo they race in the rain?\nThe race may be slightly delayed, but they do race in the rain.\n \nWhen is the last day to purchase tickets online?\nThe last day to purchase tickets online is the Monday before the event weekend. Tickets can still be purchased at the advance price at a motorcycle dealership or at the gate at a higher price.\n \nHow does the print at home feature work?\nSkip the will-call lines and have the tickets sent to you to print at home or show on a mobile device to be scanned at no charge.\n \nWhat day is racing?\nThe event schedule can be found on our website, but the event is a double header, so there is racing both Saturday and Sunday.\n \nWhat time do gates open?\nGates open to the public at 8am.\n \nCan I have a campfire?\nOff ground contained fire pit only.\n \nCan I bring Pets?\nSorry, four-legged friends are not allowed into the facility. Service animals are allowed.\n \nCan I get a refund?\nUnfortunately, refunds are not available so please make sure you read thru all selections carefully before confirming at check out.\n\n\n ", "title": "2019 Suzuki Championship at Road Atlanta ", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "Xiuhtezcatl Martinez is coming to Elgin,IL on Wednesday, April 17 from 6:30 to 7:30 pm to help kickoff the community's Earth Month celebrations. His presentation at The Hemmens Centural Center is titled \"Roots of Revolution.\" (Please note date/time change from original posting of this event)\nTickets are FREE and can only be secured online at www.eventbright.com\nPresentation Description: Finding your way in a world where the planet is collapsing, revolution is on the horizon, and youth are rising with the oceans to lead the movements that will shape our future. Xiuhtezcatl’s generation was born into a rapidly changing world. We are facing total systemic collapse on nearly every level on our planet, temperatures are escalating and oceans are rising as violent weather patterns devastate the world his generation will inherit. But Youth around the world are standing up and joining hearts and hands against some of the most powerful industries in the world to build a resilient movement and communities to over come this crisis.  Never before has their ever been such an intergenerational opportunity to shape the world we deserve to inherit and want to leave future generations! Roots of Revolution is an eye opening presentation that inspires you to stand up and take action to protect all that you love!\nSo, why would someone want to speak some time on a Wednesday evening listening to this presentation?\nRolling Stone magazine summed up exactly why EVERYONE wants to hear Xiutezcatl Martinez speak when they wrote, “When he finished just over nine minutes later, climate negotiators and representatives from nearly 200 countries had seen the face of America’s next-generation environmental movement: a 18-year-old trilingual Indigenous hip-hop artist from Boulder who sat on Obama’s youth council and who’s already organized over 2,000 youth crews on six continents.”\nA 18-year-old indigenous change agent, environmental activist, public speaker, eco hip-hop artist, and the Youth Director of Earth Guardians. Xiuhtezcatl (Pronounced “Shu-tez-caat”) is a powerful voice on the front lines of the youth-led climate movement.\nAchievements for this eco-advocate include:\n\nKeynote Speaker at UN General Assembly High Level Climate Change Event with Robert Redford\n“Youth Change Maker of the Year” by President Obama\n2015 Peace First Prize Winner\n2015 Nickelodeon HALO Award Winner\nKeynote Speaker of 2015 UN Youth Assembly\nFiled lawsuit against the US Government for their use of fossil fuels: “Kelsey Juliana & Xiuhtezcatl Tonatiuh M. v. U.S & President Barack Obama”\nAuthor of bool \"We Rise: The Earth Guardians Guide to Building a Movement That Restores the Planet\"\n2013 United States Community Service Award from President Obama\nThe youngest of 24 national change-makers chosen to serve on President Obama's youth council\n\nCheck out Xiuhtezcatl's 2014 TED Talk on \"Hip-Hop Environmental Activism\" at https://www.youtube.com/watch?v=o2V2yVkedtM", "title": "Elgin Earth Month Signature Event with Speaker Xiuhtezcatl Martinez", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family", "Free"], "primaryPreference": "Cultural", "primaryCategory": "Free"}, {"description": "This ticket is for admission into the George Jones Museum.  It can be used until it expires (Dec 31 2019). It may only be used once. \nThis ticket excludes dates the museum is closed. Please check website for hours. ", "title": "Museum Ticket Admission", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Family", "Art"], "primaryPreference": "Relaxing", "primaryCategory": "Art"}, {"description": null, "title": "05/10 - Winnipeg - Pat Barrett ", "selectedPreferences": [""], "selectedCategories": ["Art", "Shows"], "primaryPreference": "", "primaryCategory": "Shows"}, {"description": "The USAF Band of Mid-America’s Concert Band will present a concert at Pike Performing Arts Center, 6701 Zionsville Rd, Indianapolis, IN, on Saturday, April 6th, at 7:00pm. Admission is free and open to the public, but tickets are required. \nPresented in partnership with Pike Performing Arts Center, this is a family-friendly, all-ages event.\nThe United States Air Force Band of Mid-America Concert Band represents the professionalism and excellence found every day throughout the Air Force. This diverse, 45-piece ensemble’s repertoire ranges from symphonic band masterworks, to traditional marches, to modern compositions, to pops and jazz. During a concert, you are likely to hear stirring works from contemporary composers as well as the familiar sounds of John Philip Sousa or Major Glenn Miller. The band also features talented vocal soloists, performing a wide variety of popular, classical, and patriotic selections.\n", "title": "USAF Concert Band Concert, Indianapolis, IN", "selectedPreferences": ["Relaxing", "Cultural"], "selectedCategories": ["Family", "Free"], "primaryPreference": "Cultural", "primaryCategory": "Free"}, {"description": "FREE FOR ALL JOB SEEKERS! Whether you are a seasoned executive-level professional, just beginning your career, or anywhere in between, our events can connect you with as many valuable employer contacts in three hours as you would make in weeks of job searching on your own. \n \nBENEFITS OF ATTENDING A JOBFAIRX EVENT:\nOpen the doors of opportunity when you meet and interview with hiring managers at companies ranging from small local businesses to Fortune 500 corporations. This career fair will allow you to learn about the businesses that are hiring and what their hiring needs are. Tired of sending your resume over the web and not receiving any responses back? By attending this event, you will be able to meet directly with hiring managers and get instant feedback on your resume and possibly even BE HIRED ON THE SPOT!  BENEFIT PACKAGES OFFERED BY EMPLOYERS\n\nSalaried Positions\nBase Salary + Positions\nBonuses\nCommission\nLife Insurance\nPaid Holidays\nPaid Company Training\nManagement Training\nRapid Career Advancement\n\n EMPLOYERS INTERESTED IN ATTENDING THIS EVENT? Email Scott Lobenberg at scott@jobfairx.com or call 702-269-1414 to inquire about setting up a booth for your company.\n \nINDUSTRIES THAT HIRE AT OUR CAREER FAIRS Accommodations, Accounting, Advertising, Aerospace, Agriculture & Agribusiness, Air Transportation, Apparel & Accessories, Auto, Banking, Beauty & Cosmetics, Biotechnology, Chemical, Communications, Computer, Construction, Consulting, Consumer Products, Education, Electronics, Employment, Energy, Entertainment & Recreation, Fashion, Financial Services, Fine Arts, Food & Beverage, Green Technology, Health, Information, Information Technology, Insurance, Journalism & News, Legal Services, Manufacturing, Media & Broadcasting, Medical Devices & Supplies, Motion Pictures & Video, Music, Pharmaceutical, Public Administration, Public Relations, Publishing, Real Estate, Retail, Service, Sports, Technology, Telecommunications, Tourism, Transportation, Travel, Utilities, Video Game, Web Services Key Words: Account Executive, Sales Representative, Account Manager, B2B, retail sales, furniture, sales, financial services, customer service, Business Development Manager, Sales Manager, Financial Services, Insurance, Telecommunications, Pharmaceutical, Hospital Representative, Medical, Marketing, Advertising, Healthcare, Telecom, Information Technology, Software, Security Services, Advertising, Payroll, Sales Management, Sales Trainee, Management Trainee, At home sales, cold calling, telemarketer, telemarketing, financial advisor, insurance sales, outside sales, outside sales representative, sales executive, salesman, salesperson, sales women, marketing, Job Fair in Houston South, Jobs in Houston South, Sales positions in Houston South, Hiring in Houston South, Houston South Jobs, Houston South Job openings, Houston South Job Fairs, Career Fair in Houston South, Houston South Career Fair.", "title": "Houston South Job Fair - April 8, 2019", "selectedPreferences": [""], "selectedCategories": ["Professional", "Free"], "primaryPreference": "", "primaryCategory": "Free"}, {"description": "This is just a pre-registration ticket. When the 20 tickets become available pre-registers will be notified 72 hours before the general public.\nThe Breakthrough Music Summit is for any artist that wants to have ultimate breakthrough in their career.This career & life changing event with former A&R Director, music industry success coach, and music business strategist will not only be a roadmap to further your career but in one night you will be able to break through the limiting beliefs and habits that have caused roadblocks in you achieving ultimate success in the music industry that you desire and deserve.This event is only available to the 20 artists that want to have breakthrough in their career. This won't be another boring conference or lecture. This is going to be a hands on meeting with the premier music business success and strategist coach Matthew Rix!\nMatthew Rix inteoduction video on the Breakthrough Summit https://youtu.be/RTy54RzkWq0Matthew Rix has spent 20 years in the music industry in various job titles including being a senior A&R director, an A&R consultant, and regional promotions coordinator and for the past few years Matthew is the \"go to\" guy for artists. He's been called on to assist artist in the studio that are dealing with creative blocks (songwriting, artistic direction), negotiated record deals and his music business audio series \"Mattrix Minute\" had over 8.4 million sales and streams in 2014 alone from 38 different nations. Matthew's purpose with this event is taking your career from good to outstanding.This is not* Artist showcase* A&R audition*A mixerThis is for artists that want to find out how to take their career to the next level, whichever area that might be and receive the tools to achieve it.Each attendee will receive the following:*Entry into The Breakthrough Music Summit*Free copy of the soon to be released \"7 Tips for unprecedented success\" by Matthew Rix*One song submission to be featured on a special Mattrix Mixtape event compilation (And you get paid for every sale and stream on this compilation)*A private coach that will do follow up with you and help you with your compilation success.If you're ready for breakthrough then this summit is for you!", "title": "Breakthrough Music Business Summit Houston", "selectedPreferences": ["Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "THE RACE IS ON... \nHave you ever wanted to race against your favourite characters while collecting stars to win amazing prizes? 'Go Karting with a twist will be headed to a city near you soon! \n A unique experience that combines your favourite characters, friends and new friends for a driving experience that will take you back in time. \nRacers from each city will compete for the chance to WIN a trip to Las Vegas for the national championship. \n\nMushroom Rally will be hosting 16 heats in 16 cities across the United States starting in Los Angeles in March 2019 with a final taking place in sin city, Las Vegas later in the year featuring all the finalist from each city. \nThere will be 20 spots in the final with three ways in which racers can win a place on the grid in Las Vegas:\n1. Having the fastest lap time in your city.\n2. Collecting the most stars in your city (Top 3 in the country will go to Vegas!)\n3. A lottery - Every person that purchases a ticket to the event , will be entered into a lottery. The winner will be announced through Facebook live - so as long as you have purchased a ticket you have the chance to win!\n\nThere will be lots of prizes to be won on the day and Instagram worthy photo opportunities. There will also be prizes for collecting the most stars throughout the Mushroom Rally series! Costume hire is included in your ticket. \nFAQ on website \nPlease note this is not a street race.\nIndividuals at least 14-years-old and 55″ tall can drive our adult karts.\nThe maximum weight for our adult karts is around 300lbs, and maximum height is around 6’7”\nSee video:\nhttps://www.mushroomrally.com\n\nTickets for this event are extremely limited - Please note this is not a street race. ​\n\n​Get ready for the rally of a lifetime!", "title": "Mushroom Rally: Cincinnati ", "selectedPreferences": ["Active"], "selectedCategories": ["Art", "Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "A Hard Night’s Day has been spreading the gospel of John, Paul, George and Ringo around the world for over 20 years. Dallas' ultimate Beatles tribute act has been wowing fans all over the metroplex.\n\nFREE EVENT DETAILS: This is a FREE event, therefore registration does NOT guarantee seating or access to the venue. Seating is first come, first served. Tickets will NOT be collected. PRO TIP #12: Arrive early to popular events as seating may go quickly!\n\nYOUR VISIT: Is this your first time visiting us? Great! Legacy Hall is an innovative, European-style food hall combining the best elements of a beer garden, craft brewery and live entertainment venue. You’ll love the three-story, 55,000-square-foot space featuring more than 20 curated restaurant stalls offering flavors from around the world. Plus, the Box Garden which is the Hall’s expansive outdoor entertainment venue, where guests sing along to live music, watch movies, cheer on live sports broadcasts and more. To learn more, visit www.legacyfoodhall.com or call (972) 846-4255. Get social with Legacy Hall (@legacyfoodhall) on Facebook, Instagram and Twitter.\n", "title": "Hard Nights Day (Beatles Tribute)", "selectedPreferences": ["Active"], "selectedCategories": ["Nightlife", "Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "Six Figure School presented by Founder & CEO Donald Bradley\n10 a.m. Six Figure School\n All Attendees Must Be Registered to Attend\nNo opportunity Meeting Will be Held\nAdvanced Online Ticket Only - No Ticket Sales At Door\nNo Refunds/No Transfers\n", "title": "PlanNet Marketing Six Figure School", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "Meet all the Princesses at The Omaha Fairytale Ball. This magical event is full of memorable moments you won't want to miss! Dance with Cinderella. Read with Rapunzel. Share Sweet Treats with Tinkerbell. Create a Tiara with The Little Mermaid! All of our princesses are excited to sing, dance, and play with your little ones! Our event focuses on making sure your little one feels royal throughout all of our activities.This event includes professional princess portraits for every child, candy buffet, crafts, stories, songs, games, and more. \nVIP Tickets: VIP guests get a full extra hour with the princesses before the ball begins! This VIP time includes stories, songs, facepainting, pixie wishes, island dance lessons and more!\nFairytale Tickets: A ticket to the Fairytale Ball includes so many magical things - a Royal Entrance, Group Games, Ocean Yoga, Princess Crafts, Candy Buffet, Stories, and Sing-A-Longs, Princess Performances, Professional Portraits, and MORE!\nMorning Session: 10:00AM to 11:45AM | VIP begins at 9:00AM\nAfternoon Session: 1:30PM to 3:15PM | VIP begins at 12:30PM\nEvening Session: 5:00PM to 6:45PM | VIP begins at 4:00PM", "title": "Omaha Fairytale Ball", "selectedPreferences": ["Lit"], "selectedCategories": ["Sports", "Family"], "primaryPreference": "Lit", "primaryCategory": "Family"}, {"description": "Bring the entire family and come enjoy The Victory Cup Hot Air Balloon Festival!\nJoin dozens of vendors, chefs, local musicians, artists, cooking demonstrations, pop-up art galleries, PLUS food and alcohol tasting partners. We are capping this exclusive event to a limited number of attendees, all tickets must be purchased in advance and online. Kids under three years old are free.\nWeather permitting, tethered rides will be available Saturday Morning and Saturday Evening. \nWeather permitting, Saturday will include a morning launch and evening glows and tethered rides. Not just about the balloons, Saturday will include Live Music, a Wine Tasting Tent, a Battle of the Chefs Tasting Competition, Polo Matches and a kids play area!\nSaturday's VIP Passes include private bars, a catered lunch, centerfield access to balloon launches and polo matches, a catered lunch and a Best of Texas dinner on the field (with the Pilots and Players)!\nAll details at: https://victorycup.org/southcarolina/.", "title": "Greenville-Spartanburg Hot Air Balloon Festival ", "selectedPreferences": ["Relaxing", "Active"], "selectedCategories": ["Family", "Food&Drink", "Family"], "primaryPreference": "Active", "primaryCategory": "Family"}, {"description": "Want to learn what it's like to be an osteopathic medical student? Register for National ShaDO Week 2019!Register by April 3rd, 2019Participating schools and dates:\n\n\nBurrell College of Osteopathic MedicineApril 10th (7:30am-1:00pm)\n\n\n\n\nChicago College of Osteopathic MedicineApril 10th (8:00am-1:00pm)\n\n\n\n\nEdward Via College of Osteopathic Medicine (Virginia)April 9th (8:00am - 4:00pm), April 10th (8:00am-4:00pm), April 12th (8:00am-10:00am)\n\n\nDeBusk College of Osteopathic Medicine - Lincoln Memorial University April 9th (7:30am-1:00pm), April 10th (1:00pm)\n\n\n\n\nLiberty University College of Osteopathic MedicineApril 17th (12:00pm-4:00pm) to register, email Chris Garnett at ccgarnett@liberty.edu\n\n\n\n\nMarian University College of Osteopathic MedicineApril 12th (10:00am-3:00pm) - ALL SPOTS FILLED - to join waitlist, please email SOMApresident@marian.edu\n\n\nNova Southeastern University College of Osteopathic MedicineApril 10th (9:00am-2:00pm)\n\n\n\n\nPhiladelphia College of Osteopathic Medicine (Philadelphia)April 15th (9:45am-3:00pm), April 16th (9:45am-3:00pm)\n\n\nPhiladelphia College of Osteopathic Medicine (Georgia)April 23rd (9:00am - 4:00pm)\n\n\nRowan School of Osteopathic MedicineApril 9th (8:30am-1:00pm)\n\n\nTouro University Nevada College of Osteopathic MedicineApril 9th (8:00am-2:00pm)\n\n\nUniversity of New England College of Osteopathic MedicineApril 9th (12:00pm-5:30pm), April 10th (7:30am-1:30pm and 12:00pm-5:30pm), April 11th 7:30am-1:30pm and 12:00pm-5:30pm)\n\n\nWest Virginia School of Osteopathic MedicineApril 8th (11:00am-3:30pm)\n\n\nWestern University College of Osteopathic Medicine of the Pacific - Western University of Health SciencesApril 11th (9:00am-1:30pm)\n\n\nGoogle Hangouts with your National Pre-SOMA DirectorApril 9th, 7:00pm EST\n\n\nSchool locations available here: http://www.aacom.org/news-and-events/publications/2018-cib/admissions-officesDetailed event information will be provided via email by your location one week before the event.", "title": "Pre-SOMA's ShaDO Week 2019", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "Jourdan Lewis WR vs DB + QB Skills Football Camp\nSunday May 26, 2019\nPAL HEADQUARTERS\n1680 Michigan Ave.\nDetroit,MI 48216\nMiddle Schoolers 10:30 am\nHigh Schoolers    12:30 pm", "title": "Jourdan Lewis 2nd Annual Football Skills Camp ", "selectedPreferences": ["Active"], "selectedCategories": ["Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "\nKids Building Wisconsin 2019 is May 11, 2019 at McKee Frms Park in Fitchburg, WI.  Kids Building Wisconsin is an educational and fun event to inspire and encourage kids’ interest in construction. Kids Building Wisconsin is a 100% free event (with the exception of food) and open to the public. At Kids Building Wisconsin, we have big construction equipment, boom lift rides, and over 40 awesome hands-on exhibits highlighting the many exciting careers in the construction industry.\nWhen regsistering make sure you select one ticket per person (including children)\n\nFAQs \nWhy do I need to register for Kids Building Wisconsin if it is a free event?\nKids Building Wisconsin does involve big construction equipment and other activities that have a certain degree of risk. Is KBW dangerous? Not at all but the lawyers say we need this and also we like to have contact information in case an emergency would happen.\nAnyway, please make sure when pre-registering the you get 1 ticket per person including each kids you plan on attending with you.\n\nWhy pre-register for Kids Building Wisconsin?\nSimple answer, so you do not have to fill out this form the day of the event. Do you need to pre-register? Nope, we have registering available at the vent also but we encourage it!\n\nHow many tickets do I need to get?\nWhen pre-registering the you get 1 ticket per person including each kids you plan on attending with you.\n\nWhat are my transportation/parking options for getting to and from the event?\nParking has always been an issue at Kids Building Wisconsin and we are working with the City of Fitchburg to make it easier.  WE WILL HAVE VERY LIMITED PARKING AT McKEE FARMS PARK!  Additionally in the past we have had extra parking at local businesses with a shuttle.  The City of Fitchburg is not allowing street parking for the event for emergency vehicle access.  We will update new parking information on our Facebook page.\n\nLast year the pre-registration line took forever, have you fixed that?\nThats why pre-registration is done on EventBright now.  The pre-resgustration line process will be very fast now.  Just show your printed out code or code on the app and you are in.\n \nHow can I contact the organizer with any questions?\nYes, please feel free to message us on Facebook or by sending an e-mail to info@kidsbuildingwi.org\n \nDo I have to bring my printed ticket to the event?\nYou do not have to but we highly suggest that you do to keep the line moving faster.  Either a printed ticket or the Evetbright app on your phone.\n \nAre food and drinks free as well?\nFood and drink at Kids Building Wisconsin are not free. Roman Candle will be on site selling pizza, hot dogs and other items.\n\nWhat is the best time of the day to attend?\nAfternoon!   Kids Building Wisconsin is traditionally the busiest from 9:00 AM to about 1:00 PM.  ", "title": "Kids Building Wisconsin 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Professional", "Family"], "primaryPreference": "Active", "primaryCategory": "Family"}, {"description": "SATURDAYS  AT THE ALL NEW ARIF LOUNGE - ( 2847 BUFORD HWY ATL GA ) tables  \n470-451-6419\nRESERVE EARLY :FREE ENTRY / HOOKAH / FOOD / PARTY / BDAYS / TOP DJS / INTERNATIONAL + INDUSTRY NIGHT / SOCIALIZE / YOUNG PROFESSIONALS. TABLE OPTIONS : 1 BTL SECTION $250 , $500  SECTION COMES WITH TWO PREMIUM  ONE LITER BOTTLE OF YOUR CHOOSING= taxes + gratuity included already $760 COMES WITH THREE PREMIUM BTLS . POWERED BY ADDICTION ENT", "title": "SATURDAY PARTY AT ATLANTAS PARTY DESTINATION: ARIF LOUNGE 8PM-3AM", "selectedPreferences": ["Lit"], "selectedCategories": ["Shows", "Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "It’s date night! Bring your spouse and some friends to Comedy Night to enjoy a performance by award-winning comedian Zoltan Kaszas.", "title": "2019 Couples Comedy Night", "selectedPreferences": ["Lit"], "selectedCategories": ["Art", "Food&Drink", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "Join us Friday or Saturday evening for service including an exciting, high-quality kids ministry.\nFollowing service, there will be a MOONLIGHT EASTER EGG HUNT with 50,000 colorful, candy-filled eggs.\nThere will be FREE GIVEAWAYS! (ATV, Kindle, Gift Cards)\nPRE-REGISTER and skip the long lines at registration by showing your Eventbrite ticket when you arrive.\nLOCATIONS:Moffett Campus7200 Moffett RoadMobile, AL 36618\nAirport Campus10775 Airport BlvdMobile, AL 36608\n----\nFor additional information please visit:easteratpathway.us\n----\nJoin us Sunday, April 21st for EASTER SERVICES:9 and 10:30 AMMoffett Campus or Airport Campus.", "title": "Moonlight Egghunt ", "selectedPreferences": ["Active", "Cultural"], "selectedCategories": ["Free", "Food&Drink", "Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "The third annual Starved Rock Country Brew Fest will take place on Saturday, May 25th, 2019. The fest will feature over 60 unique American craft beers, live music and local food. Join us in downtown Ottawa for the most anticipated craft beer event of the year.\nGeneral Admission:  $30 till April 25th $35 till May 24th$40 at the door\nDesignated Driver: $10 (at the door only)\nCheck out our website StarvedRockCountryBrewFest.com\n*All ticket sales are final", "title": "Starved Rock Country Brew Fest 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Art", "Food&Drink", "Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "Come join us for Can Chicago Kick It?\nCan Chicago Kick It? is a day party that pays homage to the 90's and Early 2000's. Musically, we'll have you resminscing the experiences you had listening to some of your favorite classic R&B and Hip Hop artists such as TLC, NEXT, Mario, Usher, Nelly, (The old) Kanye West, Aaliyah, Monica, Brandy, No Limit Records, Mary J. Blige and more.\nCome dressed in your favorite nostalgic 90's attire!\nEntry is free before 5pm (capacity permitting) with a cover charge following. Guests purchasing guaranteed tickets will be admitted entry before free guests. This event always hits capacity, so early arrival is strongly suggested. Bottle service is available and includes entry for up to 5 guests. There is a 2-bottle minimum per section. This event is 21+.\nDisclaimer: By attending Can Chicago Kick It, you are agreeing to allow yourself to be filmed and photographed and used in promotional material.\nThis event is also a special celebration of the 10th Alphaversary of the Spring 2009 Illinois Area 4 Alphas.", "title": "Can Chicago Kick It?", "selectedPreferences": ["Lit"], "selectedCategories": ["Shows", "Free", "Food&Drink", "Shows"], "primaryPreference": "Lit", "primaryCategory": "Shows"}, {"description": "The Majestic and KULA Gallery's All White Derby Day Party presenting Maestro J!\nCome watch live art painting by Louisville's own ArtbyRice!\nSo be sure to come dressed in you favorite Derby attire!\nCustom Derby drinks created by Sly and Happy Endings Bar Service.\nThis is a 21 and over event.\nCouch Sections available!  Bottle service available!\nMajestic Cafe will be open!", "title": "All White Day Party", "selectedPreferences": ["Relaxing", "Cultural", "Lit"], "selectedCategories": ["Food&Drink", "Art"], "primaryPreference": "Lit", "primaryCategory": "Art"}, {"description": "The Golden Tiger Reunion is an annual event intended to serve as a celebration for the 50th anniversary class as well as the class reunion for all classes who have already been inducted as Golden Tigers in years past.\nGolden Tigers are invited back to campus to reunite with their old classmates and friends to reminisce about their days as students and to learn about what is happening at Clemson today.\nThe 50th class will be honored by being inducted into the Golden Tiger Society which is a formal event similar to graduation. Each Golden Tiger will be presented with a Golden Tiger lapel pin and an official Golden Tiger Society Induction Certificate to commemorate the day. The Golden Tiger class will also present their Class Gift to the university during an additional celebration along with participating in the other reunion activities planned for all to enjoy.\nClasses that have previously been inducted into the Golden Tiger Society during their 50th will enjoy university presentations, campus updates, campus tours and activities.\nSchedule of Events\nWednesday, June 12, 2019Class of 1969 Meet & Greet - FREESole on the Green, Madren Conference Center \nThursday, June 13, 2019\n7:30 – 9:00am - Registration for Class of 1969 at Madren Center\n9:00am – Transportation of 1969 Class to Tillman Hall for Induction Ceremony\n9:30 – 11:15am - Golden Tiger Induction Ceremony for Class of 1969 - FREEClass of 1969 Gift Celebration / Dedication to follow ceremonyClass photo will be taken at this timeAttire: Sunday dress; men please wear blue blazer & tie. \n11:15am – Transportation from Tillman Hall to Allen N. Reeves Football Complex for football operations facility tour. Transportation back to Madren Conference Center following tour. FREE\n12:45am – 2:15pm – Lunch Break “Lunch on your Own” *Price & transportation not included in registration*Time on your own to rest/refresh, enjoy Clemson, downtown and campus.\n2:15pm – Meet at Madren Center for Bus transportation to Strom Thurmond Institute \n2:30 – 4:00pm – Orange Glove Event  – Strom Thurmond Institute - FREETake a walk down memory lane through various Clemson archives and artifacts from the year 1969 \n4:00pm – Bus transportation from Strom Thurmond to Madren Center\n4:00 - 6:00pm – Refresh Break back at the Madren CenterSocial hour with cash bar (beer and wine) in Madren Center's Bellsouth Lobby\n6:00pm – until – Welcome Reception/Dinner – All Reunion Guests - $40 per personAttire: Casual Dress. Madren Center Ball Room\nFriday, June 14, 2018\n9:00 – 11:30am – Tours & Activities for all reunion guests. Tours and activities to be announced closer to the date. Tours and Activities are first come, first served and participants must register for these activities at check-in. \nNoon – Clemson Family Luncheon - $40 per personAll Reunion Attendees – Remarks from faculty & staff. Casual Dress. \n1:00 - 4:00pm - Members of the Class of 1969 are invited to travel via bus to Greenville, SC to CU iCAR for a facility tour. This tour will a paid ticket. Limited to 80 guests. $10 per person \n2:00 – 5:00pm – Tours & Activities for all reunion guests. Tours and activities to be announced closer to the date. Tours and Activities are first come, first served and participants must register for these activities at check-in. \n5:00 – 6:00pm – Social Hour – Cash Bar. Madren Center Lobby (all reunion guests)\n6:00pm – Until – 1969 Class Party $65 per person", "title": "Class of 1969 Golden Tiger Reunion", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "SHS Drama Club Presents: Beauty and the Beast", "title": "SHS Drama Club Presents: Beauty and the Beast -Friday 04.12", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Shows", "Art", "Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "\nWe've all enjoyed a \"killer tomato\" sandwich or a juicy watermelon from Davis Produce on Highway 80.  Who doesn't enjoy seeing those decorated hay bales next to the Circle K on Whitemarsh Island?   Sherrie and Randy Davis have long been our \"go to\" for fresh produce and seasonal specialties like pumpkins and Christmas trees.  Any time they are asked for help, they  always give back to the community and now THEY need our help!\n\nRandy has been diagnosed with stage 5 kidney disease requiring immediate regular dialysis until a kidney donor match can be found. It will be a long time before Randy can work in the family business again where he located, purchased, and transported their fresh produce from all over the region to their \"Davis Produce\" stand. \n\nSherrie has always run the store front and now must run the entire operation alone which will be a huge challenge, with two young children at home.   They have no health insurance on  Randy. \n\nWe can help ease the burden of living expenses and medical bills if we all come together to give back to them, as they've given to our community over the years.\n\nA group of friends is planning a fund-raiser for this purpose.  Please make plans to join us at the Tybee Island American Legion Post 154 on May 5th from 3pm-7pm for a BBQ fundraiser.  BBQ plates will be available for $12 each (dine in or take it to go), and there will also be a silent auction, a live auction, and raffle tickets for door prizes with all proceeds going to the Davis Family. \n\nWe will be setting up tents outdoors at the Legion for more space for mingling.  Music will be provided by DJ Mickey the Midnight Rocker and Mid-Town Pickers!\n\nPhysical tickets for the BBQ can now be purchased in person at Retro and Coastal Decor if you prefer to buy in person rather than online! Stop by 444 Johnny Mercer Blvd. (next to Angel Nails, across the street from Kroger) Tuesday, Wednesday, Friday from 11am-6pm, Thursday 11am-3pm, or Saturday 11am-4pm. \n\nIf you are interested in volunteering for this event or donating items for the live and silent auctions, please contact Virginia Ward or Stephanie Hamilton at 912-786-9857 or email at office@thecrabshack.com. \n\nCan't make it to the BBQ, but still want to help?  Click on \"TICKETS\" and you will have the option of making a donation.  Any amount you can donate is greatly appreciated!", "title": "The Davis Family BBQ Fundraiser", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Shows", "Food&Drink"], "primaryPreference": "Relaxing", "primaryCategory": "Food&Drink"}, {"description": "FREE FOR ALL JOB SEEKERS! Whether you are a seasoned executive-level professional, just beginning your career, or anywhere in between, our events can connect you with as many valuable employer contacts in three hours as you would make in weeks of job searching on your own. \n \nBENEFITS OF ATTENDING A JOBFAIRX EVENT:\nOpen the doors of opportunity when you meet and interview with hiring managers at companies ranging from small local businesses to Fortune 500 corporations. This career fair will allow you to learn about the businesses that are hiring and what their hiring needs are. Tired of sending your resume over the web and not receiving any responses back? By attending this event, you will be able to meet directly with hiring managers and get instant feedback on your resume and possibly even BE HIRED ON THE SPOT!  BENEFIT PACKAGES OFFERED BY EMPLOYERS\n\nSalaried Positions\nBase Salary + Positions\nBonuses\nCommission\nLife Insurance\nPaid Holidays\nPaid Company Training\nManagement Training\nRapid Career Advancement\n\n EMPLOYERS INTERESTED IN ATTENDING THIS EVENT? Email Scott Lobenberg at scott@jobfairx.com or call 702-269-1414 to inquire about setting up a booth for your company.\n \nINDUSTRIES THAT HIRE AT OUR CAREER FAIRS Accommodations, Accounting, Advertising, Aerospace, Agriculture & Agribusiness, Air Transportation, Apparel & Accessories, Auto, Banking, Beauty & Cosmetics, Biotechnology, Chemical, Communications, Computer, Construction, Consulting, Consumer Products, Education, Electronics, Employment, Energy, Entertainment & Recreation, Fashion, Financial Services, Fine Arts, Food & Beverage, Green Technology, Health, Information, Information Technology, Insurance, Journalism & News, Legal Services, Manufacturing, Media & Broadcasting, Medical Devices & Supplies, Motion Pictures & Video, Music, Pharmaceutical, Public Administration, Public Relations, Publishing, Real Estate, Retail, Service, Sports, Technology, Telecommunications, Tourism, Transportation, Travel, Utilities, Video Game, Web Services Key Words: Account Executive, Sales Representative, Account Manager, B2B, retail sales, furniture, sales, financial services, customer service, Business Development Manager, Sales Manager, Financial Services, Insurance, Telecommunications, Pharmaceutical, Hospital Representative, Medical, Marketing, Advertising, Healthcare, Telecom, Information Technology, Software, Security Services, Advertising, Payroll, Sales Management, Sales Trainee, Management Trainee, At home sales, cold calling, telemarketer, telemarketing, financial advisor, insurance sales, outside sales, outside sales representative, sales executive, salesman, salesperson, sales women, marketing, Job Fair in Dallas, Jobs in Dallas, Sales positions in Dallas, Hiring in Dallas, Dallas Jobs, Dallas Job openings, Dallas Job Fairs, Career Fair in Dallas, Dallas Career Fair.", "title": "Dallas Job Fair - April 10, 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}, {"description": "\nAn excellent opportunity to sample craft beer and taste local fine food. \nLive music \nmeet up with old friends\n", "title": "Bayfield Beer and Food Festival", "selectedPreferences": ["Active"], "selectedCategories": ["Shows", "Art", "Food&Drink"], "primaryPreference": "Active", "primaryCategory": "Food&Drink"}, {"description": "This is a WW2 event hosted by 1st Allied Airborne and the Ozaukee County Historical Society.\r\nTentative General Schedule:Thursday 5/16: Setup ONLY beginning at 3pm. All participants check in at Trading Post - bring EventBrite ticket!!!Friday 5/17: Comumunity Day 9am-3pm. Friday night setup begins at 3:30pm (grounds to be cleared of public before cars can enter). LIVING HISTORY SWAP MEET starts at 4pm (closed to public).Saturday 5/18: Event Open to the Public 10am-5pm. USO Style dance 7pm-10pm. GROUP PHOTO TO BE TAKEN BEFORE GATES OPEN.Sunday 5/19: Event Open to the public 10am-3pm. FREE PANCAKE BREAKFAST TO START THE DAY.\r\nThe Historical Society will be coordinating \"Community Preview Day\" on Friday from 9am - 3pm.  Saturday AND Sunday will be the main public event with 2 public battles on Saturday, 1 public battle on Sunday. Saturday night, enjoy the evening with a reenactor and public social / USO-style Dance and activities in the 19th century village. We have a modern, concrete floored 200x100 pole barn with modern facilities that will be used for the social. Food and drinks are offered during the day (at own cost). Alcohol is allowed and will be sold throughout the event. Free firewood will be available for night-time campfires.\r\nAll WW2 impressions are welcomed.  We can handle all types of tentage and vehicles. For pictures of the sight please visit the Ozaukee County Historical Society website: www.ochs.co.ozaukee.wi.us/PDF/PavillionBook.pdf. \r\nRegistration will be through www.eventbrite.com ONLY. Any problems registering, please contact Becky Miller at mbazmiller@gmail.com PRIOR to the event date. Any inquiries about the event itself should be directed to Matt Miller at allied.airborne1@yahoo.com We encourage ALL participants to \"LIKE\" our Facebook page \"WWII Living History Event Pioneer Village\" - this page is used to announce updates and/or changes. There will be LIVE FRIDAY NIGHT CHATS starting in February to keep everyone in the loop of how the event is coming along and what to expect. Please note, when you register, you are also completing your event waiver. YOU MUST BRING YOUR EVENTBRITE TICKET FOR CHECK-IN!!! Walk-ins will be limited.\r\n** MINORS: YOU MUST HAVE A LEGAL GUARDIAN/PARENT SIGN YOUR EVENTBRITE TICKET. GUARDIAN/PARENT CONTACT INFORMATION MUST BE PRINTED ON THE TICKET.\r\nFEES:We are asking for a $10 donation from each Living Historian to help cover insurance and incedintal costs.  Vendor Fee is $10 (to be paid at the door during registration). All vendors (with paid registration fees) and Living Historians who donate $10 will receive a FREE meal ticket for Saturday. Sunday pancake breakfast will be served at \"Town Hall\" to ALL participants. Other group meal options are noted on ticket registration if they are available. Again - food and beverages are also available for purchase on the grounds during show hours.\r\nFRIDAY NIGHT SWAP MEET:All participants are welcome to participate in a swap meet on Friday night starting at 4pm -- NO TABLE FEE!!! YOU ARE RESPONSIBLE FOR YOUR ITEMS - we do not have volunteers to help watch tables. You will need to bring your own table(s) or use the picnic tables under the depot. Sale will be held at the Train Depot -- OUTSIDE. All items MUST BE PACKED UP by Friday at 11pm. Any participant not cleared out of the swap meet area by opening hours on Saturday will be charged the $10 vendor fee. Please bring your own change!!!\r\nOzaukee County Pioneer Village is located 25 miles north of Milwaukee, in the Town of Saukville. It is situated 1 mile south of Fredonia. Beautiful, wooded park. Very convenient location - easy access to highways, gas stations, banks, grocery stores, restaurants.\r\nAll updates and communications for this event will take place on our Facebook page: WWII Days - OCHS Pioneer Village. Live Facebook feeds will take place leading up to the event date to help keep attendees informed and to answer any questions regarding the event itself. We encourage at minimum one person from each participating unit to be a member of our facebook page to keep communication open between units and planners. Do not ask for email updates - it won't happen due to time constraints.\r\nAny questions? Please contact: \r\nMatt Miller262-689-0575E-mail: allied.airborne1@yahoo.com \r\nBecky Miller262-689-1452mbazmiller@gmail.com", "title": "WWII Event Pioneer Village - Metz: A City That Wouldn't Surrender", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family", "Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "Come celebrate the opening of Cortex' newest addition: 4220 Duncan! Enjoy four floors of immersive experiences hosted by the building's unique tenants all with complimentary food and drink! This event is free and has activities for all ages.\n-Test your balance and dance the night away with acroyoga and sh'bam jams in MOVE by BJC \n-Enjoy the show with circus performances and Boeing's drones races throughout Innovation Hall \n-Warm your buns by the fireside hotdog station on The Chocolate Pig's patio\n-Choose your own adventure with a new activity, food, and experience behind each of CIC's doors including Accenture's signature cocktail station \n-Putt putt your way through Aon's golf course \n-And, demo Microsoft's new HoloLens and thier collection of virtual reality technology ", "title": "The Something For Everyone Party", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Art", "Food&Drink"], "primaryPreference": "Relaxing", "primaryCategory": "Food&Drink"}, {"description": "Homelessness is one of the most important issues that will confront the next mayor of Dallas. As the lead agency of Dallas’ homeless response system, MDHA will hold a mayoral forum to give candidates a chance to lay out their visions for ending homelessness in our city.\n(Picture of Dallas City Hall by Kent Wang - https://www.flickr.com/photos/kentwang/2148982530/, CC BY-SA 2.0, https://commons.wikimedia.org/w/index.php?curid=7480448)\n", "title": "Mayoral Forum on Homelessness", "selectedPreferences": ["Cultural"], "selectedCategories": ["Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "CARAMELOS DE CIANURO, con más 20 años de carrera artística, nominados a los Premios MTV 2007 como Mejor Artista Central y en el 2012 Mejor Artista Centro en MTV Europa y exitosas giras de conciertos, festivales y promocionales en: Venezuela, Puerto Rico, México, Ecuador, Perú, Panamá, República Dominicana, Colombia, España, Italia, USA, llega nuevamente a Houston TX con su novedoso 2019 TX Tour. Invitado especial, Segunda Nave. Un evento Presentado por PipoProductions y Patrocinado por Korbel Champagne, Pirucream, Bielinas Catering, Reinaldo Medina Photography, Rafael Gonzalez de Toyota Katy, Camp La Llanada, , Oasis Pro Events, EV Houston, Your Signs World, TuttoPane Bakery, Liga de Softball Venezolana en Houston, El Kourmet, Redes de Venezolanos en Houston1, WG Insurance, Hola Katy Tu revista, PanaKar, y mjoy cakes & more.", "title": "CARAMELOS DE CIANURO - HOUSTON TX - 2019 TX TOUR", "selectedPreferences": ["Lit"], "selectedCategories": ["Art"], "primaryPreference": "Lit", "primaryCategory": "Art"}, {"description": "The largest anime convention in the St. Louis, MO region returns for its 14th annual event on May 3 - 5, 2019 at the St. Charles Convention Center and Embassy Suites.  Join us for our great social programming events like:\n\n\nThe Honey Tea Maid Cafe\n\n\nNerdy Night Lounge Karaoke\n\n\nDances\n\n\nCostume Contests\n\n\nIndustry Guests\n\n\nAnd More!\n\n\nPre-register to save money on your weekend pass, and if you're planning to stay at the Embassy Suites you have the ability to pick-up your badge at check-in.  Join over 5,000 attendees for gaming, interactive content, and more!\nFAQs\nAre there ID or minimum age requirements to enter the event?\nWe encourage parents & guardians to attend with anyone under the age of 16, and even offer a Chaperone Pass for those 30 and over who are buying a pass for someone under 18.  Most of our programming is all-ages, but there are 18+ panels in the evening that will require both an 18 and over badge and government-issued ID to allow entry into those panels.\nWhat are my transportation/parking options for getting to and from the event?\nFree parking is available at the venue.  If parking fills up, patrons can park around the city and certain locations and be picked up by the city trolley.  More details at: http://www.historicstcharles.com/things-to-do/trolley/\nWhat can I bring into the event?\nPlease read our rules at http://animestl.net/programming/convention-rules/ for more information.\nHow can I contact the organizer with any questions?\nYou can reach us at conchair@animestl.net or by phone at 309-645-1645.\nWhat's the refund policy?\nNo refunds are allowed, except in the case of event cancellation.\nDo I have to bring my printed ticket to the event?  What if I don't pre-register?\nIt makes the pre-registration process go quicker, so it's encouraged to have either your printed or e-ticket on your phone ready on arrival.  Badge sales are available at the door.  However, the pre-registration line is generally quicker than the at-door line, so be sure to buy your badge before arriving if you wish to save time!\nCan I update my registration information?  Is my registration fee or ticket transferrable?\nBadges are not mailed ahead of time, so a typo on your address will not affect your entry.  People who pre-register can change their purchase information at any time (such as changing a badge to another receipient). \nIs it ok if the name on my ticket or registration doesn't match the person who attends?\nPeople may buy badges for others, but badges cannot be picked up by another person or for someone who isn't present.  Be sure the Attendee Name is correct for the person picking up their pass.", "title": "Anime St. Louis 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Sports", "Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "It's about to be that time of year again... Kingz of the South, Mother Chapter Annual ROYAL BASH VI!!\nYou know how we do it:\n\nHospitality at its finest\n1000's of bikes\nVendors selling a wide variety of merchandise\nMouth-watering food\nBest DJ's this side of the Mississippi\n\nWho is going to be there...???  EVERYBODY, you know the KINGZ bring em out!!!!  The Dirty South, East Coast, Mid-West, and especially the West Coast.  This is that ONE event, you dont want to miss... \nOnline tickets are $10 until April 28th... prices go up after that.  Tickets cover admission for all events during the Kingz Week.", "title": "Kingz of the South Mother Chapter Royal Bash VI", "selectedPreferences": ["Active", "Lit"], "selectedCategories": ["Shows", "Nightlife"], "primaryPreference": "Lit", "primaryCategory": "Nightlife"}, {"description": "Join the MN Leadership Council on Aging with Volunteers of America MN/WI, Care Providers of Minnesota, and AARP Minnesota to screen Lives Well Lived, a feature documentary film by Sky Bergman that celebrates the incredible wit and wisdom of adults 75 to 100 years old who are living their lives to the fullest. Encompassing over 3000 years of experience, forty people share their secrets and insights to living a meaningful life. Their intimate memories and inspiring personal histories will make you laugh, perhaps cry, but mostly inspire you. \nThe free event (pre-registration required) includes screening of the film, conversation with Sky Bergman, and a soda and popcorn.", "title": "Lives Well Lived Screening", "selectedPreferences": ["Cultural"], "selectedCategories": ["Free", "Art", "Family", "Shows"], "primaryPreference": "Cultural", "primaryCategory": "Shows"}, {"description": "Welcome to the 2019 Crazylegs Classic Run/Walk event taking place on Saturday, April 27.\nLOCATION AND TIME CHANGE FOR RACE START!  \nWALKERS AND RUNNERS will BOTH START on LIBRARY MALL at the intersection of State Street and N. Lake Street near downtown Madison.\nWalkers will start the 2 mile walk BEFORE the runners at 9:50am with the runners starting approximately at 10:00am.  Also, runners and walkers will enter Camp Randall Stadium on opposite ends of the field each having its own finish line in the stadium making it safe for everyone.\nThe Crazylegs Classic post-race party is a long-time favorite of all participants. Festivities are staged on the East side of Camp Randall Stadium. PLEASE NOTE: You MUST be wearing a Crazylegs Classic race bib and be of legal drinking age to be served beer -ID’s are checked.  Hot dogs and soda will be available for purchase after the race. Be sure to stay for the awards ceremony, performance by the UW Marching Band & Spirit Squad, and live entertainment with UNIVERSAL SOUND, popular regional cover band! Festivities end at 1:00pm.", "title": "2019 Crazylegs Classic 8K Run / 2-Mile Walk", "selectedPreferences": ["Active"], "selectedCategories": ["Food&Drink", "Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "Spend the day enjoying the sounds of live jazz with a touch of soul at our 2nd annual RCRF Jazz Fest. Hosted by Chaye Alexander. \nThis event is FREE for the entire family and offers a fun and vibrant street festival atmosphere you're sure to love. Bring your lawn chairs, blankets and come experience a day of live music, local vendors, food trucks and activities for all ages at the RCRF Jazz Fest 2019. \nThe Musical Lineup Includes:\n\n\nDwayne Johnson & Soulfood Jazz Band\n\n\nReggie Graves & Jazz Theory\n\n\nGwen Yvette & TC Soul\n\n\nWillie Walker & Conversation Piece\n\n\nWe've partnered with Hampton Inn & Suites Columbia Killian Road to offer accommodations for Jazz Fest attendees between September 13, 2019 - September 15, 2019. Book by August 16th to reserve your room! This newly designed Hampton Inn & Suites is located at 1310 Roberts Branch Pkwy, Columbia, SC 29203. Click here to book your room. \nFor vendor or general information, contact Lisa Lewis-Hutcherson at (803) 741-7272, ext. 102. ", "title": "2nd Annual RCRF Jazz Fest", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Nightlife", "Shows", "Art"], "primaryPreference": "Relaxing", "primaryCategory": "Art"}, {"description": "Bring the family and invite the neighborhood to New Hope's annual Easter Eggstravaganza! Don't miss a chance to invite a friend to this EGGstraordinary, musically EGGciting, most EGGcellent family experience. \nAfter some singing, dancing, and a stage show, kids will hunt for their eggs by age group in a fun age appropriate environments. Our littlest friends will \"hunt\" in an open space, our preschoolers will bounce away beach balls and balloons, while the bigger kids are digging through paper shreds and experiencing our special GLOW IN THE DARK cave. Every kid leaves with candy and prize filled eggs, and a goody bag. \nDon't worry about the forecast, rain (or snow) or shine, we're hunting INDOORS! Don't forget to bring a bag or basket to collect your eggs. We can't wait for your family to be part of the fun. ", "title": "2019 EGGSTRAVAGANZA 9AM", "selectedPreferences": ["Cultural"], "selectedCategories": ["Family"], "primaryPreference": "Cultural", "primaryCategory": "Family"}, {"description": "Mud Hero is the most fun you’ll ever have covered head-to-toe in mud. Take on the muddiest challenge ever and crank your adrenaline as you push yourself and your fellow Heroes to the finish line, smiling every inch of the way. Finally, celebrate your achievement with other mud-lovers and spectators at the post-race Mud Bash, with a barbecue, bevies, live music and more. If you’re mad about mud – or just plain mad – this is the event for you. \nGET MUDDY FOR LESS MONEY BY REGISTERING EARLY!\n TICKET PRICES JUMP MARCH 15!\n\nWHICH COURSE WILL YOU TAKE ON?\nMUD HERO 6KM\n\nMud Hero's 6k course has over 18 obstacles and will get your adrenaline and blood pumping, while announcers, music and awesome obstacles make this course like no other.\nAges 12 and up (Kids 12 & 13 must run alognside an adult)\nThis event is not timed\nIncludes t-shirt, event photos for download, afterparty, finishers medal and the MOST. MUD. EVER.\nWave times available from 9:30am-2:00pm \nBe a Midday Hero and save $10 by running at 1pm or later\n\nMUD HERO ULTRA 10KM - CHIP TIMED\n\nMud Hero ULTRA 10k offers all the fun and mud of our 6km course, but with the added challenge of some extra mileage and more challenging obstacles. Not to worry if you're finding the obstacle is too hard, Mud Hero Ultra obstacles will have hard/easy options, or you can always skip it (no burpees required!)\nAges 12 and up (Kids 12 & 13 must run alognside an adult)\nThis event is timed\nIncludes t-shirt, event photos for download, afterparty, finishers medal and the MOST. MUD. EVER.\nWave time for Ultra is 8:30am\n\nMUD HERO KiDS\n\nKids between the ages of 4 and 12 can experience the legendary Mud Hero fun with downsized versions of adult obstacles. The 500 meter course (depending on age kids will do multiple laps) includes 6 smaller obstacles including walls, tunnels, balance beams, cargo climb and kid's mud pit.\nAdult supervision required\nThis event is not timed\nIncludes t-shirt, event photos for download, festival access, finishers medal and the MOST. FUN. EVER.\nWave times available from 10:00am-1:40pm\nPRICE JUMPS ON MARCH 26!\n\n\nQUESTIONS? \nEmail us info@mudhero.com\n", "title": "Mud Hero Manitoba - July 27, 2019", "selectedPreferences": ["Active"], "selectedCategories": ["Sports"], "primaryPreference": "Active", "primaryCategory": "Sports"}, {"description": "Ari Lennox at Grog Shop", "title": "Ari Lennox", "selectedPreferences": ["Active"], "selectedCategories": ["Shows"], "primaryPreference": "Active", "primaryCategory": "Shows"}, {"description": "Come join us for the Grand Opening Celebration of COhatch \"The Pub\" at Polaris Fashion Mall!\nEnjoy live music from great bands, tours of COhatch The Pub and our on-site brewery by The Brothers Drake, local food trucks, local makers,drink tastings from local breweries +  hors d'oeuvres, photo booth, kids activities and more!  \nMore details to follow!\n", "title": "COhatch Polaris \"The Pub\" Grand Opening Celebration: The Side Street Festival!", "selectedPreferences": ["Relaxing"], "selectedCategories": ["Food&Drink", "Shows"], "primaryPreference": "Relaxing", "primaryCategory": "Shows"}, {"description": "‘Building Successful Business Habits’ - Business Training   2:00 – 5:00 PM  |  $10 per person \n ‘Healthy Habits for Life’ - An introduction to dōTERRA and Product Training  7:00 – 9:00 PM |  Free to all     \ndoTERRA isn’t just about using essential oils, but about cultivating a healthy lifestyle with products that are pure, natural, and safe for the whole family. This can’t-miss event will answer your questions, offer inspiration, and empower you to use creative essential oil solutions with your family and friends. Come learn how to take advantage of every benefit that the doTERRA lifestyle has to offer!\n\n\n\n‘Building Successful Business Habits’ - Business Training   2:00 – 5:00 PM  \n$10 per person\nThis business training session will show you how to share essential oils the doTERRA way—by building your business around your unique talents and abilities. Learn how to maximize your personal strengths for your business and you’ll walk away feeling more confident in your ability to invite and enroll new people!\n\nEmbrace your strengths: Discover your strengths and how they can be maximized to get new enrollments.\nSharing with ease: Learn how to make connections that will help you build your business.\nAttitude: Could your mindset be holding you back from success?\nWe are here for you! Check out all of the resources and programs doTERRA has in place to make it easy to build your business.\n\n ‘Healthy Habits for Life’ - An Introduction to dōTERRA and Product Training  7:00 – 9:00 PM                        Free to All\nIf you want an up-close look at how doTERRA products work and what makes them so effective, this session is for you. This free event will help to answer some important questions, such as:\n\nWhy should I choose doTERRA over other essential oil companies?\nHow can doTERRA products improve my family’s health?\nWhat makes doTERRA a leader in the essential oil industry?\n\nAs a bonus, Wellness Advocates can bring guests to help those who are new to essential oils get some first-hand experience with doTERRA products. This event includes demonstration booths that allow attendees to sample products, ask questions, and see what doTERRA is really about.\n\n*PLEASE NOTE: You will need to either display your order confimation on your mobile device, or print it and bring it with you to the event for entry.\nIf you need ASL interpretation, please email events@doterra.com no later than two weeks prior to this event. ", "title": "doTERRA 2019 Healthy Habits For Life - Denver, CO", "selectedPreferences": [""], "selectedCategories": ["Shows"], "primaryPreference": "", "primaryCategory": "Shows"}, {"description": "The Fairytale Ball is coming to Greenville, SC!\nMeet the Princesses at The Fairytale Ball! This Fairytale Event is full of magical moments you won't want to miss! Dance with Tinkerbell! Create a Craft with Rapunzel!  Sing with The Little Mermaid! ALL of our princesses are excited to sing, dance, and play with your little ones! Our event focuses on making sure your little one feels royal throughout all of our activities.\nThis event includes FREE professional princess portraits for every child, crafts, stories, songs, games, and more. \nVIP Tickets: VIP guests will get a full extra hour with our princesses. You will be able to take photos with the princesses, enjoy our princess parade, share stories and magical moments during this VIP social hour.\nFairytale Tickets: The Fairytale Ball includes our royal entrance, ocean yoga, and freeze dance! Then we enjoy dancing, stories, songs, crafts, photo opportunities, performances and more! The event is 1 hour and 45 minutes.\n\nFor the comfort and safety of our event adults and children must attend together - no solo\n\nTickets are transferable but non-refundable. \n\nGuardians must be present with their child throughout the entire event.\n\nPretty Princess Parties reserve the right to change the date, time, location, reschedule or cancel this event with a full refund of your ticket price due to unforeseeable circumstances, including but not limited to weather, low ticket sales, etc. \n\nCharacters and activities may vary from city to city.\n\nWe will always have more than 10 princesses present at The Fairytale Ball.\n\nPretty Princess Parties reserves the right to refuse entry or remove a guest from our event for any reason.\n\nBy participating in this event, you specifically release Pretty Princess Parties from any claims or liabilities of any kind whatsoever, arising from or related to your participation in these activities.\n\nBy participating in this event, you agree to give consent to Pretty Princess Parties and its authorized representatives, granting them permission to photograph and/or video record your participation in this event. You further agree that all photographs and materials recorded may be used in any form, as part of any future publication, video, brochure and or other printed material for promotion.\n", "title": "Greenville Fairytale Ball", "selectedPreferences": ["Relaxing", "Active", "Cultural", "Relaxing"], "selectedCategories": ["Free", "Shows", "Family"], "primaryPreference": "Relaxing", "primaryCategory": "Family"}, {"description": "Join us April 19–21, 2019 in Cincinnati, Ohio to celebrate what it means to be an atheist in America! \nAmerican Atheists is proud to present one of the most diverse and compelling line-ups of speakers, activists, community leaders, academics, musicians, and artists that you’ll see at any atheist event in America. As always, we’re committed to bringing brand new stories you’ve never heard to the stage, including international activists, poets, politicians, and much more.\nWith three days of speakers, social events, comedy, music, workshops, and community events, this is the one event you don’t want to miss!", "title": "American Atheists 2019 National Convention", "selectedPreferences": ["Relaxing", "Relaxing"], "selectedCategories": ["Shows", "Professional"], "primaryPreference": "Relaxing", "primaryCategory": "Professional"}, {"description": "\r\n \r\nGet a piece of the action!\r\nSmall businesses interested in doing business with government agencies and prime contractors are encouraged to attend this Trade Fair.\r\nCoupling education with marketing strategies, this event will provide small businesses an opportunity to meet with representatives from more than 70 Federal, State and local agencies, commercial/prime contractors, and nonprofit organizations; access available technical assistance; and learn about upcoming contracts.\r\nThe 20th Annual SADBOC Government Procurement Fair is sponsored by the Federal Executive Board’s (FEB),  Small and Disadvantaged Business Opportunity Council (SADBOC), in cooperation with Procurement Technical Assistance Center (PTAC) and the U.S. Small Business Administration (SBA).\r\n\r\nMatchmaking\r\nSmall businesses have the opportunity to be matched with a government or corporate buyer interested in their particular product/service (by appointment only). Register now for a 10 minute appointment click here, http://sadbocmatchmaking.eventbrite.com.  Matchmaking will close April 12th, 2019.\r\n \r\n\r\n20th Annual SADBOC Government Procurement Fair \r\nAGENDA\r\n8:30 am: Registration9:00 am - 3:00 pm: Trade Fair and Workshops12:30 pm - 3:00 pm:  Matchmaking\r\n \r\n\r\n \r\n \r\nWORKSHOPS\r\nThe Basics of Selling to the GovernmentMN Dept. of Administration, Procurement Technical Assistance Center (PTAC)\r\n \r\nFundamentals of Government Contract Law Eckland & Blando, LLP\r\n \r\nUnderstanding the GSA Federal Supply (FSS) Schedule ProgramGeneral Services Administration (GSA)\r\n \r\nSection 3 Collaborative HUD, Washington County CDA, and City of St. Paul\r\n \r\nSelling to the State of Minnesota MN Department of Administration\r\n \r\nFinding Contracting Opportunities MN Dept. of Administration, Procurement Technical Assistance Center (PTAC)\r\n \r\nFederal Certifications: 8(a); HUBZone, WOSB/EDWOSB US Small Business Administration (SBA)\r\n \r\nCERT and St Paul Business Services and Resources City of St. Paul\r\n \r\nWBE and MBE: Corporate Certifications for Minority and Women Owned BusinessesWomen’s Business Development Center (WBDC) and North Central Minority Supplier Development Council (NCMSDC)\r\n \r\nTG/ED/VO Certifications with the State of Minnesota MN Dept of Administration, Office of Equity in Procurement (OEP)\r\n \r\nDon't be a Fraud! The False Claims Act and Other Dangers The Law Office of Tim Connelly, PLLC\r\n \r\nDisadvantaged Business Enterprise (DBE) Certification Metropolitan Council\r\n \r\nThe Davis Bacon and Service Contract Acts Corey Walton, U.S. Dept of Labor\r\nRights & Responsibilities of a Federal Subcontractor Morrison Sund, PLLC, Attorneys at Law\r\n \r\nCybersecurity Considerations for Small Business MN Small Business Development Center\r\n \r\nSix Part Series on Federal Contracting Readiness!- DCAA Compliance- Pre-Award Survey and the SF 1408- Developing Indirect Rates and Multipliers- Bid vs. No Bid Estimating Templates- Job Costing: Estimating vs. ActuaL- Management Accounting Eric Ruffin, Ruffin Consulting Services\r\n \r\n\r\n \r\n \r\nEXHIBITING ORGANIZATIOS\r\n \r\nFederal GovernmentUSDA Animal Plant Health Inspection Service, Air Force Reserve Airlift Wing 934th, VA Medical Center, VA National Acquisition Center, U.S.D. A. Forest Service, U.S. Army Corps of Engineers, Small Business Administration, U.S. Dept of Labor, U.S. EPA, Indian Health Service, Minot Air Force Base, HUD, GSA\r\n \r\nNon-Profit Service ProvidersAssociation of Women Contractors, Small Business Development Centers (SBDC), Minnesota Minority Goods and Services Association, Wisconsin Procurement Institute, North Central Minority Supplier Development Council, Veterans Business Outreach Center, SCORE, Women’s Business Development Center (WBDC), Association of the U.S. Army (AUSA), National Association of Minority Contractors, LegalCorps\r\n \r\nState and Local GovernmentCity of Minneapolis, MN Dept of Administration - OEP, MinnState, MN PTAC, MNDoT, City of Saint Paul, Metropolitan Airports Commission, Metropolitan Council, Ramsey County, University of Minnesota, Hennepin County\r\n \r\nPrime ContractorsLHB, Noridian Healthcare Solutions, Mayo Clinic, Knutson Construction, Cargill, HGA Architects and Engineers, ICS Inc, LS Black Constructors, McGough Construction, Medtronic, Northrop Grumman Innovation Systems, Red Wing Brands, Toro Company, Walman Instruments, Xcel Energy, Adolfson & Peterson Construction, Kraus-Anderson, PaR Systems, IC Systems, Walman Instruments., 3M, J.F. Brennan, Kraus Anderson, Ames Construction, Rosemount Aerospace, Ryan Companies\r\n \r\n\r\n \r\nThis event is sponsored by the Federal Executive Board of Minnesota, in cooperation with the Procurement Technical Assistance Center and U.S. Small Business Administration.\r\n \r\n ", "title": "20th Annual SADBOC Government Procurement Fair", "selectedPreferences": ["Active"], "selectedCategories": ["Professional"], "primaryPreference": "Active", "primaryCategory": "Professional"}]